
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

85-user 4-core Stata network perpetual license:
       Serial number:  501406288112
         Licensed to:  Department of Economics
                       University of Zurich

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do CogNonCog_WLS.do 

. * Project:              cogNoncog
. * Content:              prediction Analysis
. * Author:               Pietro 
. * Adapted by:           Dan Belsky
. * Date:                 February 2019
. 
. /* 
> This code runs the prediction analysis of the cog and noncog PGS in the WLS d
> ata
> */
. 
. *****************************************************************************
> ***
. *********************************** PREAMBLE ********************************
> ***
. *****************************************************************************
> ***
. capture log close

. clear all

. est clear

. set more off

. set emptycells drop

. set matsize 10000

. set maxvar 20000


. 
. global DIRPGS  "/mnt/data/Research/cogNoncogGSEM/PGS/WLS"

. global DIRDATA "/mnt/department/econ/biroli/geighei/data/WLS/"

. global DIRCODE "/mnt/data/Research/cogNoncogGSEM/analysis/WLS"

. 
. 
. cd ${DIRCODE}/output
/mnt/data/Research/cogNoncogGSEM/analysis/WLS/output

. 
. log using cogNoncog_WLS.log, replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/data/Research/cogNoncogGSEM/analysis/WLS/output/cogNoncog_WLS
> .log
  log type:  text
 opened on:  20 Mar 2019, 18:35:57

. 
. global CREATEDATA = 1

. global RUNREG     = 1

. 
. 
. 
. if $CREATEDATA==1{
. *****************************************************************************
> ***
. *******************************MERGE THE DATA *******************************
> ***
. *****************************************************************************
> ***
. *------------ Import the PGS created in plink
. import delimited "${DIRPGS}/COG_PGS_WLS.profile", clear delimiter(space, coll
> apse)
(7 vars, 9,109 obs)
. drop v1 pheno cnt cnt2 
. rename score COG_PGS
. compress
  (0 bytes saved)
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /mnt/data/Research/cogNoncogGSEM/PGS/WLS/cogNoncogPGS.dta saved
. 
. import delimited "${DIRPGS}/NONCOG_PGS_WLS.profile", clear delimiter(space, c
> ollapse)
(7 vars, 9,109 obs)
. drop v1 pheno cnt cnt2 
. rename score NONCOG_PGS
. compress
  (0 bytes saved)
. merge 1:1 fid iid using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,109  (_merge==3)
    -----------------------------------------
. drop _merge
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /mnt/data/Research/cogNoncogGSEM/PGS/WLS/cogNoncogPGS.dta saved
. 
. import delimited "${DIRPGS}/EA3_PGS_WLS.profile", clear delimiter(space, coll
> apse)
(7 vars, 9,109 obs)
. drop v1 pheno cnt cnt2 
. rename score EA3_PGS
. compress
  (0 bytes saved)
. merge 1:1 fid iid using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,109  (_merge==3)
    -----------------------------------------
. drop _merge
. 
. duplicates report fid iid

Duplicates in terms of fid iid

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |         9109             0
--------------------------------------
. destring fid, force gen(subject_id)
fid: contains nonnumeric characters; subject_id generated as long
(12 missing values generated)
. destring iid, force gen(iid_n)
iid: contains nonnumeric characters; iid_n generated as long
(97 missing values generated)
. 
. /*  fid and iid are the same, expect for those that a NA for one of them. I d
> rop them and end up with the sampe of 9012 individuals that is suggested by t
> he WLS
> 
> "After the GACâ€™s standardized QC procedures, including resolution of sample q
> uality and identity, 
> genotypes are available on dbGaP for 9,012 unique WLS study participants. 
> (Note for 15 pairs of monozygotic twins, only one member of each pair is reta
> ined in the unique set of 9,012 participants.)"
> 
> 
> gen diff = subject_id - iid_n
> sum diff
> */
. 
. drop if missing(subject_id)==1
(12 observations deleted)
. drop if missing(iid_n)==1
(85 observations deleted)
. drop fid iid iid_n
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /mnt/data/Research/cogNoncogGSEM/PGS/WLS/cogNoncogPGS.dta saved
. 
. *------------ Merge with the principal components
. import delimited "${DIRDATA}/RawData/WLS_Genotypic_Data/AA_Readme/Principal_c
> omponents.csv", clear delimiter(comma, collapse)
(23 vars, 9,012 obs)
. merge 1:1 subject_id using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,012  (_merge==3)
    -----------------------------------------
. drop _merge
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /mnt/data/Research/cogNoncogGSEM/PGS/WLS/cogNoncogPGS.dta saved
. 
. *------------ Merge with the information data
. import delimited "${DIRDATA}/RawData/WLS_Genotypic_Data/AA_Readme/Sample_anal
> ysis.csv", clear delimiter(comma, collapse)
(15 vars, 9,109 obs)
. destring subject_id, replace force 
subject_id: contains nonnumeric characters; replaced as long
(97 missing values generated)
. drop if missing(subject_id)==1
(97 observations deleted)
. drop sample_id 
. merge 1:1 subject_id using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,012  (_merge==3)
    -----------------------------------------
. drop _merge
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /mnt/data/Research/cogNoncogGSEM/PGS/WLS/cogNoncogPGS.dta saved
. 
. 
. *------------ Merge with the phenotypic data
. use "${DIRDATA}/RawData/WLS_Survey_PhenotypicLong-formData-13_06/wls_plg_13_0
> 6.dta", clear
. keep idpriv-rlifewv srbmi-rbmc6  *iq*  z_rh00* z_edeqyr edat16 hidg64 z_ha103
> rea  ///
>      z_jh001rec-z_jg361rer ///personality
>      z_jzg01rer hsr* ///
>       
. 
. destring subject_id , replace
subject_id: all characters numeric; replaced as long
(10023 missing values generated)
. drop if missing(subject_id)==1
(10,023 observations deleted)
. duplicates report subject_id if subject_id <.

Duplicates in terms of subject_id

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |         8997             0
        2 |           30            15
--------------------------------------
. duplicates drop subject_id, force

Duplicates in terms of subject_id

(15 observations deleted)
. merge 1:1 subject_id using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,012  (_merge==3)
    -----------------------------------------
. drop _merge
. 
. 
. *------------ Clean and rename some vars
. mvdecode sibcount-rlifewv z_spwiiq_f-z_rh009rec z_ha103rea z_jh001rec-z_jg361
> rer,  mv(-1 = .a \ -2 = .b \ -3 = .r \ -4 = .d \ -5 = .e \ -27 = .f \ -29 = .
> g)
       srel1: 29 missing values generated
       srel2: 186 missing values generated
       srel3: 4 missing values generated
       srel4: 2 missing values generated
    z_brdxdy: 27 missing values generated
    z_deatyr: 8523 missing values generated
       twinr: 461 missing values generated
      rspw64: 625 missing values generated
     rinlife: 5467 missing values generated
    rlifesit: 5467 missing values generated
    rliferpt: 5534 missing values generated
     rlifewv: 5467 missing values generated
  z_spwiiq_f: 1746 missing values generated
  z_spwiiq_p: 3097 missing values generated
  z_spwiiq_j: 1068 missing values generated
  z_spwiiq_s: 3229 missing values generated
     hsrankq: 352 missing values generated
    hsrscorq: 352 missing values generated
     gwiiq_j: 426 missing values generated
     gwiiq_f: 1735 missing values generated
     swiiq_t: 533 missing values generated
      edat16: 2921 missing values generated
      hidg64: 3663 missing values generated
    z_edeqyr: 2234 missing values generated
  z_rh001rec: 252 missing values generated
  z_rh003rec: 154 missing values generated
  z_rh005rec: 228 missing values generated
  z_rh007rec: 122 missing values generated
  z_rh009rec: 132 missing values generated
  z_ha103rea: 1400 missing values generated
  z_jh001rec: 229 missing values generated
  z_jh001rei: 264 missing values generated
   z_jh002re: 17 missing values generated
  z_jh003rer: 289 missing values generated
  z_jh004rer: 430 missing values generated
  z_jh005rer: 356 missing values generated
  z_jh006rer: 370 missing values generated
  z_jh007rer: 387 missing values generated
  z_jh008rer: 402 missing values generated
  z_jh009rec: 232 missing values generated
  z_jh009rei: 271 missing values generated
   z_jh010re: 17 missing values generated
  z_jh011rer: 342 missing values generated
  z_jh012rer: 365 missing values generated
  z_jh013rer: 356 missing values generated
  z_jh014rer: 381 missing values generated
  z_jh015rer: 357 missing values generated
  z_jh016rer: 322 missing values generated
  z_jh017rec: 237 missing values generated
  z_jh017rei: 266 missing values generated
   z_jh018re: 17 missing values generated
  z_jh019rer: 333 missing values generated
  z_jh020rer: 349 missing values generated
  z_jh021rer: 421 missing values generated
  z_jh022rer: 370 missing values generated
  z_jh023rer: 335 missing values generated
  z_jh024rer: 321 missing values generated
  z_jh025rec: 246 missing values generated
  z_jh025rei: 290 missing values generated
   z_jh026re: 17 missing values generated
  z_jh027rer: 381 missing values generated
  z_jh028rer: 328 missing values generated
  z_jh029rer: 378 missing values generated
  z_jh030rer: 368 missing values generated
  z_jh031rer: 394 missing values generated
  z_jh032rec: 246 missing values generated
  z_jh032rei: 285 missing values generated
   z_jh033re: 17 missing values generated
  z_jh034rer: 400 missing values generated
  z_jh035rer: 368 missing values generated
  z_jh036rer: 498 missing values generated
  z_jh037rer: 402 missing values generated
  z_jh038rer: 348 missing values generated
  z_jh039rer: 366 missing values generated
  z_jn001rec: 131 missing values generated
  z_jn001rei: 251 missing values generated
   z_jn002re: 17 missing values generated
  z_jn004rer: 278 missing values generated
  z_jn007rer: 309 missing values generated
  z_jn009rer: 315 missing values generated
  z_jn101rer: 278 missing values generated
  z_jn107rer: 264 missing values generated
  z_jn010rec: 130 missing values generated
  z_jn010rei: 246 missing values generated
   z_jn011re: 17 missing values generated
  z_jn014rer: 253 missing values generated
  z_jn016rer: 336 missing values generated
  z_jn017rer: 333 missing values generated
  z_jn102rer: 256 missing values generated
  z_jn108rer: 272 missing values generated
  z_jn019rec: 134 missing values generated
  z_jn019rei: 251 missing values generated
   z_jn020re: 17 missing values generated
  z_jn022rer: 326 missing values generated
  z_jn023rer: 327 missing values generated
  z_jn024rer: 268 missing values generated
  z_jn103rer: 251 missing values generated
  z_jn109rer: 280 missing values generated
  z_jn028rec: 131 missing values generated
  z_jn028rei: 153 missing values generated
   z_jn029re: 17 missing values generated
  z_jn031rer: 300 missing values generated
  z_jn032rer: 323 missing values generated
  z_jn033rer: 361 missing values generated
  z_jn034rer: 253 missing values generated
  z_jn104rer: 269 missing values generated
  z_jn110rer: 281 missing values generated
  z_jn037rec: 128 missing values generated
  z_jn037rei: 297 missing values generated
   z_jn038re: 17 missing values generated
  z_jn041rer: 320 missing values generated
  z_jn043rer: 338 missing values generated
  z_jn044rer: 304 missing values generated
  z_jn045rer: 346 missing values generated
  z_jn105rer: 259 missing values generated
  z_jn111rer: 284 missing values generated
  z_jn046rec: 128 missing values generated
  z_jn046rei: 296 missing values generated
   z_jn047re: 17 missing values generated
  z_jn049rer: 314 missing values generated
  z_jn050rer: 350 missing values generated
  z_jn054rer: 312 missing values generated
  z_jn106rer: 259 missing values generated
  z_jn112rer: 305 missing values generated
  z_jn601rer: 282 missing values generated
  z_jn603rer: 299 missing values generated
  z_jn604rer: 306 missing values generated
  z_jn605rer: 292 missing values generated
  z_jvm02rer: 266 missing values generated
  z_jvm03rer: 307 missing values generated
  z_jvm04rer: 295 missing values generated
  z_jvm06rer: 307 missing values generated
  z_jvm07rer: 325 missing values generated
  z_jvm08rer: 292 missing values generated
  z_jvm09rer: 298 missing values generated
  z_jg307rer: 275 missing values generated
  z_jg360rer: 265 missing values generated
  z_jg361rer: 277 missing values generated
.  
. recode z_sexrsp (2 = 0)
(z_sexrsp: 4692 changes made)
. rename z_sexrsp male
. tab male

                  RS sex of participant |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |      4,692       52.06       52.06
                                   male |      4,320       47.94      100.00
----------------------------------------+-----------------------------------
                                  Total |      9,012      100.00
. 
. rename z_brdxdy yob
. replace yob = 1900+yob
variable yob was byte now int
(9,012 real changes made, 27 to missing)
. replace yob = .w if yob<1900
(0 real changes made)
. 
. rename z_edeqyr eduyears
. 
. //Personality
. rename z_jh001rei extra
. rename z_jh032rei openn
. rename z_jh025rei neuro
. rename z_jh017rei consc
. rename z_jh009rei agree
. 
. 
. rename z_jn001rei autonomy
. rename z_jn010rei envmastery
. rename z_jn019rei persgrowth
. rename z_jn028rei posrel
. rename z_jn037rei purposelife
. rename z_jn046rei selfaccept
. 
. /* phone questionnaire
> rename z_rh001rec extra
> rename z_rh003rec openn
> rename z_rh005rec neuro
> rename z_rh007rec consc
> rename z_rh009rec agree
> */
. 
. //IQ
. rename gwiiq_bm iq
. 
. //attractiveness
. rename z_ha103rea attractive
. 
. 
. rename z_jzg01rer hs_classrank
. rename hsrankq    gpa_hsrank
. rename hsrscorq   gpa_hsranknorm
. 
. 
. /* Reverse Raw PGSs beacuse of LDpred
> foreach var of varlist *PGS{
>         replace `var' = `var'*-1
>         }
> */
. 
. //Standardize
. foreach var of varlist *PGS{
  2.         egen `var'_std = std(`var')
  3.         replace `var' = `var'_std
  4.         drop `var'_std
  5.         }
(9,012 real changes made)
(9,012 real changes made)
(9,012 real changes made)
. 
. 
. save "${DIRDATA}/CleanData/WLS_cognoncogPred.dta", replace
file /mnt/department/econ/biroli/geighei/data/WLS//CleanData/WLS_cognoncogPred.
> dta saved
. } // end CREATEDATA

. 
. 
. 
. if $RUNREG==1{
. use "${DIRDATA}/CleanData/WLS_cognoncogPred.dta", clear
. 
. ****************************************************************************
. *****************  MULTIVARIATE ANALYSIS - WLS *****************************
. ****************************************************************************
. gen yob2 = yob^2
(27 missing values generated)
. // standardize IQ
. egen temp = std(iq)
(3280 missing values generated)
. replace iq = temp
variable iq was int now float
(5,732 real changes made)
. drop temp
. 
. foreach yvar in eduyears iq extra openn neuro consc agree attractive{
  2.         local yvar z_mh017rei
  3.         des `yvar'
  4.         sum `yvar'
  5.         
.         reg `yvar' COG_PGS            yob yob2 male ev1-ev20, cluster(familyp
> riv)
  6.         estimate store cog_`yvar'
  7.         
.         reg `yvar'         NONCOG_PGS yob yob2 male ev1-ev20, cluster(familyp
> riv)
  8.         estimate store noncog_`yvar'
  9. 
.         reg `yvar' COG_PGS NONCOG_PGS yob yob2 male ev1-ev20, cluster(familyp
> riv)
 10.         estimate store both_`yvar'
 11. } //end forloop yvar
variable z_mh017rei not found
r(111);
. 
. *--------------Coefficient plot output
. *-- Cognitive PGS
. coefplot  (both_eduyears , aseq(Years of edu)) ///
>           (both_iq , aseq(IQ)) ///
>           (both_extra, aseq(Extraversion)) ///
>           (both_openn, aseq(Openness)) ///
>           (both_neuro, aseq(Neuroticism)) ///
>           (both_consc, aseq(Conscientiousness)) ///
>           (both_agree, aseq(Agreeableness)) ///
>           (both_attractive, aseq(Attractiveness)) ///
>    , keep(COG_PGS) ///
>    msymbol(D) xline(0) byopts(xrescale) levels(95 90) ciopts(recast(. rcap)) 
> legend(order(1 "95% c.i." 2 "90% c.i." )) graphregion(color(white)) bgcolor(w
> hite) ///ciopts(lwidth(2 ..) lcolor(*.2 *.4 ; )) xlabel(-.12(.04).12) 
>    aseq swapnames 
. 
. graph save   coefplot_cog, replace
. graph export coefplot_cog.png, replace
. 
. *-- Noncognitive PGS
. coefplot  (both_eduyears , aseq(Years of edu)) ///
>           (both_iq , aseq(IQ)) ///
>           (both_extra, aseq(Extraversion)) ///
>           (both_openn, aseq(Openness)) ///
>           (both_neuro, aseq(Neuroticism)) ///
>           (both_consc, aseq(Conscientiousness)) ///
>           (both_agree, aseq(Agreeableness)) ///
>           (both_attractive, aseq(Attractiveness)) ///
>    , keep(NONCOG_PGS) ///
>    msymbol(D) xline(0) byopts(xrescale) levels(95 90) ciopts(recast(. rcap)) 
> legend(order(1 "95% c.i." 2 "90% c.i." )) graphregion(color(white)) bgcolor(w
> hite) ///ciopts(lwidth(2 ..) lcolor(*.2 *.4 ; )) xlabel(-.12(.04).12) 
>    aseq swapnames 
. 
. graph save   coefplot_noncog, replace
. graph export coefplot_noncog.png, replace
. 
. 
. *-- Both PGS
. coefplot  (both_eduyears , aseq(Years of edu)) ///
>           (both_iq , aseq(IQ)) ///
>           (both_extra, aseq(Extraversion)) ///
>           (both_openn, aseq(Openness)) ///
>           (both_neuro, aseq(Neuroticism)) ///
>           (both_consc, aseq(Conscientiousness)) ///
>           (both_agree, aseq(Agreeableness)) ///
>           (both_attractive, aseq(Attractiveness)) ///
>    , keep(COG_PGS NONCOG_PGS) ///
>    msymbol(D) xline(0) byopts(xrescale) levels(95 90) ciopts(recast(. rcap)) 
> legend(order(1 "95% c.i." 2 "90% c.i." )) graphregion(color(white)) bgcolor(w
> hite) ///ciopts(lwidth(2 ..) lcolor(*.2 *.4 ; )) xlabel(-.12(.04).12) 
>    aseq swapnames 
. 
. graph save   coefplot_both, replace
. graph export coefplot_both.png, replace
. 
. 
. } // end RUNREG
r(111);

end of do-file
r(111);
