-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/michellerosenberger/Development/GEIGHEI/WLSanalysis/WLS/output/co
> gNoncog_WLS.log
  log type:  text
 opened on:  28 Mar 2019, 10:21:40

. 
. *------------ Global variables
. global CREATEDATA = 1

. global RUNREG     = 1

. 
. 
. 
. if $CREATEDATA==1{
. ********************************************************************************
. *******************************MERGE THE DATA **********************************
. ********************************************************************************
. *------------ Import the PGS created in plink
. import delimited "${DIRPGS}/COG_PGS_WLS.profile", clear delimiter(space, collapse)
(7 vars, 6,539 obs)
. drop v1 pheno cnt cnt2 
. rename score COG_PGS
. compress
  (0 bytes saved)
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /Volumes/g_econ_department$/econ/biroli/geighei/data/WLS/CleanData/PGS/cogNoncog
> PGS.dta saved
. 
. import delimited "${DIRPGS}/NONCOG_PGS_WLS.profile", clear delimiter(space, collaps
> e)
(7 vars, 6,539 obs)
. drop v1 pheno cnt cnt2 
. rename score NONCOG_PGS
. compress
  (0 bytes saved)
. merge 1:1 fid iid using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             6,539  (_merge==3)
    -----------------------------------------
. drop _merge
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /Volumes/g_econ_department$/econ/biroli/geighei/data/WLS/CleanData/PGS/cogNoncog
> PGS.dta saved
. 
. import delimited "${DIRPGS}/EA3_PGS_WLS.profile", clear delimiter(space, collapse)
(7 vars, 6,539 obs)
. drop v1 pheno cnt cnt2 
. rename score EA3_PGS
. compress
  (0 bytes saved)
. merge 1:1 fid iid using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             6,539  (_merge==3)
    -----------------------------------------
. drop _merge
. 
. duplicates report fid iid

Duplicates in terms of fid iid

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |         6539             0
--------------------------------------
. destring fid, force gen(subject_id)
fid already numeric; no generate
. destring iid, force gen(iid_n)
iid already numeric; no generate
. 
. rename fid subject_id   // fid already numeric
. rename iid iid_n        // iid already numeric
. 
. /*  fid and iid are the same, expect for those that a NA for one of them. I drop th
> em and end up with the sampe of 9012 individuals that is suggested by the WLS
> 
> "After the GACâ€™s standardized QC procedures, including resolution of sample quality
>  and identity, 
> genotypes are available on dbGaP for 9,012 unique WLS study participants. 
> (Note for 15 pairs of monozygotic twins, only one member of each pair is retained i
> n the unique set of 9,012 participants.)"
> 
> 
> gen diff = subject_id - iid_n
> sum diff
> */
. 
. drop if missing(subject_id)==1
(0 observations deleted)
. drop if missing(iid_n)==1
(0 observations deleted)
. * drop fid iid iid_n
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /Volumes/g_econ_department$/econ/biroli/geighei/data/WLS/CleanData/PGS/cogNoncog
> PGS.dta saved
. 
. 
. *------------ Merge with the principal components
. import delimited "${DIRDATA}/RawData/WLS_Genotypic_Data/AA_Readme/Principal_compone
> nts.csv", clear delimiter(comma, collapse)
(23 vars, 9,012 obs)
. merge 1:1 subject_id using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,473
        from master                     2,473  (_merge==1)
        from using                          0  (_merge==2)

    matched                             6,539  (_merge==3)
    -----------------------------------------
. drop _merge
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /Volumes/g_econ_department$/econ/biroli/geighei/data/WLS/CleanData/PGS/cogNoncog
> PGS.dta saved
. 
. 
. *------------ Merge with the information data
. import delimited "${DIRDATA}/RawData/WLS_Genotypic_Data/AA_Readme/Sample_analysis.c
> sv", clear delimiter(comma, collapse)
(15 vars, 9,109 obs)
. destring subject_id, replace force 
subject_id: contains nonnumeric characters; replaced as long
(97 missing values generated)
. drop if missing(subject_id)==1
(97 observations deleted)
. drop sample_id 
. merge 1:1 subject_id using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,012  (_merge==3)
    -----------------------------------------
. drop _merge
. save "${DIRPGS}/cogNoncogPGS.dta", replace
file /Volumes/g_econ_department$/econ/biroli/geighei/data/WLS/CleanData/PGS/cogNoncog
> PGS.dta saved
. 
. 
. *------------ Merge with the phenotypic data
. use "${DIRDATA}/RawData/WLS_Survey_PhenotypicLong-formData-13_06/wls_plg_13_06.dta"
> , clear
. keep idpriv-rlifewv srbmi-rbmc6  *iq*  z_rh00* z_edeqyr edat16 hidg64 z_ha103rea  /
> //
>      z_jh001rec-z_jg361rer ///personality
>      z_jzg01rer hsr* ri001re si001re z_ie008re z_hi101re
. 
. destring subject_id , replace
subject_id: all characters numeric; replaced as long
(10023 missing values generated)
. drop if missing(subject_id)==1
(10,023 observations deleted)
. duplicates report subject_id if subject_id <.

Duplicates in terms of subject_id

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |         8997             0
        2 |           30            15
--------------------------------------
. duplicates drop subject_id, force

Duplicates in terms of subject_id

(15 observations deleted)
. merge 1:1 subject_id using "${DIRPGS}/cogNoncogPGS.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,012  (_merge==3)
    -----------------------------------------
. drop _merge
. 
. *------------ Clean and rename some vars
. mvdecode sibcount-rlifewv z_spwiiq_f-z_rh009rec z_ha103rea z_jh001rec-z_jg361rer z_
> jh001rei-z_jh009rei z_ie008re z_jzg01rer z_hi101re,  mv(-1 = .a \ -2 = .b \ -3 = .r
>  \ -4 = .d \ -5 = .e \ -27 = .f \ -29 = .g)
       srel1: 29 missing values generated
       srel2: 186 missing values generated
       srel3: 4 missing values generated
       srel4: 2 missing values generated
    z_brdxdy: 27 missing values generated
    z_deatyr: 8523 missing values generated
       twinr: 461 missing values generated
      rspw64: 625 missing values generated
     rinlife: 5467 missing values generated
    rlifesit: 5467 missing values generated
    rliferpt: 5534 missing values generated
     rlifewv: 5467 missing values generated
  z_spwiiq_f: 1746 missing values generated
  z_spwiiq_p: 3097 missing values generated
  z_spwiiq_j: 1068 missing values generated
  z_spwiiq_s: 3229 missing values generated
     hsrankq: 352 missing values generated
    hsrscorq: 352 missing values generated
     gwiiq_j: 426 missing values generated
     gwiiq_f: 1735 missing values generated
     swiiq_t: 533 missing values generated
      edat16: 2921 missing values generated
      hidg64: 3663 missing values generated
    z_edeqyr: 2234 missing values generated
     ri001re: 24 missing values generated
     si001re: 23 missing values generated
  z_rh001rec: 252 missing values generated
  z_rh003rec: 154 missing values generated
  z_rh005rec: 228 missing values generated
  z_rh007rec: 122 missing values generated
  z_rh009rec: 132 missing values generated
  z_ha103rea: 1400 missing values generated
  z_jh001rec: 229 missing values generated
  z_jh001rei: 264 missing values generated
   z_jh002re: 17 missing values generated
  z_jh003rer: 289 missing values generated
  z_jh004rer: 430 missing values generated
  z_jh005rer: 356 missing values generated
  z_jh006rer: 370 missing values generated
  z_jh007rer: 387 missing values generated
  z_jh008rer: 402 missing values generated
  z_jh009rec: 232 missing values generated
  z_jh009rei: 271 missing values generated
   z_jh010re: 17 missing values generated
  z_jh011rer: 342 missing values generated
  z_jh012rer: 365 missing values generated
  z_jh013rer: 356 missing values generated
  z_jh014rer: 381 missing values generated
  z_jh015rer: 357 missing values generated
  z_jh016rer: 322 missing values generated
  z_jh017rec: 237 missing values generated
  z_jh017rei: 266 missing values generated
   z_jh018re: 17 missing values generated
  z_jh019rer: 333 missing values generated
  z_jh020rer: 349 missing values generated
  z_jh021rer: 421 missing values generated
  z_jh022rer: 370 missing values generated
  z_jh023rer: 335 missing values generated
  z_jh024rer: 321 missing values generated
  z_jh025rec: 246 missing values generated
  z_jh025rei: 290 missing values generated
   z_jh026re: 17 missing values generated
  z_jh027rer: 381 missing values generated
  z_jh028rer: 328 missing values generated
  z_jh029rer: 378 missing values generated
  z_jh030rer: 368 missing values generated
  z_jh031rer: 394 missing values generated
  z_jh032rec: 246 missing values generated
  z_jh032rei: 285 missing values generated
   z_jh033re: 17 missing values generated
  z_jh034rer: 400 missing values generated
  z_jh035rer: 368 missing values generated
  z_jh036rer: 498 missing values generated
  z_jh037rer: 402 missing values generated
  z_jh038rer: 348 missing values generated
  z_jh039rer: 366 missing values generated
  z_jn001rec: 131 missing values generated
  z_jn001rei: 251 missing values generated
   z_jn002re: 17 missing values generated
  z_jn004rer: 278 missing values generated
  z_jn007rer: 309 missing values generated
  z_jn009rer: 315 missing values generated
  z_jn101rer: 278 missing values generated
  z_jn107rer: 264 missing values generated
  z_jn010rec: 130 missing values generated
  z_jn010rei: 246 missing values generated
   z_jn011re: 17 missing values generated
  z_jn014rer: 253 missing values generated
  z_jn016rer: 336 missing values generated
  z_jn017rer: 333 missing values generated
  z_jn102rer: 256 missing values generated
  z_jn108rer: 272 missing values generated
  z_jn019rec: 134 missing values generated
  z_jn019rei: 251 missing values generated
   z_jn020re: 17 missing values generated
  z_jn022rer: 326 missing values generated
  z_jn023rer: 327 missing values generated
  z_jn024rer: 268 missing values generated
  z_jn103rer: 251 missing values generated
  z_jn109rer: 280 missing values generated
  z_jn028rec: 131 missing values generated
  z_jn028rei: 153 missing values generated
   z_jn029re: 17 missing values generated
  z_jn031rer: 300 missing values generated
  z_jn032rer: 323 missing values generated
  z_jn033rer: 361 missing values generated
  z_jn034rer: 253 missing values generated
  z_jn104rer: 269 missing values generated
  z_jn110rer: 281 missing values generated
  z_jn037rec: 128 missing values generated
  z_jn037rei: 297 missing values generated
   z_jn038re: 17 missing values generated
  z_jn041rer: 320 missing values generated
  z_jn043rer: 338 missing values generated
  z_jn044rer: 304 missing values generated
  z_jn045rer: 346 missing values generated
  z_jn105rer: 259 missing values generated
  z_jn111rer: 284 missing values generated
  z_jn046rec: 128 missing values generated
  z_jn046rei: 296 missing values generated
   z_jn047re: 17 missing values generated
  z_jn049rer: 314 missing values generated
  z_jn050rer: 350 missing values generated
  z_jn054rer: 312 missing values generated
  z_jn106rer: 259 missing values generated
  z_jn112rer: 305 missing values generated
  z_jn601rer: 282 missing values generated
  z_jn603rer: 299 missing values generated
  z_jn604rer: 306 missing values generated
  z_jn605rer: 292 missing values generated
  z_jvm02rer: 266 missing values generated
  z_jvm03rer: 307 missing values generated
  z_jvm04rer: 295 missing values generated
  z_jvm06rer: 307 missing values generated
  z_jvm07rer: 325 missing values generated
  z_jvm08rer: 292 missing values generated
  z_jvm09rer: 298 missing values generated
  z_jg307rer: 275 missing values generated
  z_jg360rer: 265 missing values generated
  z_jg361rer: 277 missing values generated
   z_ie008re: 88 missing values generated
  z_jzg01rer: 425 missing values generated
   z_hi101re: 174 missing values generated
. 
. //Gender
. recode z_sexrsp (2 = 0)
(z_sexrsp: 4692 changes made)
. rename z_sexrsp male
. tab male

                  RS sex of participant |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |      4,692       52.06       52.06
                                   male |      4,320       47.94      100.00
----------------------------------------+-----------------------------------
                                  Total |      9,012      100.00
. 
. //White
. recode z_ie008re (2 = 0)
(z_ie008re: 32 changes made)
. rename z_ie008re white
. tab white

          R5 Is your race/origin White? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |         32        0.41        0.41
                                    yes |      7,795       99.59      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,827      100.00
. 
. //Birth year
. rename z_brdxdy yob
. replace yob = 1900+yob
variable yob was byte now int
(9,012 real changes made, 27 to missing)
. replace yob = .w if yob<1900
(0 real changes made)
. 
. //Education
. rename z_edeqyr eduyears
. 
. //Personality
. //Note: this variables have more observations than the "phone questionnaire"
. rename z_rh001rec extra
. rename z_rh003rec openn
. rename z_rh005rec neuro
. rename z_rh007rec consc
. rename z_rh009rec agree
. */
. 
. rename z_jn001rei autonomy
. rename z_jn010rei envmastery
. rename z_jn019rei persgrowth
. rename z_jn028rei posrel
. rename z_jn037rei purposelife
. rename z_jn046rei selfaccept
. 
. 
. /* phone questionnaire
> rename z_jh001rei extra
> rename z_jh032rei openn
> rename z_jh025rei neuro
> rename z_jh017rei consc
> rename z_jh009rei agree
> */
. 
. 
. //IQ
. rename gwiiq_bm iq
. 
. //Attractiveness
. rename z_ha103rea attractive
. 
. //GPA
. rename z_jzg01rer hs_classrank
. rename hsrankq    gpa_hsrank        // High school grades percentile rank
. rename hsrscorq   gpa_hsranknorm    // High school grades percentile rank-normalize
> d
. 
. //Cognition
. rename z_hi101re  cog_sim           // WAIS questions in the Cognition-Similarities
>  Module
. replace cog_sim = . if cog_sim == -30
(181 real changes made, 181 to missing)
. 
. rename ri001re    cog_grad          // Total cognition score GRAD (8-items asked)
. rename si001re    cog_sib           // Total cognition score SIB (10-items asked) 
. 
. 
. /* Cognition variables
> z_gi210rec      R5 Letter Fluency: Total number of scored words named.
> z_gi310rec      R5 Category Fluency: Total number of scored words named.
> z_gi101re       R5 6-item score for the Cognition Similarities section.
> z_gi106re       R5 9-item score for the Cognition Similarities section.
> z_gi413re       R5 How many correct words did participant remember in immediate rec
> all task?
> z_ai101re       R5 6-item score for the Cognition Similarities section.
> z_ai413re       R5 How many correct words did R remember in immediate recall task?
> z_gi503re       R5 Score for digits ordering task.
> z_hi210rec      R6 Letter Fluency: Total number of scored words named.
> z_hi310rec      R6 Category Fluency: Total number of scored words named.
> z_hi101re       R6 6-item score summarizing Participant's performance on Weschler A
> dult
>             Intelligence Scale (WAIS) questions selected for inclusion in the Cogni
> tion - Similarities Module.
> z_hi503re       R6 Score for the Digit Ordering Task if Participant never refused a
> n item.
> z_hinsraschscore        R6 NS Rasch Scoring of all answered questions
> z_hisimplescore R6 Simple Score for McArdle Task
> */
. 
. 
. /* Reverse Raw PGSs beacuse of LDpred
> foreach var of varlist *PGS{
>         replace `var' = `var'*-1
>         }
> */
. 
. //Standardize
. foreach var of varlist *PGS{
  2.         egen `var'_std = std(`var')
  3.         replace `var' = `var'_std
  4.         drop `var'_std
  5.         }
(2473 missing values generated)
(6,539 real changes made)
(2473 missing values generated)
(6,539 real changes made)
(2473 missing values generated)
(6,539 real changes made)
. 
. 
. save "${DIRDATA}/CleanData/WLS_cognoncogPred.dta", replace
file /Volumes/g_econ_department$/econ/biroli/geighei/data/WLS//CleanData/WLS_cognonco
> gPred.dta saved
. 
. } // end CREATEDATA

. 
. 
. 
. if $RUNREG==1{
. use "${DIRDATA}/CleanData/WLS_cognoncogPred.dta", clear
. 
. ****************************************************************************
. *****************  MULTIVARIATE ANALYSIS - WLS *****************************
. ****************************************************************************
. // Only focuse on race/Origin white
. keep if white == 1
(1,217 observations deleted)
. 
. gen yob2 = yob^2
. 
. // standardize IQ
. egen temp = std(iq)
(2772 missing values generated)
. replace iq = temp
variable iq was int now float
(5,023 real changes made)
. drop temp
. 
. // Set phenotypes
. global PHENO "eduyears iq extra openn neuro consc agree attractive gpa_hsrank cog_s
> im"
. 
. 
. *--------------PGS Correlations (as in CogNonCog_181121.do)
. foreach pgs in NONCOG_PGS COG_PGS {
  2.    reg `pgs' ev1-ev20
  3.    predict r`pgs', r 
  4.    egen zr`pgs'=std(r`pgs')
  5. }

      Source |       SS           df       MS      Number of obs   =     5,683
-------------+----------------------------------   F(20, 5662)     =      5.00
       Model |    99.15209        20   4.9576045   Prob > F        =    0.0000
    Residual |  5610.04711     5,662  .990824287   R-squared       =    0.0174
-------------+----------------------------------   Adj R-squared   =    0.0139
       Total |   5709.1992     5,682  1.00478691   Root MSE        =     .9954

------------------------------------------------------------------------------
  NONCOG_PGS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -4.011572   5.034206    -0.80   0.426    -13.88055    5.857401
         ev2 |  -5.983173   1.580094    -3.79   0.000    -9.080763   -2.885584
         ev3 |  -5.190182   1.786742    -2.90   0.004     -8.69288   -1.687484
         ev4 |  -5.061152   2.485756    -2.04   0.042    -9.934185   -.1881192
         ev5 |   4.585282   1.095828     4.18   0.000     2.437038    6.733525
         ev6 |   4.185957   1.082885     3.87   0.000     2.063088    6.308825
         ev7 |  -2.663308   1.106245    -2.41   0.016    -4.831971   -.4946451
         ev8 |   .0280468   1.141567     0.02   0.980    -2.209862    2.265956
         ev9 |   1.044881    1.14943     0.91   0.363    -1.208443    3.298204
        ev10 |  -2.025219   1.065966    -1.90   0.057     -4.11492    .0644825
        ev11 |  -.6516977   1.067921    -0.61   0.542    -2.745232    1.441836
        ev12 |   -2.36703   1.064992    -2.22   0.026    -4.454823   -.2792369
        ev13 |  -.9081645   1.073414    -0.85   0.398    -3.012467    1.196138
        ev14 |  -.3696622   1.075127    -0.34   0.731    -2.477322    1.737998
        ev15 |  -1.286462   1.070335    -1.20   0.229    -3.384729    .8118042
        ev16 |  -1.549991   1.072578    -1.45   0.148    -3.652654    .5526732
        ev17 |    .797524   1.069046     0.75   0.456    -1.298216    2.893264
        ev18 |    -1.8279   1.073626    -1.70   0.089    -3.932618    .2768182
        ev19 |  -2.295332   1.075346    -2.13   0.033    -4.403422   -.1872418
        ev20 |   1.571977   1.074364     1.46   0.143    -.5341868    3.678141
       _cons |  -.0002575   .0135874    -0.02   0.985    -.0268941     .026379
------------------------------------------------------------------------------
(2,112 missing values generated)
(2112 missing values generated)

      Source |       SS           df       MS      Number of obs   =     5,683
-------------+----------------------------------   F(20, 5662)     =      3.55
       Model |  69.4573284        20  3.47286642   Prob > F        =    0.0000
    Residual |  5532.07091     5,662  .977052439   R-squared       =    0.0124
-------------+----------------------------------   Adj R-squared   =    0.0089
       Total |  5601.52824     5,682  .985837423   Root MSE        =    .98846

------------------------------------------------------------------------------
     COG_PGS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -9.346661   4.999098    -1.87   0.062    -19.14681    .4534852
         ev2 |  -6.898924   1.569074    -4.40   0.000    -9.974911   -3.822938
         ev3 |   -.572131   1.774281    -0.32   0.747    -4.050401    2.906139
         ev4 |  -.6947183    2.46842    -0.28   0.778    -5.533767     4.14433
         ev5 |   3.226453   1.088186     2.96   0.003     1.093192    5.359715
         ev6 |   4.344687   1.075333     4.04   0.000     2.236624    6.452751
         ev7 |   2.410531    1.09853     2.19   0.028     .2569926     4.56407
         ev8 |   1.331749   1.133606     1.17   0.240    -.8905532    3.554051
         ev9 |   1.700615   1.141414     1.49   0.136    -.5369939    3.938224
        ev10 |   1.584278   1.058532     1.50   0.135    -.4908501    3.659406
        ev11 |   1.681829   1.060473     1.59   0.113    -.3971049    3.760762
        ev12 |  -.6384528   1.057565    -0.60   0.546    -2.711685     1.43478
        ev13 |   1.286392   1.065928     1.21   0.228    -.8032359    3.376019
        ev14 |  -.4922593   1.067629    -0.46   0.645     -2.58522    1.600702
        ev15 |   .1359257    1.06287     0.13   0.898    -1.947707    2.219559
        ev16 |  -.3136669   1.065098    -0.29   0.768    -2.401667    1.774333
        ev17 |  -.5751812   1.061591    -0.54   0.588    -2.656306    1.505943
        ev18 |   2.153196   1.066138     2.02   0.043      .063156    4.243236
        ev19 |   .8458122   1.067847     0.79   0.428    -1.247576    2.939201
        ev20 |   .2762377   1.066871     0.26   0.796    -1.815238    2.367713
       _cons |    .010042   .0134927     0.74   0.457    -.0164088    .0364928
------------------------------------------------------------------------------
(2,112 missing values generated)
(2112 missing values generated)
. 
. corr zrNONCOG_PGS zrCOG_PGS
(obs=5,683)

             | zrNONC~S zrCOG_~S
-------------+------------------
zrNONCOG_PGS |   1.0000
   zrCOG_PGS |  -0.3735   1.0000

. matrix X = r(C)
. putexcel set "${DIRCODE}/output/CogNonCog_WLS.xlsx", sheet(WLSPGSCorr) modify
. putexcel a1=matrix(X), names
file /Users/michellerosenberger/Development/GEIGHEI/WLSanalysis/WLS/output/CogNonCog_
> WLS.xlsx saved
. 
. 
. *--------------Univariate Analysis (as in CogNonCog_181121.do)
. // Univariate Program
. capture program drop FX 
. program define FX
  1.    args y 
  2.    matrix Fx = J(1,6,999)
  3.    capture drop Y
  4.    egen Y = std(`y')
  5.    foreach x in NONCOG_PGS COG_PGS {
  6.       capture drop Z
  7.       egen Z = std(`x')
  8.       reg Y ev1-ev20 male, robust
  9.       local R2 = e(r2)
 10.       reg Y Z ev1-ev20 male, robust 
 11.       matrix A = e(N), _b[Z], _se[Z], e(r2)-`R2', 2*ttail(e(df_r), abs(_b[Z]/_se
> [Z])), sqrt(e(r2)-`R2')
 12.       matrix rownames A = `x'
 13.       matrix Fx = Fx \ A
 14.       drop Z
 15.       }
 16.    matrix Fx = Fx[2...,1...]
 17.    matrix colnames Fx = N Beta SE DeltaR2 Pval SqrtDeltaR2
 18.    matrix `y' = Fx
 19.    drop Y
 20. end
. 
. // Apply Program
. foreach pheno in $PHENO {
  2.    di "Univariate Analysis for `pheno'"
  3.    FX `pheno'
  4. }
Univariate Analysis for eduyears
(1855 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,940
                                                F(21, 5918)       =      19.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0623
                                                Root MSE          =     .97007

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   2.734024   4.331492     0.63   0.528    -5.757281    11.22533
         ev2 |  -7.582585   1.388826    -5.46   0.000    -10.30519   -4.859979
         ev3 |  -2.270935   1.588998    -1.43   0.153    -5.385951    .8440803
         ev4 |  -.0476083   2.103296    -0.02   0.982    -4.170837     4.07562
         ev5 |   5.329648   1.074691     4.96   0.000     3.222862    7.436434
         ev6 |   9.037832    1.04968     8.61   0.000     6.980077    11.09559
         ev7 |   -.892221   1.075417    -0.83   0.407    -3.000431    1.215989
         ev8 |   2.023586   1.131689     1.79   0.074    -.1949368    4.242109
         ev9 |   2.370358   1.160635     2.04   0.041      .095089    4.645627
        ev10 |   .8153664   1.052045     0.78   0.438    -1.247025    2.877758
        ev11 |  -.7885773   1.068533    -0.74   0.461    -2.883291    1.306136
        ev12 |   -1.53266   1.066235    -1.44   0.151     -3.62287    .5575505
        ev13 |  -.1908378   1.098125    -0.17   0.862    -2.343563    1.961887
        ev14 |   1.625206    1.06626     1.52   0.128    -.4650533    3.715465
        ev15 |  -1.408867    1.08079    -1.30   0.192     -3.52761    .7098757
        ev16 |  -.0355237   1.051994    -0.03   0.973    -2.097816    2.026768
        ev17 |   1.674113   1.076815     1.55   0.120    -.4368375    3.785063
        ev18 |  -1.591474   1.051787    -1.51   0.130     -3.65336    .4704123
        ev19 |  -.1164015   1.082815    -0.11   0.914    -2.239115    2.006311
        ev20 |  -.0326982   1.064728    -0.03   0.976    -2.119953    2.054557
        male |   .3758996   .0257262    14.61   0.000     .3254669    .4263324
       _cons |  -.1755405   .0149405   -11.75   0.000    -.2048294   -.1462516
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,171
                                                F(22, 5148)       =      20.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0752
                                                Root MSE          =      .9579

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0993966     .01333     7.46   0.000     .0732642     .125529
         ev1 |   2.730065   4.396004     0.62   0.535     -5.88797     11.3481
         ev2 |  -6.677845   1.433791    -4.66   0.000    -9.488684   -3.867006
         ev3 |   -2.32988    1.62579    -1.43   0.152    -5.517119    .8573593
         ev4 |      .1397   2.177842     0.06   0.949    -4.129795    4.409195
         ev5 |   4.689494   1.108524     4.23   0.000     2.516316    6.862672
         ev6 |   8.426758   1.074182     7.84   0.000     6.320906    10.53261
         ev7 |  -1.036948    1.09586    -0.95   0.344    -3.185299    1.111404
         ev8 |   2.187889   1.156031     1.89   0.058    -.0784233    4.454202
         ev9 |   2.175106    1.16928     1.86   0.063    -.1171791    4.467391
        ev10 |   .9693436   1.059827     0.91   0.360    -1.108367    3.047055
        ev11 |  -.5699303   1.085445    -0.53   0.600    -2.697863    1.558003
        ev12 |   -1.24613   1.076505    -1.16   0.247    -3.356538    .8642779
        ev13 |  -.1532067   1.110785    -0.14   0.890    -2.330817    2.024403
        ev14 |   1.346007   1.082095     1.24   0.214    -.7753589    3.467373
        ev15 |  -1.137311   1.093157    -1.04   0.298    -3.280362    1.005741
        ev16 |   .0813407   1.059297     0.08   0.939    -1.995332    2.158014
        ev17 |   1.565506   1.086321     1.44   0.150    -.5641443    3.695156
        ev18 |  -1.281578   1.060424    -1.21   0.227    -3.360459    .7973032
        ev19 |   .1127988   1.099285     0.10   0.918    -2.042266    2.267864
        ev20 |  -.1078692   1.073255    -0.10   0.920    -2.211906    1.996167
        male |   .3887418   .0271802    14.30   0.000     .3354572    .4420265
       _cons |   -.176692   .0156497   -11.29   0.000     -.207372   -.1460119
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      5,940
                                                F(21, 5918)       =      19.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0623
                                                Root MSE          =     .97007

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   2.734024   4.331492     0.63   0.528    -5.757281    11.22533
         ev2 |  -7.582585   1.388826    -5.46   0.000    -10.30519   -4.859979
         ev3 |  -2.270935   1.588998    -1.43   0.153    -5.385951    .8440803
         ev4 |  -.0476083   2.103296    -0.02   0.982    -4.170837     4.07562
         ev5 |   5.329648   1.074691     4.96   0.000     3.222862    7.436434
         ev6 |   9.037832    1.04968     8.61   0.000     6.980077    11.09559
         ev7 |   -.892221   1.075417    -0.83   0.407    -3.000431    1.215989
         ev8 |   2.023586   1.131689     1.79   0.074    -.1949368    4.242109
         ev9 |   2.370358   1.160635     2.04   0.041      .095089    4.645627
        ev10 |   .8153664   1.052045     0.78   0.438    -1.247025    2.877758
        ev11 |  -.7885773   1.068533    -0.74   0.461    -2.883291    1.306136
        ev12 |   -1.53266   1.066235    -1.44   0.151     -3.62287    .5575505
        ev13 |  -.1908378   1.098125    -0.17   0.862    -2.343563    1.961887
        ev14 |   1.625206    1.06626     1.52   0.128    -.4650533    3.715465
        ev15 |  -1.408867    1.08079    -1.30   0.192     -3.52761    .7098757
        ev16 |  -.0355237   1.051994    -0.03   0.973    -2.097816    2.026768
        ev17 |   1.674113   1.076815     1.55   0.120    -.4368375    3.785063
        ev18 |  -1.591474   1.051787    -1.51   0.130     -3.65336    .4704123
        ev19 |  -.1164015   1.082815    -0.11   0.914    -2.239115    2.006311
        ev20 |  -.0326982   1.064728    -0.03   0.976    -2.119953    2.054557
        male |   .3758996   .0257262    14.61   0.000     .3254669    .4263324
       _cons |  -.1755405   .0149405   -11.75   0.000    -.2048294   -.1462516
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,171
                                                F(22, 5148)       =      21.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0832
                                                Root MSE          =     .95378

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .1332749   .0135842     9.81   0.000     .1066442    .1599056
         ev1 |   3.680709   4.540855     0.81   0.418    -5.221295    12.58271
         ev2 |  -6.337955   1.443746    -4.39   0.000    -9.168311   -3.507599
         ev3 |  -2.594107   1.650393    -1.57   0.116    -5.829578    .6413638
         ev4 |  -.0358067   2.177463    -0.02   0.987    -4.304559    4.232946
         ev5 |    4.63871   1.097573     4.23   0.000     2.487002    6.790419
         ev6 |   8.231348   1.067571     7.71   0.000     6.138455    10.32424
         ev7 |  -1.548782   1.093284    -1.42   0.157    -3.692083    .5945201
         ev8 |   2.134906   1.153889     1.85   0.064     -.127208    4.397019
         ev9 |   2.059831   1.168955     1.76   0.078    -.2318186     4.35148
        ev10 |   .4932323   1.058466     0.47   0.641    -1.581811    2.568275
        ev11 |  -.8490922   1.079749    -0.79   0.432    -2.965859    1.267675
        ev12 |  -1.414989   1.074248    -1.32   0.188    -3.520972    .6909936
        ev13 |  -.4540698   1.107684    -0.41   0.682    -2.625601    1.717462
        ev14 |   1.374946   1.073768     1.28   0.200    -.7300963    3.479988
        ev15 |  -1.239504   1.085697    -1.14   0.254    -3.367932     .888924
        ev16 |  -.0149446   1.058334    -0.01   0.989    -2.089729     2.05984
        ev17 |   1.715826    1.08099     1.59   0.113    -.4033737    3.835025
        ev18 |  -1.831261   1.058417    -1.73   0.084    -3.906208    .2436858
        ev19 |  -.2631075   1.084553    -0.24   0.808    -2.389292    1.863077
        ev20 |   .0012236   1.072232     0.00   0.999    -2.100806    2.103253
        male |    .388456   .0270633    14.35   0.000     .3354005    .4415116
       _cons |  -.1769839   .0157656   -11.23   0.000    -.2078911   -.1460767
------------------------------------------------------------------------------
Univariate Analysis for iq
(2772 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,023
                                                F(21, 5001)       =       4.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0164
                                                Root MSE          =     .99385

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -10.44952   4.516827    -2.31   0.021    -19.30448   -1.594558
         ev2 |  -5.860462   1.500833    -3.90   0.000    -8.802753    -2.91817
         ev3 |  -1.756879   1.713127    -1.03   0.305     -5.11536    1.601601
         ev4 |  -.8570135   2.381693    -0.36   0.719    -5.526177     3.81215
         ev5 |   .9375443   1.172944     0.80   0.424    -1.361941    3.237029
         ev6 |   7.829442   1.102345     7.10   0.000     5.668362    9.990522
         ev7 |   .2364561   1.189166     0.20   0.842     -2.09483    2.567742
         ev8 |   3.195891   1.199716     2.66   0.008     .8439206    5.547861
         ev9 |   2.004372   1.283842     1.56   0.119    -.5125224    4.521266
        ev10 |  -.8352261   1.146722    -0.73   0.466    -3.083304    1.412852
        ev11 |  -.1146528   1.123891    -0.10   0.919    -2.317971    2.088666
        ev12 |  -.0536626   1.169357    -0.05   0.963    -2.346116     2.23879
        ev13 |   -2.48626   1.162789    -2.14   0.033    -4.765836   -.2066832
        ev14 |   .7392923   1.151376     0.64   0.521    -1.517909    2.996493
        ev15 |  -1.935681   1.177293    -1.64   0.100    -4.243692    .3723291
        ev16 |   1.211963   1.150382     1.05   0.292     -1.04329    3.467215
        ev17 |  -1.920267   1.133948    -1.69   0.090    -4.143302    .3027677
        ev18 |   .5340412   1.146596     0.47   0.641     -1.71379    2.781872
        ev19 |  -.9423032   1.133309    -0.83   0.406    -3.164085    1.279479
        ev20 |  -.5068585    1.13102    -0.45   0.654    -2.724153    1.710436
        male |  -.0194552    .028275    -0.69   0.491    -.0748866    .0359762
       _cons |   .0022218   .0187176     0.12   0.906    -.0344729    .0389166
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,882
                                                F(22, 4859)       =       4.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0168
                                                Root MSE          =     .99239

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0108256   .0145011     0.75   0.455    -.0176032    .0392544
         ev1 |  -10.18308   4.523279    -2.25   0.024    -19.05075   -1.315409
         ev2 |  -5.941037    1.50566    -3.95   0.000    -8.892813   -2.989262
         ev3 |  -1.511806   1.720948    -0.88   0.380    -4.885643    1.862031
         ev4 |  -.9672834   2.386325    -0.41   0.685    -5.645559    3.710993
         ev5 |   .7829243   1.181994     0.66   0.508    -1.534319    3.100168
         ev6 |   7.647706    1.10812     6.90   0.000      5.47529    9.820123
         ev7 |   .1895146   1.193398     0.16   0.874    -2.150086    2.529115
         ev8 |   3.392371   1.202352     2.82   0.005     1.035218    5.749524
         ev9 |   1.892996   1.285866     1.47   0.141    -.6278819    4.413875
        ev10 |  -.8731823   1.149659    -0.76   0.448    -3.127034    1.380669
        ev11 |  -.0473938   1.125405    -0.04   0.966    -2.253697     2.15891
        ev12 |  -.1290115   1.172174    -0.11   0.912    -2.427002    2.168979
        ev13 |  -2.483103    1.16471    -2.13   0.033    -4.766461   -.1997457
        ev14 |   .7262839   1.153292     0.63   0.529     -1.53469    2.987258
        ev15 |  -1.823195   1.179824    -1.55   0.122    -4.136184    .4897935
        ev16 |   1.135776    1.15222     0.99   0.324    -1.123095    3.394648
        ev17 |  -1.822549   1.135675    -1.60   0.109    -4.048985    .4038876
        ev18 |    .506629   1.148505     0.44   0.659    -1.744961    2.758219
        ev19 |  -.9097378   1.136782    -0.80   0.424    -3.138344    1.318869
        ev20 |  -.4866583   1.133151    -0.43   0.668    -2.708146    1.734829
        male |  -.0185615   .0286366    -0.65   0.517    -.0747022    .0375792
       _cons |   .0067351   .0189644     0.36   0.722    -.0304437    .0439139
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      5,023
                                                F(21, 5001)       =       4.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0164
                                                Root MSE          =     .99385

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -10.44952   4.516827    -2.31   0.021    -19.30448   -1.594558
         ev2 |  -5.860462   1.500833    -3.90   0.000    -8.802753    -2.91817
         ev3 |  -1.756879   1.713127    -1.03   0.305     -5.11536    1.601601
         ev4 |  -.8570135   2.381693    -0.36   0.719    -5.526177     3.81215
         ev5 |   .9375443   1.172944     0.80   0.424    -1.361941    3.237029
         ev6 |   7.829442   1.102345     7.10   0.000     5.668362    9.990522
         ev7 |   .2364561   1.189166     0.20   0.842     -2.09483    2.567742
         ev8 |   3.195891   1.199716     2.66   0.008     .8439206    5.547861
         ev9 |   2.004372   1.283842     1.56   0.119    -.5125224    4.521266
        ev10 |  -.8352261   1.146722    -0.73   0.466    -3.083304    1.412852
        ev11 |  -.1146528   1.123891    -0.10   0.919    -2.317971    2.088666
        ev12 |  -.0536626   1.169357    -0.05   0.963    -2.346116     2.23879
        ev13 |   -2.48626   1.162789    -2.14   0.033    -4.765836   -.2066832
        ev14 |   .7392923   1.151376     0.64   0.521    -1.517909    2.996493
        ev15 |  -1.935681   1.177293    -1.64   0.100    -4.243692    .3723291
        ev16 |   1.211963   1.150382     1.05   0.292     -1.04329    3.467215
        ev17 |  -1.920267   1.133948    -1.69   0.090    -4.143302    .3027677
        ev18 |   .5340412   1.146596     0.47   0.641     -1.71379    2.781872
        ev19 |  -.9423032   1.133309    -0.83   0.406    -3.164085    1.279479
        ev20 |  -.5068585    1.13102    -0.45   0.654    -2.724153    1.710436
        male |  -.0194552    .028275    -0.69   0.491    -.0748866    .0359762
       _cons |   .0022218   .0187176     0.12   0.906    -.0344729    .0389166
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,882
                                                F(22, 4859)       =      24.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0909
                                                Root MSE          =     .95426

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .2735272   .0135975    20.12   0.000     .2468698    .3001845
         ev1 |    -7.7281   4.232313    -1.83   0.068    -16.02535    .5691484
         ev2 |   -3.99084   1.439782    -2.77   0.006    -6.813464   -1.168216
         ev3 |  -1.283008   1.619298    -0.79   0.428    -4.457564    1.891548
         ev4 |  -.7956498   2.164645    -0.37   0.713    -5.039333    3.448033
         ev5 |  -.0796402   1.122498    -0.07   0.943    -2.280244    2.120963
         ev6 |   6.447908   1.060771     6.08   0.000     4.368317    8.527499
         ev7 |  -.5135237    1.12838    -0.46   0.649    -2.725659    1.698611
         ev8 |   3.111337   1.151943     2.70   0.007     .8530072    5.369667
         ev9 |   1.396216   1.226408     1.14   0.255    -1.008098     3.80053
        ev10 |  -1.350385   1.106538    -1.22   0.222      -3.5197    .8189308
        ev11 |  -.6081877   1.080797    -0.56   0.574    -2.727038    1.510663
        ev12 |   .0532936   1.123107     0.05   0.962    -2.148505    2.255092
        ev13 |  -2.967043   1.119871    -2.65   0.008    -5.162498   -.7715885
        ev14 |   .9987748   1.105152     0.90   0.366    -1.167823    3.165372
        ev15 |  -1.522655   1.136468    -1.34   0.180    -3.750645    .7053359
        ev16 |    1.33852   1.105582     1.21   0.226    -.8289206    3.505961
        ev17 |  -1.693672   1.095308    -1.55   0.122    -3.840972    .4536275
        ev18 |  -.3183017   1.106117    -0.29   0.774    -2.486791    1.850188
        ev19 |  -1.325209   1.094535    -1.21   0.226    -3.470992    .8205743
        ev20 |  -.5949366   1.106593    -0.54   0.591     -2.76436    1.574487
        male |  -.0135471   .0274983    -0.49   0.622    -.0674563     .040362
       _cons |   .0051991   .0183796     0.28   0.777    -.0308332    .0412314
------------------------------------------------------------------------------
Univariate Analysis for extra
(772 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      7,023
                                                F(21, 7001)       =       6.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0175
                                                Root MSE          =     .99272

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   7.247932    4.32643     1.68   0.094    -1.233181    15.72905
         ev2 |   1.324642   1.399182     0.95   0.344    -1.418178    4.067462
         ev3 |  -2.780997   1.596096    -1.74   0.081    -5.909829    .3478358
         ev4 |   1.205221   2.109032     0.57   0.568    -2.929122    5.339563
         ev5 |   -.898288   1.046603    -0.86   0.391    -2.949947    1.153371
         ev6 |   1.216856   1.032646     1.18   0.239    -.8074434    3.241156
         ev7 |  -2.833564   1.047204    -2.71   0.007    -4.886401   -.7807267
         ev8 |   .1634668    1.11114     0.15   0.883    -2.014703    2.341637
         ev9 |  -.9573436   1.144425    -0.84   0.403    -3.200763    1.286075
        ev10 |   3.003534   1.071626     2.80   0.005     .9028216    5.104246
        ev11 |  -.4587924   1.053852    -0.44   0.663    -2.524661    1.607076
        ev12 |   -1.86368    1.07589    -1.73   0.083     -3.97275    .2453909
        ev13 |  -.2338771   1.067709    -0.22   0.827    -2.326911    1.859157
        ev14 |   1.062526   1.077176     0.99   0.324    -1.049065    3.174118
        ev15 |   .9310698   1.059422     0.88   0.380    -1.145718    3.007858
        ev16 |  -1.186625   1.062117    -1.12   0.264    -3.268696     .895445
        ev17 |   1.096924   1.072335     1.02   0.306    -1.005178    3.199025
        ev18 |     .66026   1.071287     0.62   0.538    -1.439788    2.760308
        ev19 |   .5822578   1.058292     0.55   0.582    -1.492316    2.656831
        ev20 |  -.5922003   1.064737    -0.56   0.578    -2.679408    1.495007
        male |  -.2057021   .0238107    -8.64   0.000    -.2523784   -.1590258
       _cons |   .1016436   .0162158     6.27   0.000     .0698557    .1334315
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,295
                                                F(22, 5272)       =       4.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0186
                                                Root MSE          =     .99492

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |  -.0071387   .0136779    -0.52   0.602     -.033953    .0196757
         ev1 |   6.480286   4.556517     1.42   0.155    -2.452374    15.41295
         ev2 |   .8202141   1.506932     0.54   0.586    -2.133997    3.774425
         ev3 |  -2.074491   1.688169    -1.23   0.219    -5.384001    1.235019
         ev4 |   1.396932   2.260755     0.62   0.537    -3.035084    5.828948
         ev5 |  -1.114326   1.131776    -0.98   0.325    -3.333075    1.104423
         ev6 |   .7735751   1.101666     0.70   0.483    -1.386147    2.933297
         ev7 |  -2.971144   1.091857    -2.72   0.007    -5.111637   -.8306518
         ev8 |  -.0680995     1.1498    -0.06   0.953    -2.322184    2.185985
         ev9 |  -.8213066   1.190578    -0.69   0.490    -3.155333    1.512719
        ev10 |   2.797568   1.118137     2.50   0.012     .6055566    4.989579
        ev11 |  -.3286538   1.102967    -0.30   0.766    -2.490926    1.833618
        ev12 |   -1.59425   1.122933    -1.42   0.156    -3.795664    .6071633
        ev13 |   .3587775   1.111122     0.32   0.747    -1.819481    2.537036
        ev14 |   .6419146   1.129302     0.57   0.570    -1.571985    2.855814
        ev15 |   1.112696   1.107936     1.00   0.315    -1.059317    3.284708
        ev16 |  -1.317361    1.10643    -1.19   0.234    -3.486422    .8517003
        ev17 |   1.261039   1.119026     1.13   0.260    -.9327144    3.454793
        ev18 |   .5494755   1.122708     0.49   0.625    -1.651497    2.750447
        ev19 |   .9499175    1.10183     0.86   0.389    -1.210126    3.109961
        ev20 |  -.9472891   1.107033    -0.86   0.392    -3.117532    1.222954
        male |  -.2175483   .0274469    -7.93   0.000    -.2713555    -.163741
       _cons |   .1248218   .0187716     6.65   0.000     .0880218    .1616219
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      7,023
                                                F(21, 7001)       =       6.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0175
                                                Root MSE          =     .99272

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   7.247932    4.32643     1.68   0.094    -1.233181    15.72905
         ev2 |   1.324642   1.399182     0.95   0.344    -1.418178    4.067462
         ev3 |  -2.780997   1.596096    -1.74   0.081    -5.909829    .3478358
         ev4 |   1.205221   2.109032     0.57   0.568    -2.929122    5.339563
         ev5 |   -.898288   1.046603    -0.86   0.391    -2.949947    1.153371
         ev6 |   1.216856   1.032646     1.18   0.239    -.8074434    3.241156
         ev7 |  -2.833564   1.047204    -2.71   0.007    -4.886401   -.7807267
         ev8 |   .1634668    1.11114     0.15   0.883    -2.014703    2.341637
         ev9 |  -.9573436   1.144425    -0.84   0.403    -3.200763    1.286075
        ev10 |   3.003534   1.071626     2.80   0.005     .9028216    5.104246
        ev11 |  -.4587924   1.053852    -0.44   0.663    -2.524661    1.607076
        ev12 |   -1.86368    1.07589    -1.73   0.083     -3.97275    .2453909
        ev13 |  -.2338771   1.067709    -0.22   0.827    -2.326911    1.859157
        ev14 |   1.062526   1.077176     0.99   0.324    -1.049065    3.174118
        ev15 |   .9310698   1.059422     0.88   0.380    -1.145718    3.007858
        ev16 |  -1.186625   1.062117    -1.12   0.264    -3.268696     .895445
        ev17 |   1.096924   1.072335     1.02   0.306    -1.005178    3.199025
        ev18 |     .66026   1.071287     0.62   0.538    -1.439788    2.760308
        ev19 |   .5822578   1.058292     0.55   0.582    -1.492316    2.656831
        ev20 |  -.5922003   1.064737    -0.56   0.578    -2.679408    1.495007
        male |  -.2057021   .0238107    -8.64   0.000    -.2523784   -.1590258
       _cons |   .1016436   .0162158     6.27   0.000     .0698557    .1334315
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,295
                                                F(22, 5272)       =       4.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0187
                                                Root MSE          =     .99484

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |  -.0146737   .0137256    -1.07   0.285    -.0415817    .0122342
         ev1 |   6.389921   4.580639     1.39   0.163    -2.590028    15.36987
         ev2 |   .7568066   1.515113     0.50   0.617    -2.213442    3.727055
         ev3 |   -2.04447   1.694253    -1.21   0.228    -5.365908    1.276967
         ev4 |    1.42764   2.261291     0.63   0.528    -3.005426    5.860707
         ev5 |  -1.096003   1.129607    -0.97   0.332    -3.310501    1.118495
         ev6 |   .8180112   1.105669     0.74   0.459    -1.349558    2.985581
         ev7 |  -2.908852   1.092111    -2.66   0.008    -5.049843   -.7678611
         ev8 |  -.0422703   1.150345    -0.04   0.971    -2.297423    2.212882
         ev9 |  -.8029074   1.189833    -0.67   0.500    -3.135472    1.529657
        ev10 |   2.833319    1.11851     2.53   0.011     .6405772    5.026061
        ev11 |  -.2985888   1.103162    -0.27   0.787    -2.461244    1.864066
        ev12 |   -1.58677   1.121965    -1.41   0.157    -3.786285    .6127459
        ev13 |   .3849827   1.111685     0.35   0.729    -1.794379    2.564345
        ev14 |   .6359046   1.129645     0.56   0.574    -1.578668    2.850477
        ev15 |   1.127605   1.107906     1.02   0.309     -1.04435     3.29956
        ev16 |  -1.316702   1.106349    -1.19   0.234    -3.485604     .852199
        ev17 |    1.24767   1.118595     1.12   0.265    -.9452389    3.440578
        ev18 |   .5935837   1.122397     0.53   0.597     -1.60678    2.793947
        ev19 |   .9763769   1.102467     0.89   0.376    -1.184914    3.137668
        ev20 |  -.9570886   1.107328    -0.86   0.387     -3.12791    1.213733
        male |  -.2176899   .0274434    -7.93   0.000    -.2714903   -.1638895
       _cons |   .1248286   .0187758     6.65   0.000     .0880203    .1616369
------------------------------------------------------------------------------
Univariate Analysis for openn
(690 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      7,105
                                                F(21, 7083)       =      11.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0326
                                                Root MSE          =       .985

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   10.39647   4.296467     2.42   0.016     1.974107    18.81883
         ev2 |   2.848911   1.392756     2.05   0.041     .1186935    5.579128
         ev3 |   3.234298   1.613112     2.01   0.045     .0721158     6.39648
         ev4 |   5.015383   2.461684     2.04   0.042     .1897457     9.84102
         ev5 |   1.310636   1.040754     1.26   0.208    -.7295528    3.350825
         ev6 |   3.012864   1.027898     2.93   0.003     .9978777    5.027851
         ev7 |  -1.254636   1.052547    -1.19   0.233    -3.317942    .8086711
         ev8 |   1.763403    1.06933     1.65   0.099    -.3328037     3.85961
         ev9 |   .7435948   1.127503     0.66   0.510    -1.466649    2.953838
        ev10 |   2.473235   1.074302     2.30   0.021     .3672819    4.579189
        ev11 |   1.169333   1.039035     1.13   0.260    -.8674862    3.206151
        ev12 |  -1.254226   1.048913    -1.20   0.232    -3.310409    .8019568
        ev13 |  -.5173344   1.050193    -0.49   0.622    -2.576028    1.541359
        ev14 |  -.1636539   1.056593    -0.15   0.877    -2.234893    1.907585
        ev15 |  -.3614823   1.044618    -0.35   0.729    -2.409245    1.686281
        ev16 |  -1.039671   1.079989    -0.96   0.336    -3.156772     1.07743
        ev17 |   2.087861   1.045725     2.00   0.046     .0379279    4.137795
        ev18 |  -.4589733   1.029811    -0.45   0.656     -2.47771    1.559764
        ev19 |  -.8658604   1.048001    -0.83   0.409    -2.920255    1.188535
        ev20 |  -.0509517   1.033542    -0.05   0.961    -2.077003    1.975099
        male |   .3331197   .0232492    14.33   0.000     .2875444     .378695
       _cons |  -.1498574   .0172584    -8.68   0.000     -.183689   -.1160257
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,349
                                                F(22, 5326)       =       8.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0338
                                                Root MSE          =     .98944

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0363915   .0133344     2.73   0.006     .0102507    .0625323
         ev1 |   7.501039   4.538609     1.65   0.098    -1.396494    16.39857
         ev2 |   2.398534   1.507996     1.59   0.112    -.5577552    5.354823
         ev3 |   3.098496   1.725819     1.80   0.073    -.2848159    6.481807
         ev4 |   5.082886   2.693723     1.89   0.059    -.1979139    10.36369
         ev5 |   1.667746   1.132728     1.47   0.141    -.5528642    3.888357
         ev6 |   2.751769    1.11895     2.46   0.014     .5581687    4.945369
         ev7 |  -1.341062   1.096223    -1.22   0.221    -3.490109    .8079852
         ev8 |   1.764226   1.104475     1.60   0.110    -.4009968    3.929449
         ev9 |   .6954027   1.180002     0.59   0.556    -1.617885     3.00869
        ev10 |   2.725654   1.121458     2.43   0.015     .5271371     4.92417
        ev11 |   1.318929   1.089842     1.21   0.226    -.8176074    3.455466
        ev12 |   -.851533   1.098307    -0.78   0.438    -3.004664    1.301598
        ev13 |  -.6522237   1.095748    -0.60   0.552    -2.800338    1.495891
        ev14 |  -.1061225   1.104849    -0.10   0.923    -2.272079    2.059834
        ev15 |  -.0495276   1.090025    -0.05   0.964    -2.186424    2.087368
        ev16 |   -.989843   1.128614    -0.88   0.381    -3.202389    1.222703
        ev17 |   1.825689   1.094352     1.67   0.095    -.3196896    3.971068
        ev18 |  -.2906668   1.075793    -0.27   0.787    -2.399661    1.818327
        ev19 |  -.8921266   1.092698    -0.82   0.414    -3.034261    1.250008
        ev20 |   .3918073   1.076274     0.36   0.716    -1.718131    2.501745
        male |   .3291749   .0269661    12.21   0.000     .2763104    .3820394
       _cons |  -.1534631   .0199823    -7.68   0.000    -.1926366   -.1142895
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      7,105
                                                F(21, 7083)       =      11.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0326
                                                Root MSE          =       .985

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   10.39647   4.296467     2.42   0.016     1.974107    18.81883
         ev2 |   2.848911   1.392756     2.05   0.041     .1186935    5.579128
         ev3 |   3.234298   1.613112     2.01   0.045     .0721158     6.39648
         ev4 |   5.015383   2.461684     2.04   0.042     .1897457     9.84102
         ev5 |   1.310636   1.040754     1.26   0.208    -.7295528    3.350825
         ev6 |   3.012864   1.027898     2.93   0.003     .9978777    5.027851
         ev7 |  -1.254636   1.052547    -1.19   0.233    -3.317942    .8086711
         ev8 |   1.763403    1.06933     1.65   0.099    -.3328037     3.85961
         ev9 |   .7435948   1.127503     0.66   0.510    -1.466649    2.953838
        ev10 |   2.473235   1.074302     2.30   0.021     .3672819    4.579189
        ev11 |   1.169333   1.039035     1.13   0.260    -.8674862    3.206151
        ev12 |  -1.254226   1.048913    -1.20   0.232    -3.310409    .8019568
        ev13 |  -.5173344   1.050193    -0.49   0.622    -2.576028    1.541359
        ev14 |  -.1636539   1.056593    -0.15   0.877    -2.234893    1.907585
        ev15 |  -.3614823   1.044618    -0.35   0.729    -2.409245    1.686281
        ev16 |  -1.039671   1.079989    -0.96   0.336    -3.156772     1.07743
        ev17 |   2.087861   1.045725     2.00   0.046     .0379279    4.137795
        ev18 |  -.4589733   1.029811    -0.45   0.656     -2.47771    1.559764
        ev19 |  -.8658604   1.048001    -0.83   0.409    -2.920255    1.188535
        ev20 |  -.0509517   1.033542    -0.05   0.961    -2.077003    1.975099
        male |   .3331197   .0232492    14.33   0.000     .2875444     .378695
       _cons |  -.1498574   .0172584    -8.68   0.000     -.183689   -.1160257
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,349
                                                F(22, 5326)       =       9.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0359
                                                Root MSE          =     .98835

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0587607   .0132312     4.44   0.000     .0328223    .0846992
         ev1 |   7.811612   4.529707     1.72   0.085    -1.068469    16.69169
         ev2 |   2.560412   1.506649     1.70   0.089     -.393238    5.514061
         ev3 |   2.942361   1.720522     1.71   0.087     -.430566    6.315289
         ev4 |   4.917512   2.693802     1.83   0.068    -.3634443    10.19847
         ev5 |    1.63213   1.124631     1.45   0.147    -.5726079    3.836868
         ev6 |   2.605788   1.113948     2.34   0.019     .4219933    4.789583
         ev7 |  -1.613047    1.09362    -1.47   0.140     -3.75699    .5308953
         ev8 |    1.65238   1.103649     1.50   0.134    -.5112247    3.815984
         ev9 |   .6103031    1.17694     0.52   0.604    -1.696982    2.917588
        ev10 |   2.553246   1.120955     2.28   0.023     .3557157    4.750777
        ev11 |   1.202198   1.088191     1.10   0.269    -.9311015    3.335498
        ev12 |  -.9241911   1.097582    -0.84   0.400    -3.075902     1.22752
        ev13 |  -.7488779   1.093683    -0.68   0.494    -2.892945    1.395189
        ev14 |  -.1052989   1.102338    -0.10   0.924    -2.266333    2.055735
        ev15 |  -.1123867   1.088604    -0.10   0.918    -2.246497    2.021724
        ev16 |  -.9996015   1.129196    -0.89   0.376    -3.213288    1.214085
        ev17 |    1.88438   1.092929     1.72   0.085     -.258208    4.026969
        ev18 |  -.4771866   1.075998    -0.44   0.657    -2.586583     1.63221
        ev19 |  -1.017254   1.089533    -0.93   0.351    -3.153184    1.118676
        ev20 |    .411353   1.075079     0.38   0.702    -1.696243    2.518949
        male |   .3296822   .0269316    12.24   0.000     .2768851    .3824792
       _cons |   -.153786   .0199938    -7.69   0.000     -.192982   -.1145901
------------------------------------------------------------------------------
Univariate Analysis for neuro
(751 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      7,044
                                                F(21, 7022)       =       6.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0189
                                                Root MSE          =     .99198

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   6.914104    5.38203     1.28   0.199    -3.636299    17.46451
         ev2 |   1.661187   1.631875     1.02   0.309    -1.537781    4.860156
         ev3 |  -1.221236   1.884523    -0.65   0.517    -4.915469    2.472998
         ev4 |   1.752572   2.467639     0.71   0.478    -3.084746    6.589891
         ev5 |  -.7670925   1.069412    -0.72   0.473    -2.863463    1.329278
         ev6 |   1.555392   1.056895     1.47   0.141     -.516442    3.627226
         ev7 |   .4702943   1.084998     0.43   0.665    -1.656629    2.597217
         ev8 |  -1.152996   1.107005    -1.04   0.298     -3.32306    1.017067
         ev9 |   .2956415   1.119698     0.26   0.792    -1.899305    2.490588
        ev10 |  -.1569594   1.065635    -0.15   0.883    -2.245925    1.932007
        ev11 |  -1.515873   1.053219    -1.44   0.150      -3.5805    .5487532
        ev12 |   2.333023   1.051824     2.22   0.027     .2711302    4.394916
        ev13 |  -.5939851   1.060999    -0.56   0.576    -2.673863    1.485893
        ev14 |  -1.464551   1.078891    -1.36   0.175    -3.579502    .6504005
        ev15 |   1.012732   1.062342     0.95   0.340    -1.069779    3.095244
        ev16 |   -.245831    1.07228    -0.23   0.819    -2.347823    1.856161
        ev17 |  -.9153607   1.044872    -0.88   0.381    -2.963626    1.132904
        ev18 |   .9757456   1.053911     0.93   0.355    -1.090238    3.041729
        ev19 |  -.8753015   1.060795    -0.83   0.409     -2.95478    1.204177
        ev20 |   -.699068   1.055183    -0.66   0.508    -2.767546     1.36941
        male |  -.2453271    .023647   -10.37   0.000    -.2916824   -.1989718
       _cons |   .1197447   .0169273     7.07   0.000      .086562    .1529273
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,308
                                                F(22, 5285)       =       5.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0208
                                                Root MSE          =     .99422

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   -.037709   .0137189    -2.75   0.006    -.0646037   -.0108142
         ev1 |    7.08226   6.118589     1.16   0.247    -4.912701    19.07722
         ev2 |   1.969891   1.835768     1.07   0.283    -1.628972    5.568754
         ev3 |  -.6470635   2.096786    -0.31   0.758     -4.75763    3.463503
         ev4 |   .6614731   2.722076     0.24   0.808     -4.67492    5.997866
         ev5 |   -1.14574   1.147652    -1.00   0.318    -3.395612    1.104131
         ev6 |   1.249164   1.119829     1.12   0.265    -.9461637    3.444491
         ev7 |   .0069827   1.142574     0.01   0.995    -2.232934      2.2469
         ev8 |  -.8314703   1.160383    -0.72   0.474      -3.1063    1.443359
         ev9 |   .1597586   1.172937     0.14   0.892    -2.139682    2.459199
        ev10 |  -.8452019   1.113045    -0.76   0.448    -3.027229    1.336825
        ev11 |  -1.590973   1.097389    -1.45   0.147    -3.742309    .5603634
        ev12 |   2.207033   1.101519     2.00   0.045     .0476012    4.366465
        ev13 |  -.2741173   1.109947    -0.25   0.805    -2.450072    1.901837
        ev14 |  -1.543424   1.128651    -1.37   0.172    -3.756046    .6691984
        ev15 |   .4067765   1.109757     0.37   0.714    -1.768805    2.582358
        ev16 |  -.6031988   1.115838    -0.54   0.589    -2.790703    1.584305
        ev17 |  -1.189683   1.092313    -1.09   0.276    -3.331068     .951701
        ev18 |     1.1244   1.098111     1.02   0.306    -1.028351     3.27715
        ev19 |  -.3446037   1.103238    -0.31   0.755    -2.507406    1.818199
        ev20 |   -.113532   1.101046    -0.10   0.918    -2.272038    2.044974
        male |  -.2489893    .027301    -9.12   0.000    -.3025105   -.1954681
       _cons |   .1148106   .0196757     5.84   0.000     .0762381     .153383
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      7,044
                                                F(21, 7022)       =       6.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0189
                                                Root MSE          =     .99198

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   6.914104    5.38203     1.28   0.199    -3.636299    17.46451
         ev2 |   1.661187   1.631875     1.02   0.309    -1.537781    4.860156
         ev3 |  -1.221236   1.884523    -0.65   0.517    -4.915469    2.472998
         ev4 |   1.752572   2.467639     0.71   0.478    -3.084746    6.589891
         ev5 |  -.7670925   1.069412    -0.72   0.473    -2.863463    1.329278
         ev6 |   1.555392   1.056895     1.47   0.141     -.516442    3.627226
         ev7 |   .4702943   1.084998     0.43   0.665    -1.656629    2.597217
         ev8 |  -1.152996   1.107005    -1.04   0.298     -3.32306    1.017067
         ev9 |   .2956415   1.119698     0.26   0.792    -1.899305    2.490588
        ev10 |  -.1569594   1.065635    -0.15   0.883    -2.245925    1.932007
        ev11 |  -1.515873   1.053219    -1.44   0.150      -3.5805    .5487532
        ev12 |   2.333023   1.051824     2.22   0.027     .2711302    4.394916
        ev13 |  -.5939851   1.060999    -0.56   0.576    -2.673863    1.485893
        ev14 |  -1.464551   1.078891    -1.36   0.175    -3.579502    .6504005
        ev15 |   1.012732   1.062342     0.95   0.340    -1.069779    3.095244
        ev16 |   -.245831    1.07228    -0.23   0.819    -2.347823    1.856161
        ev17 |  -.9153607   1.044872    -0.88   0.381    -2.963626    1.132904
        ev18 |   .9757456   1.053911     0.93   0.355    -1.090238    3.041729
        ev19 |  -.8753015   1.060795    -0.83   0.409     -2.95478    1.204177
        ev20 |   -.699068   1.055183    -0.66   0.508    -2.767546     1.36941
        male |  -.2453271    .023647   -10.37   0.000    -.2916824   -.1989718
       _cons |   .1197447   .0169273     7.07   0.000      .086562    .1529273
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,308
                                                F(22, 5285)       =       4.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0196
                                                Root MSE          =     .99487

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |  -.0109718   .0136661    -0.80   0.422     -.037763    .0158195
         ev1 |   7.187653   6.000967     1.20   0.231     -4.57672    18.95203
         ev2 |   2.121875   1.816277     1.17   0.243    -1.438778    5.682528
         ev3 |  -.4773591   2.068614    -0.23   0.818    -4.532697    3.577979
         ev4 |   .8573498   2.690105     0.32   0.750    -4.416367    6.131066
         ev5 |  -1.267383   1.145647    -1.11   0.269    -3.513323    .9785582
         ev6 |   1.160121   1.123001     1.03   0.302    -1.041425    3.361666
         ev7 |   .1494451   1.144433     0.13   0.896    -2.094116    2.393006
         ev8 |  -.8015083   1.160919    -0.69   0.490    -3.077388    1.474372
         ev9 |    .159327    1.17238     0.14   0.892    -2.139023    2.457677
        ev10 |   -.754873   1.112881    -0.68   0.498    -2.936579    1.426833
        ev11 |  -1.563373   1.098485    -1.42   0.155    -3.716857    .5901112
        ev12 |   2.297838   1.102416     2.08   0.037      .136647    4.459029
        ev13 |  -.2249541    1.11049    -0.20   0.839    -2.401973    1.952065
        ev14 |  -1.511386   1.128322    -1.34   0.180    -3.723363    .7005897
        ev15 |   .4499984   1.109263     0.41   0.685    -1.724615    2.624612
        ev16 |   -.553811   1.117922    -0.50   0.620    -2.745401    1.637779
        ev17 |  -1.225841   1.092042    -1.12   0.262    -3.366693    .9150123
        ev18 |   1.192579   1.098277     1.09   0.278    -.9604978    3.345656
        ev19 |  -.2428997   1.103917    -0.22   0.826    -2.407032    1.921233
        ev20 |   -.158537   1.101661    -0.14   0.886    -2.318247    2.001173
        male |  -.2488458   .0273193    -9.11   0.000    -.3024029   -.1952887
       _cons |   .1147667   .0196826     5.83   0.000     .0761806    .1533527
------------------------------------------------------------------------------
Univariate Analysis for consc
(662 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      7,133
                                                F(21, 7111)       =       0.95
                                                Prob > F          =     0.5291
                                                R-squared         =     0.0028
                                                Root MSE          =     1.0001

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -1.824146   4.395167    -0.42   0.678    -10.43998    6.791689
         ev2 |   .8886416   1.420355     0.63   0.532    -1.895676    3.672959
         ev3 |   .4133043   1.638757     0.25   0.801    -2.799148    3.625757
         ev4 |  -1.223991   2.130649    -0.57   0.566    -5.400698    2.952716
         ev5 |   1.356764   1.052123     1.29   0.197    -.7057096    3.419239
         ev6 |  -.5792969   1.057822    -0.55   0.584    -2.652943    1.494349
         ev7 |   .0535902   1.042684     0.05   0.959    -1.990381    2.097562
         ev8 |  -.3556863   1.078914    -0.33   0.742    -2.470679    1.759307
         ev9 |   1.084776   1.129811     0.96   0.337     -1.12999    3.299543
        ev10 |   .6202025   1.074591     0.58   0.564    -1.486316    2.726721
        ev11 |   .7358159   1.050557     0.70   0.484    -1.323589    2.795221
        ev12 |  -1.620268   1.062692    -1.52   0.127    -3.703461     .462926
        ev13 |  -.1560519   1.057112    -0.15   0.883    -2.228307    1.916203
        ev14 |  -1.511576   1.057701    -1.43   0.153    -3.584984    .5618322
        ev15 |  -.0619746   1.048173    -0.06   0.953    -2.116705    1.992756
        ev16 |  -2.315564   1.048537    -2.21   0.027    -4.371008   -.2601193
        ev17 |   .4298499   1.036231     0.41   0.678    -1.601471     2.46117
        ev18 |  -.6264592   1.056968    -0.59   0.553     -2.69843    1.445512
        ev19 |  -.7738077   1.066887    -0.73   0.468    -2.865224    1.317608
        ev20 |   .0256803   1.058363     0.02   0.981    -2.049026    2.100387
        male |  -.0434692    .023828    -1.82   0.068    -.0901791    .0032407
       _cons |     .01966   .0163161     1.20   0.228    -.0123244    .0516444
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,364
                                                F(22, 5341)       =       1.18
                                                Prob > F          =     0.2552
                                                R-squared         =     0.0049
                                                Root MSE          =     .99323

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |  -.0293749   .0134109    -2.19   0.029    -.0556659    -.003084
         ev1 |  -.0621594   4.632202    -0.01   0.989    -9.143167    9.018848
         ev2 |   .5444226   1.537044     0.35   0.723    -2.468811    3.557656
         ev3 |   .1755114   1.728025     0.10   0.919    -3.212123    3.563146
         ev4 |  -.0356555   2.288597    -0.02   0.988     -4.52224    4.450929
         ev5 |   2.126278   1.121583     1.90   0.058    -.0724825    4.325038
         ev6 |  -.7454223   1.119895    -0.67   0.506    -2.940873    1.450028
         ev7 |  -.1589189   1.096107    -0.14   0.885    -2.307735    1.989898
         ev8 |   -.007063   1.131543    -0.01   0.995    -2.225348    2.211222
         ev9 |    .842685   1.178891     0.71   0.475    -1.468423    3.153793
        ev10 |   .9592377   1.123189     0.85   0.393    -1.242672    3.161147
        ev11 |   .7024806   1.092734     0.64   0.520    -1.439725    2.844686
        ev12 |  -1.836589   1.105997    -1.66   0.097    -4.004795    .3316174
        ev13 |   .0728182   1.104414     0.07   0.947    -2.092284    2.237921
        ev14 |  -1.745804   1.102081    -1.58   0.113    -3.906334    .4147251
        ev15 |  -.3254574   1.093962    -0.30   0.766    -2.470069    1.819154
        ev16 |  -2.157246   1.090798    -1.98   0.048    -4.295655    -.018837
        ev17 |   .0053402   1.072802     0.00   0.996     -2.09779     2.10847
        ev18 |  -.7664624   1.097196    -0.70   0.485    -2.917415     1.38449
        ev19 |  -1.272333   1.110895    -1.15   0.252    -3.450141    .9054758
        ev20 |  -.1271719   1.105031    -0.12   0.908    -2.293484     2.03914
        male |  -.0620582   .0272684    -2.28   0.023    -.1155153   -.0086011
       _cons |    .039022   .0186672     2.09   0.037     .0024267    .0756172
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      7,133
                                                F(21, 7111)       =       0.95
                                                Prob > F          =     0.5291
                                                R-squared         =     0.0028
                                                Root MSE          =     1.0001

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -1.824146   4.395167    -0.42   0.678    -10.43998    6.791689
         ev2 |   .8886416   1.420355     0.63   0.532    -1.895676    3.672959
         ev3 |   .4133043   1.638757     0.25   0.801    -2.799148    3.625757
         ev4 |  -1.223991   2.130649    -0.57   0.566    -5.400698    2.952716
         ev5 |   1.356764   1.052123     1.29   0.197    -.7057096    3.419239
         ev6 |  -.5792969   1.057822    -0.55   0.584    -2.652943    1.494349
         ev7 |   .0535902   1.042684     0.05   0.959    -1.990381    2.097562
         ev8 |  -.3556863   1.078914    -0.33   0.742    -2.470679    1.759307
         ev9 |   1.084776   1.129811     0.96   0.337     -1.12999    3.299543
        ev10 |   .6202025   1.074591     0.58   0.564    -1.486316    2.726721
        ev11 |   .7358159   1.050557     0.70   0.484    -1.323589    2.795221
        ev12 |  -1.620268   1.062692    -1.52   0.127    -3.703461     .462926
        ev13 |  -.1560519   1.057112    -0.15   0.883    -2.228307    1.916203
        ev14 |  -1.511576   1.057701    -1.43   0.153    -3.584984    .5618322
        ev15 |  -.0619746   1.048173    -0.06   0.953    -2.116705    1.992756
        ev16 |  -2.315564   1.048537    -2.21   0.027    -4.371008   -.2601193
        ev17 |   .4298499   1.036231     0.41   0.678    -1.601471     2.46117
        ev18 |  -.6264592   1.056968    -0.59   0.553     -2.69843    1.445512
        ev19 |  -.7738077   1.066887    -0.73   0.468    -2.865224    1.317608
        ev20 |   .0256803   1.058363     0.02   0.981    -2.049026    2.100387
        male |  -.0434692    .023828    -1.82   0.068    -.0901791    .0032407
       _cons |     .01966   .0163161     1.20   0.228    -.0123244    .0516444
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,364
                                                F(22, 5341)       =       0.97
                                                Prob > F          =     0.4984
                                                R-squared         =     0.0041
                                                Root MSE          =     .99361

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |  -.0098372   .0135474    -0.73   0.468    -.0363956    .0167211
         ev1 |   .0443849   4.678851     0.01   0.992    -9.128074    9.216844
         ev2 |    .661414   1.551231     0.43   0.670    -2.379631    3.702459
         ev3 |   .3284919   1.736638     0.19   0.850    -3.076028    3.733011
         ev4 |   .1253713   2.307891     0.05   0.957    -4.399038    4.649781
         ev5 |   2.028436   1.123375     1.81   0.071    -.1738376     4.23071
         ev6 |  -.8156271   1.119844    -0.73   0.466    -3.010979    1.379725
         ev7 |  -.0458198   1.098872    -0.04   0.967    -2.200058    2.108419
         ev8 |   .0284713    1.13283     0.03   0.980    -2.192338    2.249281
         ev9 |    .834072   1.180281     0.71   0.480     -1.47976    3.147904
        ev10 |   1.031373    1.12309     0.92   0.358    -1.170341    3.233087
        ev11 |   .7353515   1.093347     0.67   0.501    -1.408055    2.878758
        ev12 |  -1.759702   1.105509    -1.59   0.111     -3.92695    .4075469
        ev13 |   .1041704      1.104     0.09   0.925     -2.06012    2.268461
        ev14 |  -1.727254   1.103498    -1.57   0.118     -3.89056    .4360523
        ev15 |  -.2923597   1.092443    -0.27   0.789    -2.433994    1.849274
        ev16 |  -2.120018   1.090818    -1.94   0.052    -4.258467    .0184308
        ev17 |  -.0187474   1.073275    -0.02   0.986    -2.122805     2.08531
        ev18 |   -.694099   1.096767    -0.63   0.527    -2.844209    1.456011
        ev19 |  -1.198103   1.111568    -1.08   0.281     -3.37723    .9810235
        ev20 |  -.1491009   1.103752    -0.14   0.893    -2.312905    2.014703
        male |  -.0620034   .0272794    -2.27   0.023    -.1154821   -.0085247
       _cons |   .0390198   .0186789     2.09   0.037     .0024016     .075638
------------------------------------------------------------------------------
Univariate Analysis for agree
(675 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      7,120
                                                F(21, 7098)       =       8.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0232
                                                Root MSE          =     .98978

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   -5.78056   4.299148    -1.34   0.179    -14.20817    2.647051
         ev2 |  -.9796076   1.465116    -0.67   0.504    -3.851673    1.892457
         ev3 |   1.746605   1.639313     1.07   0.287    -1.466936    4.960147
         ev4 |   .8435837    2.31469     0.36   0.716    -3.693899    5.381066
         ev5 |   .9771423   1.103583     0.89   0.376    -1.186209    3.140494
         ev6 |  -1.041361   1.087982    -0.96   0.339     -3.17413    1.091408
         ev7 |   .4170926   1.074121     0.39   0.698    -1.688505     2.52269
         ev8 |   .1711365   1.114511     0.15   0.878    -2.013638    2.355911
         ev9 |  -1.569043   1.121045    -1.40   0.162    -3.766626    .6285398
        ev10 |  -1.897951   1.026886    -1.85   0.065    -3.910953     .115052
        ev11 |   .0125992   1.035542     0.01   0.990    -2.017372    2.042571
        ev12 |  -1.361006   1.059211    -1.28   0.199    -3.437375     .715364
        ev13 |   .3799344   1.035639     0.37   0.714    -1.650227    2.410096
        ev14 |  -.9173127   1.056014    -0.87   0.385    -2.987414    1.152789
        ev15 |  -2.454051   1.055929    -2.32   0.020    -4.523988   -.3841152
        ev16 |  -.4043276   1.049536    -0.39   0.700    -2.461731    1.653076
        ev17 |   .4955659   1.039748     0.48   0.634     -1.54265    2.533782
        ev18 |   .9120541   1.045345     0.87   0.383    -1.137133    2.961242
        ev19 |   .0628122     1.0507     0.06   0.952    -1.996872    2.122497
        ev20 |  -1.546327   1.042306    -1.48   0.138    -3.589557    .4969032
        male |  -.2732857   .0237273   -11.52   0.000    -.3197983   -.2267732
       _cons |   .1239562   .0152674     8.12   0.000     .0940275    .1538848
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,355
                                                F(22, 5332)       =       6.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0261
                                                Root MSE          =     .98119

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0185674   .0136874     1.36   0.175    -.0082654    .0454003
         ev1 |  -6.510773    4.45568    -1.46   0.144    -15.24573    2.224183
         ev2 |  -.9681464   1.567126    -0.62   0.537    -4.040354    2.104061
         ev3 |   1.949391     1.7236     1.13   0.258     -1.42957    5.328352
         ev4 |   1.441987   2.527114     0.57   0.568    -3.512191    6.396165
         ev5 |   1.407799   1.183007     1.19   0.234    -.9113794    3.726977
         ev6 |  -.3218446   1.159344    -0.28   0.781    -2.594632    1.950943
         ev7 |   .6259904   1.118855     0.56   0.576    -1.567422    2.819403
         ev8 |  -.0614693   1.149178    -0.05   0.957    -2.314329     2.19139
         ev9 |   -.894553   1.151171    -0.78   0.437     -3.15132    1.362214
        ev10 |  -1.345308   1.063945    -1.26   0.206    -3.431076    .7404599
        ev11 |   .2164305   1.077319     0.20   0.841    -1.895555    2.328416
        ev12 |   -1.08478   1.107089    -0.98   0.327    -3.255127    1.085567
        ev13 |   .4137445   1.078229     0.38   0.701    -1.700025    2.527514
        ev14 |  -.7080798    1.09825    -0.64   0.519    -2.861099     1.44494
        ev15 |  -2.144513   1.097755    -1.95   0.051    -4.296562    .0075349
        ev16 |  -.1525298   1.092316    -0.14   0.889    -2.293917    1.988857
        ev17 |   .7127527   1.085015     0.66   0.511     -1.41432    2.839825
        ev18 |   1.160735   1.084776     1.07   0.285    -.9658701    3.287339
        ev19 |   .0788151   1.090931     0.07   0.942    -2.059856    2.217487
        ev20 |  -1.876542   1.083571    -1.73   0.083    -4.000785    .2476997
        male |  -.2834916    .027029   -10.49   0.000    -.3364795   -.2305037
       _cons |   .1401849   .0175657     7.98   0.000     .1057489    .1746209
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      7,120
                                                F(21, 7098)       =       8.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0232
                                                Root MSE          =     .98978

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |   -5.78056   4.299148    -1.34   0.179    -14.20817    2.647051
         ev2 |  -.9796076   1.465116    -0.67   0.504    -3.851673    1.892457
         ev3 |   1.746605   1.639313     1.07   0.287    -1.466936    4.960147
         ev4 |   .8435837    2.31469     0.36   0.716    -3.693899    5.381066
         ev5 |   .9771423   1.103583     0.89   0.376    -1.186209    3.140494
         ev6 |  -1.041361   1.087982    -0.96   0.339     -3.17413    1.091408
         ev7 |   .4170926   1.074121     0.39   0.698    -1.688505     2.52269
         ev8 |   .1711365   1.114511     0.15   0.878    -2.013638    2.355911
         ev9 |  -1.569043   1.121045    -1.40   0.162    -3.766626    .6285398
        ev10 |  -1.897951   1.026886    -1.85   0.065    -3.910953     .115052
        ev11 |   .0125992   1.035542     0.01   0.990    -2.017372    2.042571
        ev12 |  -1.361006   1.059211    -1.28   0.199    -3.437375     .715364
        ev13 |   .3799344   1.035639     0.37   0.714    -1.650227    2.410096
        ev14 |  -.9173127   1.056014    -0.87   0.385    -2.987414    1.152789
        ev15 |  -2.454051   1.055929    -2.32   0.020    -4.523988   -.3841152
        ev16 |  -.4043276   1.049536    -0.39   0.700    -2.461731    1.653076
        ev17 |   .4955659   1.039748     0.48   0.634     -1.54265    2.533782
        ev18 |   .9120541   1.045345     0.87   0.383    -1.137133    2.961242
        ev19 |   .0628122     1.0507     0.06   0.952    -1.996872    2.122497
        ev20 |  -1.546327   1.042306    -1.48   0.138    -3.589557    .4969032
        male |  -.2732857   .0237273   -11.52   0.000    -.3197983   -.2267732
       _cons |   .1239562   .0152674     8.12   0.000     .0940275    .1538848
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,355
                                                F(22, 5332)       =       6.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0261
                                                Root MSE          =     .98119

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |  -.0187755   .0135277    -1.39   0.165    -.0452954    .0077443
         ev1 |  -6.787815   4.454423    -1.52   0.128    -15.52031    1.944675
         ev2 |  -1.213669   1.568359    -0.77   0.439    -4.288295    1.860957
         ev3 |    1.84564   1.719862     1.07   0.283    -1.525993    5.217272
         ev4 |   1.323079   2.521246     0.52   0.600    -3.619594    6.265752
         ev5 |   1.553875    1.17953     1.32   0.188    -.7584871    3.866237
         ev6 |   -.166161   1.157947    -0.14   0.886     -2.43621    2.103888
         ev7 |   .6223884    1.11994     0.56   0.578    -1.573152    2.817928
         ev8 |  -.0384336   1.150535    -0.03   0.973    -2.293953    2.217086
         ev9 |  -.8392485    1.15234    -0.73   0.466    -3.098307     1.41981
        ev10 |  -1.352945   1.064629    -1.27   0.204    -3.440053     .734164
        ev11 |   .2380779   1.078348     0.22   0.825    -1.875926    2.352082
        ev12 |  -1.143807   1.106435    -1.03   0.301    -3.312873    1.025259
        ev13 |   .4171831   1.078605     0.39   0.699    -1.697324     2.53169
        ev14 |  -.7327915   1.098491    -0.67   0.505    -2.886284    1.420701
        ev15 |  -2.164026   1.096961    -1.97   0.049    -4.314518   -.0135343
        ev16 |  -.1910306   1.093068    -0.17   0.861     -2.33389    1.951829
        ev17 |   .7155965   1.084732     0.66   0.509    -1.410922    2.842115
        ev18 |   1.165478   1.084394     1.07   0.283    -.9603767    3.291334
        ev19 |   .0538337   1.089229     0.05   0.961    -2.081501    2.189168
        ev20 |  -1.852334   1.084236    -1.71   0.088    -3.977879    .2732114
        male |  -.2838726   .0270297   -10.50   0.000    -.3368619   -.2308834
       _cons |    .140305   .0175595     7.99   0.000     .1058812    .1747288
------------------------------------------------------------------------------
Univariate Analysis for attractive
(1981 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,814
                                                F(21, 5792)       =       1.66
                                                Prob > F          =     0.0301
                                                R-squared         =     0.0059
                                                Root MSE          =     .99887

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -1.778251   4.432079    -0.40   0.688    -10.46678     6.91028
         ev2 |   .4122886   1.530318     0.27   0.788    -2.587706    3.412283
         ev3 |  -.4803534   1.703466    -0.28   0.778    -3.819784    2.859077
         ev4 |  -1.625019   2.453246    -0.66   0.508    -6.434297    3.184259
         ev5 |   2.728897   1.187956     2.30   0.022     .4000589    5.057736
         ev6 |   .1170108   1.171723     0.10   0.920    -2.180005    2.414026
         ev7 |  -2.102173   1.186253    -1.77   0.076    -4.427672    .2233251
         ev8 |  -1.330049   1.233751    -1.08   0.281    -3.748661    1.088563
         ev9 |    .327436   1.253426     0.26   0.794    -2.129747    2.784619
        ev10 |  -1.303932   1.194796    -1.09   0.275    -3.646178    1.038314
        ev11 |  -.8477607   1.152398    -0.74   0.462    -3.106892     1.41137
        ev12 |  -2.012792    1.18817    -1.69   0.090    -4.342049    .3164662
        ev13 |  -.9879349   1.184053    -0.83   0.404    -3.309121    1.333252
        ev14 |   .5441582   1.222773     0.45   0.656    -1.852933    2.941249
        ev15 |   .0881838   1.208254     0.07   0.942    -2.280445    2.456813
        ev16 |   .2079743   1.194572     0.17   0.862    -2.133833    2.549781
        ev17 |   .3277216   1.208102     0.27   0.786     -2.04061    2.696053
        ev18 |  -1.971124   1.170634    -1.68   0.092    -4.266004     .323756
        ev19 |   .8079681   1.200893     0.67   0.501    -1.546231    3.162167
        ev20 |   1.785034   1.217056     1.47   0.143    -.6008502    4.170919
        male |  -.0912971   .0262384    -3.48   0.001    -.1427342     -.03986
       _cons |   .0429994   .0186726     2.30   0.021     .0063941    .0796047
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,262
                                                F(22, 4239)       =       1.48
                                                Prob > F          =     0.0707
                                                R-squared         =     0.0073
                                                Root MSE          =     .99572

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0143999    .014962     0.96   0.336    -.0149335    .0437333
         ev1 |   -4.55564     4.7473    -0.96   0.337    -13.86284    4.751554
         ev2 |  -.2649366   1.664521    -0.16   0.874    -3.528269    2.998396
         ev3 |  -1.638209   1.836742    -0.89   0.372    -5.239185    1.962767
         ev4 |  -1.109635   2.612365    -0.42   0.671    -6.231238    4.011968
         ev5 |   2.783089   1.307413     2.13   0.033     .2198751    5.346302
         ev6 |   .5365472   1.265427     0.42   0.672    -1.944352    3.017447
         ev7 |  -2.185536   1.246893    -1.75   0.080      -4.6301    .2590282
         ev8 |  -1.418942   1.291164    -1.10   0.272    -3.950299    1.112416
         ev9 |   -.279407   1.315725    -0.21   0.832    -2.858917    2.300103
        ev10 |  -1.192528   1.247503    -0.96   0.339    -3.638286    1.253231
        ev11 |  -1.075482   1.209833    -0.89   0.374    -3.447389    1.296425
        ev12 |  -2.605558   1.246815    -2.09   0.037    -5.049968   -.1611483
        ev13 |  -.7669291   1.236807    -0.62   0.535    -3.191719    1.657861
        ev14 |   .7930272   1.284882     0.62   0.537    -1.726014    3.312068
        ev15 |   .6521498   1.270259     0.51   0.608    -1.838223    3.142522
        ev16 |   .2250693   1.246364     0.18   0.857    -2.218457    2.668596
        ev17 |   .3783096   1.267982     0.30   0.765      -2.1076    2.864219
        ev18 |  -1.869763   1.219701    -1.53   0.125    -4.261015    .5214893
        ev19 |   .5810495   1.257031     0.46   0.644     -1.88339    3.045489
        ev20 |   1.621018   1.276122     1.27   0.204    -.8808506    4.122886
        male |  -.0881365   .0305373    -2.89   0.004    -.1480056   -.0282674
       _cons |   .0300296   .0217322     1.38   0.167    -.0125769    .0726361
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      5,814
                                                F(21, 5792)       =       1.66
                                                Prob > F          =     0.0301
                                                R-squared         =     0.0059
                                                Root MSE          =     .99887

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -1.778251   4.432079    -0.40   0.688    -10.46678     6.91028
         ev2 |   .4122886   1.530318     0.27   0.788    -2.587706    3.412283
         ev3 |  -.4803534   1.703466    -0.28   0.778    -3.819784    2.859077
         ev4 |  -1.625019   2.453246    -0.66   0.508    -6.434297    3.184259
         ev5 |   2.728897   1.187956     2.30   0.022     .4000589    5.057736
         ev6 |   .1170108   1.171723     0.10   0.920    -2.180005    2.414026
         ev7 |  -2.102173   1.186253    -1.77   0.076    -4.427672    .2233251
         ev8 |  -1.330049   1.233751    -1.08   0.281    -3.748661    1.088563
         ev9 |    .327436   1.253426     0.26   0.794    -2.129747    2.784619
        ev10 |  -1.303932   1.194796    -1.09   0.275    -3.646178    1.038314
        ev11 |  -.8477607   1.152398    -0.74   0.462    -3.106892     1.41137
        ev12 |  -2.012792    1.18817    -1.69   0.090    -4.342049    .3164662
        ev13 |  -.9879349   1.184053    -0.83   0.404    -3.309121    1.333252
        ev14 |   .5441582   1.222773     0.45   0.656    -1.852933    2.941249
        ev15 |   .0881838   1.208254     0.07   0.942    -2.280445    2.456813
        ev16 |   .2079743   1.194572     0.17   0.862    -2.133833    2.549781
        ev17 |   .3277216   1.208102     0.27   0.786     -2.04061    2.696053
        ev18 |  -1.971124   1.170634    -1.68   0.092    -4.266004     .323756
        ev19 |   .8079681   1.200893     0.67   0.501    -1.546231    3.162167
        ev20 |   1.785034   1.217056     1.47   0.143    -.6008502    4.170919
        male |  -.0912971   .0262384    -3.48   0.001    -.1427342     -.03986
       _cons |   .0429994   .0186726     2.30   0.021     .0063941    .0796047
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,262
                                                F(22, 4239)       =       1.44
                                                Prob > F          =     0.0846
                                                R-squared         =     0.0071
                                                Root MSE          =     .99582

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |    .001704   .0153278     0.11   0.911    -.0283464    .0317544
         ev1 |  -4.576701   4.761202    -0.96   0.336    -13.91115    4.757748
         ev2 |  -.3315307   1.663058    -0.20   0.842    -3.591996    2.928935
         ev3 |  -1.715235   1.835333    -0.93   0.350    -5.313448    1.882979
         ev4 |  -1.192358    2.61539    -0.46   0.648    -6.319892    3.935176
         ev5 |   2.833522   1.301802     2.18   0.030     .2813086    5.385735
         ev6 |   .5774305   1.266946     0.46   0.649    -1.906448    3.061309
         ev7 |  -2.236578   1.247326    -1.79   0.073     -4.68199    .2088332
         ev8 |   -1.41128   1.291049    -1.09   0.274    -3.942412    1.119853
         ev9 |  -.2736017   1.317423    -0.21   0.835    -2.856442    2.309238
        ev10 |  -1.225457   1.247273    -0.98   0.326    -3.670765     1.21985
        ev11 |  -1.095059   1.210919    -0.90   0.366    -3.469093    1.278976
        ev12 |  -2.635856   1.248212    -2.11   0.035    -5.083005   -.1887076
        ev13 |  -.7766448   1.237037    -0.63   0.530    -3.201886    1.648596
        ev14 |    .783417   1.284554     0.61   0.542    -1.734982    3.301816
        ev15 |   .6282062   1.270361     0.49   0.621    -1.862366    3.118778
        ev16 |   .1959929   1.246664     0.16   0.875    -2.248122    2.640108
        ev17 |   .3917905   1.266742     0.31   0.757    -2.091687    2.875268
        ev18 |  -1.902618   1.220632    -1.56   0.119    -4.295696    .4904608
        ev19 |   .5456129   1.255566     0.43   0.664    -1.915955    3.007181
        ev20 |   1.650781   1.275588     1.29   0.196    -.8500391    4.151602
        male |   -.088202   .0305409    -2.89   0.004    -.1480782   -.0283258
       _cons |   .0300138   .0217443     1.38   0.168    -.0126165    .0726441
------------------------------------------------------------------------------
Univariate Analysis for gpa_hsrank
(3073 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      4,722
                                                F(21, 4700)       =      18.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0735
                                                Root MSE          =     .96471

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -4.492734    4.85337    -0.93   0.355    -14.00762    5.022147
         ev2 |  -1.310284   1.598647    -0.82   0.412    -4.444381    1.823813
         ev3 |   .2631073   1.788311     0.15   0.883     -3.24282    3.769035
         ev4 |   3.346766   2.561127     1.31   0.191    -1.674243    8.367776
         ev5 |   4.146461   1.161104     3.57   0.000     1.870152     6.42277
         ev6 |   3.747286     1.1524     3.25   0.001     1.488041    6.006531
         ev7 |   .8805508   1.183596     0.74   0.457    -1.439852    3.200953
         ev8 |   3.902156   1.216522     3.21   0.001     1.517203     6.28711
         ev9 |    3.13435   1.266088     2.48   0.013     .6522233    5.616476
        ev10 |  -.3506952   1.150936    -0.30   0.761    -2.607069    1.905679
        ev11 |  -.2794093   1.139696    -0.25   0.806    -2.513748     1.95493
        ev12 |  -.2314291   1.145595    -0.20   0.840    -2.477333    2.014475
        ev13 |  -1.055114   1.155336    -0.91   0.361    -3.320114    1.209885
        ev14 |  -.1330398   1.165237    -0.11   0.909    -2.417451    2.151371
        ev15 |    -2.1278   1.176587    -1.81   0.071    -4.434461    .1788619
        ev16 |   .3609703   1.155505     0.31   0.755    -1.904361    2.626302
        ev17 |   .0659053   1.158118     0.06   0.955    -2.204549     2.33636
        ev18 |   .3972672   1.145921     0.35   0.729    -1.849275    2.643809
        ev19 |  -.5933294   1.133488    -0.52   0.601    -2.815497    1.628838
        ev20 |   .4915999   1.135326     0.43   0.665    -1.734172    2.717372
        male |  -.5049027   .0282636   -17.86   0.000    -.5603126   -.4494928
       _cons |   .2324997     .01901    12.23   0.000     .1952311    .2697682
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,585
                                                F(22, 4562)       =      18.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0788
                                                Root MSE          =     .96249

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0764006   .0142448     5.36   0.000     .0484738    .1043274
         ev1 |  -3.163008    4.94316    -0.64   0.522      -12.854     6.52798
         ev2 |  -.7802425   1.614994    -0.48   0.629    -3.946413    2.385928
         ev3 |   .7303386   1.808706     0.40   0.686    -2.815601    4.276278
         ev4 |   3.863264    2.57383     1.50   0.133    -1.182688    8.909216
         ev5 |   3.775586   1.161436     3.25   0.001     1.498609    6.052564
         ev6 |   3.364884   1.155054     2.91   0.004     1.100419     5.62935
         ev7 |   1.062265   1.180312     0.90   0.368    -1.251718    3.376249
         ev8 |   3.948714   1.215506     3.25   0.001     1.565735    6.331694
         ev9 |   2.974853   1.265172     2.35   0.019     .4945035    5.455203
        ev10 |     -.1596   1.148119    -0.14   0.889     -2.41047     2.09127
        ev11 |   -.113013   1.136782    -0.10   0.921    -2.341656     2.11563
        ev12 |  -.0624037   1.143991    -0.05   0.957    -2.305179    2.180372
        ev13 |  -.9579093   1.155585    -0.83   0.407    -3.223415    1.307596
        ev14 |  -.1328614   1.164408    -0.11   0.909    -2.415665    2.149943
        ev15 |   -1.99548   1.175669    -1.70   0.090    -4.300361    .3094003
        ev16 |   .4581807   1.157262     0.40   0.692    -1.810612    2.726974
        ev17 |   .0638827   1.156726     0.06   0.956    -2.203861    2.331627
        ev18 |   .5731617   1.145253     0.50   0.617    -1.672088    2.818411
        ev19 |  -.4421887   1.135839    -0.39   0.697    -2.668983    1.784605
        ev20 |    .559262   1.133195     0.49   0.622     -1.66235    2.780874
        male |   -.500573   .0286332   -17.48   0.000    -.5567079   -.4444381
       _cons |   .2393001    .019186    12.47   0.000     .2016863    .2769139
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      4,722
                                                F(21, 4700)       =      18.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0735
                                                Root MSE          =     .96471

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -4.492734    4.85337    -0.93   0.355    -14.00762    5.022147
         ev2 |  -1.310284   1.598647    -0.82   0.412    -4.444381    1.823813
         ev3 |   .2631073   1.788311     0.15   0.883     -3.24282    3.769035
         ev4 |   3.346766   2.561127     1.31   0.191    -1.674243    8.367776
         ev5 |   4.146461   1.161104     3.57   0.000     1.870152     6.42277
         ev6 |   3.747286     1.1524     3.25   0.001     1.488041    6.006531
         ev7 |   .8805508   1.183596     0.74   0.457    -1.439852    3.200953
         ev8 |   3.902156   1.216522     3.21   0.001     1.517203     6.28711
         ev9 |    3.13435   1.266088     2.48   0.013     .6522233    5.616476
        ev10 |  -.3506952   1.150936    -0.30   0.761    -2.607069    1.905679
        ev11 |  -.2794093   1.139696    -0.25   0.806    -2.513748     1.95493
        ev12 |  -.2314291   1.145595    -0.20   0.840    -2.477333    2.014475
        ev13 |  -1.055114   1.155336    -0.91   0.361    -3.320114    1.209885
        ev14 |  -.1330398   1.165237    -0.11   0.909    -2.417451    2.151371
        ev15 |    -2.1278   1.176587    -1.81   0.071    -4.434461    .1788619
        ev16 |   .3609703   1.155505     0.31   0.755    -1.904361    2.626302
        ev17 |   .0659053   1.158118     0.06   0.955    -2.204549     2.33636
        ev18 |   .3972672   1.145921     0.35   0.729    -1.849275    2.643809
        ev19 |  -.5933294   1.133488    -0.52   0.601    -2.815497    1.628838
        ev20 |   .4915999   1.135326     0.43   0.665    -1.734172    2.717372
        male |  -.5049027   .0282636   -17.86   0.000    -.5603126   -.4494928
       _cons |   .2324997     .01901    12.23   0.000     .1952311    .2697682
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,585
                                                F(22, 4562)       =      26.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1055
                                                Root MSE          =     .94843

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .1812749   .0137358    13.20   0.000      .154346    .2082038
         ev1 |  -1.784914   4.565025    -0.39   0.696    -10.73457    7.164744
         ev2 |   .2229274    1.54872     0.14   0.886    -2.813314    3.259169
         ev3 |   .6282471   1.701145     0.37   0.712    -2.706821    3.963316
         ev4 |   3.692336   2.432432     1.52   0.129    -1.076408    8.461081
         ev5 |   3.450681   1.139271     3.03   0.002     1.217159    5.684202
         ev6 |   2.911547   1.135643     2.56   0.010     .6851372    5.137957
         ev7 |   .3786039   1.163904     0.33   0.745    -1.903211    2.660419
         ev8 |   3.792746   1.191921     3.18   0.001     1.456005    6.129488
         ev9 |   2.675738   1.235977     2.16   0.030     .2526246    5.098852
        ev10 |   -.585594   1.131236    -0.52   0.605    -2.803365    1.632177
        ev11 |  -.5935137   1.126064    -0.53   0.598    -2.801143    1.614116
        ev12 |  -.1227128   1.128549    -0.11   0.913    -2.335214    2.089789
        ev13 |  -1.387724    1.13822    -1.22   0.223    -3.619186     .843739
        ev14 |   .0845648   1.143873     0.07   0.941    -2.157979    2.327109
        ev15 |  -2.070288   1.156003    -1.79   0.073    -4.336614    .1960381
        ev16 |   .4701685   1.134853     0.41   0.679    -1.754692    2.695029
        ev17 |   .1713157   1.141006     0.15   0.881    -2.065609     2.40824
        ev18 |  -.2182108   1.127625    -0.19   0.847    -2.428901    1.992479
        ev19 |   -.956292   1.110906    -0.86   0.389    -3.134206    1.221622
        ev20 |   .4362168   1.123605     0.39   0.698    -1.766593    2.639026
        male |  -.5005772    .028211   -17.74   0.000    -.5558845   -.4452699
       _cons |   .2399186   .0189763    12.64   0.000     .2027159    .2771213
------------------------------------------------------------------------------
Univariate Analysis for cog_sim
(922 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      6,873
                                                F(21, 6851)       =       2.31
                                                Prob > F          =     0.0006
                                                R-squared         =     0.0067
                                                Root MSE          =     .99819

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -3.954514     5.0449    -0.78   0.433    -13.84408    5.935056
         ev2 |  -4.881306   1.529718    -3.19   0.001    -7.880027   -1.882585
         ev3 |  -.4553459   1.764011    -0.26   0.796    -3.913355    3.002663
         ev4 |  -1.388833   2.291945    -0.61   0.545    -5.881756     3.10409
         ev5 |    1.56911    1.05627     1.49   0.137    -.5015059    3.639727
         ev6 |    2.95424   1.025382     2.88   0.004     .9441736    4.964306
         ev7 |  -1.389257   1.124895    -1.24   0.217      -3.5944    .8158867
         ev8 |   1.594375    1.16169     1.37   0.170    -.6828979    3.871649
         ev9 |   2.093211   1.178203     1.78   0.076    -.2164313    4.402854
        ev10 |  -.3773839   1.081028    -0.35   0.727    -2.496534    1.741766
        ev11 |  -1.095761   1.091361    -1.00   0.315    -3.235167    1.043645
        ev12 |   .2664891   1.086948     0.25   0.806    -1.864266    2.397244
        ev13 |  -.7444239   1.096398    -0.68   0.497    -2.893703    1.404856
        ev14 |   .8510631   1.095095     0.78   0.437    -1.295663    2.997789
        ev15 |   .0058541     1.1019     0.01   0.996    -2.154212     2.16592
        ev16 |  -1.715013   1.104153    -1.55   0.120    -3.879495    .4494694
        ev17 |   1.632768    1.11028     1.47   0.141    -.5437257    3.809262
        ev18 |  -.7468076   1.101145    -0.68   0.498    -2.905393    1.411778
        ev19 |  -2.415689   1.088528    -2.22   0.027    -4.549542   -.2818361
        ev20 |  -.5364297   1.096634    -0.49   0.625    -2.686173    1.613314
        male |   .0202949   .0242928     0.84   0.404    -.0273265    .0679164
       _cons |  -.0140915   .0162933    -0.86   0.387    -.0460315    .0178485
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,027
                                                F(22, 5004)       =       2.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0111
                                                Root MSE          =     .99701

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .0560974   .0142542     3.94   0.000      .028153    .0840418
         ev1 |    .346681   5.242985     0.07   0.947    -9.931866    10.62523
         ev2 |  -4.409706   1.661452    -2.65   0.008    -7.666881   -1.152532
         ev3 |   .9616569   1.859746     0.52   0.605     -2.68426    4.607574
         ev4 |   1.211465   2.424773     0.50   0.617    -3.542153    5.965082
         ev5 |   .8967762   1.137762     0.79   0.431    -1.333735    3.127288
         ev6 |   2.415192   1.099863     2.20   0.028     .2589795    4.571405
         ev7 |  -.7457679   1.190401    -0.63   0.531    -3.079476     1.58794
         ev8 |   1.259553   1.231843     1.02   0.307      -1.1554    3.674505
         ev9 |   2.235065    1.24607     1.79   0.073    -.2077787    4.677909
        ev10 |  -.4686673   1.128133    -0.42   0.678    -2.680303    1.742969
        ev11 |  -1.179594   1.142946    -1.03   0.302     -3.42027    1.061082
        ev12 |   .4528835   1.139833     0.40   0.691    -1.781689    2.687456
        ev13 |  -.7257128   1.150699    -0.63   0.528    -2.981587    1.530161
        ev14 |   .6028293   1.147554     0.53   0.599     -1.64688    2.852539
        ev15 |  -.3322241    1.15392    -0.29   0.773    -2.594413    1.929965
        ev16 |  -1.878821   1.160065    -1.62   0.105    -4.153056    .3954146
        ev17 |   2.061946   1.160514     1.78   0.076    -.2131689    4.337062
        ev18 |  -.3432892   1.154184    -0.30   0.766    -2.605996    1.919418
        ev19 |  -1.749773   1.140285    -1.53   0.125    -3.985232    .4856853
        ev20 |  -.2653272   1.148878    -0.23   0.817    -2.517631    1.986977
        male |    .031234   .0283335     1.10   0.270    -.0243122    .0867801
       _cons |  -.0264322   .0189882    -1.39   0.164    -.0636573    .0107929
------------------------------------------------------------------------------
(2112 missing values generated)

Linear regression                               Number of obs     =      6,873
                                                F(21, 6851)       =       2.31
                                                Prob > F          =     0.0006
                                                R-squared         =     0.0067
                                                Root MSE          =     .99819

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         ev1 |  -3.954514     5.0449    -0.78   0.433    -13.84408    5.935056
         ev2 |  -4.881306   1.529718    -3.19   0.001    -7.880027   -1.882585
         ev3 |  -.4553459   1.764011    -0.26   0.796    -3.913355    3.002663
         ev4 |  -1.388833   2.291945    -0.61   0.545    -5.881756     3.10409
         ev5 |    1.56911    1.05627     1.49   0.137    -.5015059    3.639727
         ev6 |    2.95424   1.025382     2.88   0.004     .9441736    4.964306
         ev7 |  -1.389257   1.124895    -1.24   0.217      -3.5944    .8158867
         ev8 |   1.594375    1.16169     1.37   0.170    -.6828979    3.871649
         ev9 |   2.093211   1.178203     1.78   0.076    -.2164313    4.402854
        ev10 |  -.3773839   1.081028    -0.35   0.727    -2.496534    1.741766
        ev11 |  -1.095761   1.091361    -1.00   0.315    -3.235167    1.043645
        ev12 |   .2664891   1.086948     0.25   0.806    -1.864266    2.397244
        ev13 |  -.7444239   1.096398    -0.68   0.497    -2.893703    1.404856
        ev14 |   .8510631   1.095095     0.78   0.437    -1.295663    2.997789
        ev15 |   .0058541     1.1019     0.01   0.996    -2.154212     2.16592
        ev16 |  -1.715013   1.104153    -1.55   0.120    -3.879495    .4494694
        ev17 |   1.632768    1.11028     1.47   0.141    -.5437257    3.809262
        ev18 |  -.7468076   1.101145    -0.68   0.498    -2.905393    1.411778
        ev19 |  -2.415689   1.088528    -2.22   0.027    -4.549542   -.2818361
        ev20 |  -.5364297   1.096634    -0.49   0.625    -2.686173    1.613314
        male |   .0202949   .0242928     0.84   0.404    -.0273265    .0679164
       _cons |  -.0140915   .0162933    -0.86   0.387    -.0460315    .0178485
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,027
                                                F(22, 5004)       =       6.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0273
                                                Root MSE          =     .98884

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           Z |   .1401476   .0137699    10.18   0.000     .1131525    .1671427
         ev1 |   1.388486   4.819501     0.29   0.773    -8.059848    10.83682
         ev2 |  -3.756863   1.580699    -2.38   0.018    -6.855726       -.658
         ev3 |   .7337748   1.756346     0.42   0.676    -2.709434    4.176983
         ev4 |   1.013424   2.315832     0.44   0.662    -3.526622     5.55347
         ev5 |   .6369632   1.127066     0.57   0.572    -1.572581    2.846507
         ev6 |   1.901671   1.094716     1.74   0.082     -.244452    4.047794
         ev7 |  -1.212393   1.174028    -1.03   0.302    -3.514002    1.089216
         ev8 |   1.009201   1.221166     0.83   0.409    -1.384819    3.403221
         ev9 |   2.034707   1.228156     1.66   0.098    -.3730159     4.44243
        ev10 |  -.8034736    1.11541    -0.72   0.471    -2.990167     1.38322
        ev11 |  -1.468666   1.134333    -1.29   0.195    -3.692456    .7551233
        ev12 |   .5046332   1.127694     0.45   0.655    -1.706142    2.715408
        ev13 |  -1.017498      1.138    -0.89   0.371    -3.248477    1.213481
        ev14 |   .6165989    1.13497     0.54   0.587     -1.60844    2.841638
        ev15 |  -.3613805   1.147043    -0.32   0.753    -2.610088    1.887327
        ev16 |  -1.943023   1.150862    -1.69   0.091    -4.199218    .3131714
        ev17 |   2.149279   1.157284     1.86   0.063    -.1195044    4.418062
        ev18 |   -.971992   1.141198    -0.85   0.394     -3.20924    1.265256
        ev19 |  -2.011207   1.122133    -1.79   0.073    -4.211079    .1886653
        ev20 |  -.0529294   1.133158    -0.05   0.963    -2.274416    2.168557
        male |   .0312661    .028095     1.11   0.266    -.0238123    .0863445
       _cons |  -.0260903   .0188478    -1.38   0.166    -.0630403    .0108597
------------------------------------------------------------------------------
. 
. matrix Fx1 = J(1,12,999)
. matrix colnames Fx1 = N Beta_NC SE DeltaR2 Pval SqrtDeltaR2 N Beta_Cog SE DeltaR2 P
> val SqrtDeltaR2
. 
. foreach pheno in $PHENO {
  2.         matrix `pheno' = `pheno'[1,1...], `pheno'[2,1...] 
  3.         matrix rownames `pheno' = `pheno'
  4.         matrix Fx1 = Fx1 \ `pheno'
  5.         }       
. matrix Fx1 = Fx1[2...,1...]     
. matrix list Fx1

Fx1[10,12]
                      N      Beta_NC           SE      DeltaR2         Pval
  eduyears         5171     .0993966    .01332995    .01292148    1.036e-13
        iq         4882    .01082563    .01450115    .00039479    .45537975
     extra         5295   -.00713866     .0136779    .00111316    .60175382
     openn         5349    .03639151    .01333436    .00112354    .00637057
     neuro         5308   -.03770896    .01371893    .00191432     .0060039
     consc         5364   -.02937494    .01341094    .00210022    .02854041
     agree         5355    .01856744    .01368735    .00286439    .17498487
attractive         4262    .01439992    .01496201    .00147496    .33588747
gpa_hsrank         4585     .0764006    .01424483    .00533074    8.571e-08
   cog_sim         5027    .05609738    .01425416    .00447045    .00008415

            SqrtDeltaR2            N     Beta_Cog           SE      DeltaR2
  eduyears    .11367268         5171    .13327486    .01358415    .02085942
        iq    .01986924         4882    .27352716    .01359753    .07448538
     extra    .03336405         5295   -.01467375    .01372563    .00127737
     openn    .03351927         5349    .05876075    .01323116    .00323991
     neuro     .0437529         5308   -.01097178    .01366613    .00064976
     consc    .04582813         5364   -.00983722    .01354736    .00134215
     agree    .05351996         5355   -.01877554    .01352772    .00287679
attractive    .03840516         4262    .00170402    .01532775    .00127032
gpa_hsrank    .07301194         4585     .1812749    .01373583    .03204249
   cog_sim    .06686144         5027    .14014758    .01376994    .02061644

                   Pval  SqrtDeltaR2
  eduyears    1.588e-22    .14442791
        iq    1.634e-86    .27292009
     extra    .28508415    .03574033
     openn    9.132e-06    .05692024
     neuro    .42210066    .02549042
     consc    .46778756    .03663533
     agree    .16521618    .05363571
attractive    .91148531    .03564153
gpa_hsrank    4.692e-39    .17900416
   cog_sim    4.271e-24    .14358425
. 
. * matrix list Fx1
. putexcel set "${DIRCODE}/output/CogNonCog_WLS.xlsx", sheet(WLSUnivar) modify
. putexcel a1 = matrix(Fx1), names
file /Users/michellerosenberger/Development/GEIGHEI/WLSanalysis/WLS/output/CogNonCog_
> WLS.xlsx saved
. 
. 
. *--------------Multivariate Analysis (as in CogNonCog_181121.do)
. // Multivariate Program
. capture program drop FXmv 
. program define FXmv
  1.    args y 
  2.    preserve
  3.    capture drop Y
  4.    egen Y = std(`y')
  5.    foreach x in NONCOG_PGS COG_PGS {
  6.       egen z`x' = std(`x')
  7.       }
  8.    reg Y zCOG_PGS ev1-ev20 male, robust
  9.    local R2cog = e(r2)
 10.    reg Y zNONCOG_PGS ev1-ev20 male, robust
 11.    local R2nc = e(r2)   
 12.    reg Y zNONCOG_PGS zCOG_PGS ev1-ev20 male, robust 
 13.    matrix A = e(N), _b[zNONCOG_PGS], _se[zNONCOG_PGS], e(r2)-`R2cog', 2*ttail(e(
> df_r), abs(_b[zNONCOG_PGS]/_se[zNONCOG_PGS])) , sqrt(e(r2)-`R2cog'), ///
>                _b[zCOG_PGS], _se[zCOG_PGS], e(r2)-`R2nc', 2*ttail(e(df_r), abs(_b[z
> COG_PGS]/_se[zCOG_PGS])), sqrt(e(r2)-`R2nc') 
 14.    matrix rownames A = `y'
 15.    matrix colnames A = N Beta_nc SE_nc DeltaR2_nc Pval_nc SqrtDeltaR2_nc Beta_c 
> SE_c DeltaR2_c Pval_c SqrtDeltaR2_c
 16.    matrix `y' = A
 17.    drop Y
 18.    restore
 19. end
. 
. // Apply Program
. matrix mvFX = J(1,11,999)
. 
. foreach pheno in $PHENO {
  2.         FXmv `pheno'
  3.         matrix mvFX = mvFX \ `pheno'
  4. }
(1855 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,171
                                                F(22, 5148)       =      21.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0832
                                                Root MSE          =     .95378

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |   .1332749   .0135842     9.81   0.000     .1066442    .1599056
         ev1 |   3.680709   4.540855     0.81   0.418    -5.221295    12.58271
         ev2 |  -6.337955   1.443746    -4.39   0.000    -9.168311   -3.507599
         ev3 |  -2.594107   1.650393    -1.57   0.116    -5.829578    .6413638
         ev4 |  -.0358067   2.177463    -0.02   0.987    -4.304559    4.232946
         ev5 |    4.63871   1.097573     4.23   0.000     2.487002    6.790419
         ev6 |   8.231348   1.067571     7.71   0.000     6.138455    10.32424
         ev7 |  -1.548782   1.093284    -1.42   0.157    -3.692083    .5945201
         ev8 |   2.134906   1.153889     1.85   0.064     -.127208    4.397019
         ev9 |   2.059831   1.168955     1.76   0.078    -.2318186     4.35148
        ev10 |   .4932323   1.058466     0.47   0.641    -1.581811    2.568275
        ev11 |  -.8490922   1.079749    -0.79   0.432    -2.965859    1.267675
        ev12 |  -1.414989   1.074248    -1.32   0.188    -3.520972    .6909936
        ev13 |  -.4540698   1.107684    -0.41   0.682    -2.625601    1.717462
        ev14 |   1.374946   1.073768     1.28   0.200    -.7300963    3.479988
        ev15 |  -1.239504   1.085697    -1.14   0.254    -3.367932     .888924
        ev16 |  -.0149446   1.058334    -0.01   0.989    -2.089729     2.05984
        ev17 |   1.715826    1.08099     1.59   0.113    -.4033737    3.835025
        ev18 |  -1.831261   1.058417    -1.73   0.084    -3.906208    .2436858
        ev19 |  -.2631075   1.084553    -0.24   0.808    -2.389292    1.863077
        ev20 |   .0012236   1.072232     0.00   0.999    -2.100806    2.103253
        male |    .388456   .0270633    14.35   0.000     .3354005    .4415116
       _cons |  -.1769839   .0157656   -11.23   0.000    -.2078911   -.1460767
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,171
                                                F(22, 5148)       =      20.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0752
                                                Root MSE          =      .9579

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0993966     .01333     7.46   0.000     .0732642     .125529
         ev1 |   2.730065   4.396004     0.62   0.535     -5.88797     11.3481
         ev2 |  -6.677845   1.433791    -4.66   0.000    -9.488684   -3.867006
         ev3 |   -2.32988    1.62579    -1.43   0.152    -5.517119    .8573593
         ev4 |      .1397   2.177842     0.06   0.949    -4.129795    4.409195
         ev5 |   4.689494   1.108524     4.23   0.000     2.516316    6.862672
         ev6 |   8.426758   1.074182     7.84   0.000     6.320906    10.53261
         ev7 |  -1.036948    1.09586    -0.95   0.344    -3.185299    1.111404
         ev8 |   2.187889   1.156031     1.89   0.058    -.0784233    4.454202
         ev9 |   2.175106    1.16928     1.86   0.063    -.1171791    4.467391
        ev10 |   .9693436   1.059827     0.91   0.360    -1.108367    3.047055
        ev11 |  -.5699303   1.085445    -0.53   0.600    -2.697863    1.558003
        ev12 |   -1.24613   1.076505    -1.16   0.247    -3.356538    .8642779
        ev13 |  -.1532067   1.110785    -0.14   0.890    -2.330817    2.024403
        ev14 |   1.346007   1.082095     1.24   0.214    -.7753589    3.467373
        ev15 |  -1.137311   1.093157    -1.04   0.298    -3.280362    1.005741
        ev16 |   .0813407   1.059297     0.08   0.939    -1.995332    2.158014
        ev17 |   1.565506   1.086321     1.44   0.150    -.5641443    3.695156
        ev18 |  -1.281578   1.060424    -1.21   0.227    -3.360459    .7973032
        ev19 |   .1127988   1.099285     0.10   0.918    -2.042266    2.267864
        ev20 |  -.1078692   1.073255    -0.10   0.920    -2.211906    1.996167
        male |   .3887418   .0271802    14.30   0.000     .3354572    .4420265
       _cons |   -.176692   .0156497   -11.29   0.000     -.207372   -.1460119
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,171
                                                F(23, 5147)       =      27.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1087
                                                Root MSE          =      .9405

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .1722778   .0141513    12.17   0.000     .1445353    .2000204
    zCOG_PGS |   .1967737   .0143743    13.69   0.000     .1685939    .2249535
         ev1 |   4.960928   4.598969     1.08   0.281    -4.055005    13.97686
         ev2 |  -4.886472   1.460127    -3.35   0.001    -7.748941   -2.024003
         ev3 |  -1.720832   1.662298    -1.04   0.301    -4.979642    1.537978
         ev4 |   .6649442    2.22384     0.30   0.765    -3.694728    5.024616
         ev5 |   3.702933   1.090306     3.40   0.001      1.56547    5.840396
         ev6 |   7.287154   1.063016     6.86   0.000     5.203191    9.371117
         ev7 |  -1.323041   1.078644    -1.23   0.220    -3.437641    .7915593
         ev8 |   1.975405   1.145451     1.72   0.085    -.2701652    4.220975
         ev9 |   1.746556   1.148081     1.52   0.128    -.5041708    3.997283
        ev10 |   .7739102   1.039896     0.74   0.457    -1.264728    2.812549
        ev11 |  -.8313028    1.06767    -0.78   0.436    -2.924389    1.261783
        ev12 |   -.920483   1.060029    -0.87   0.385     -2.99859    1.157624
        ev13 |   -.368556   1.097781    -0.34   0.737    -2.520673    1.783561
        ev14 |   1.512499   1.062915     1.42   0.155    -.5712652    3.596264
        ev15 |  -.9802723   1.068408    -0.92   0.359    -3.074806    1.114261
        ev16 |   .2298657    1.04031     0.22   0.825    -1.809584    2.269315
        ev17 |   1.588761   1.069322     1.49   0.137    -.5075648    3.685086
        ev18 |  -1.645626   1.046774    -1.57   0.116    -3.697748    .4064958
        ev19 |   .0511667   1.074062     0.05   0.962    -2.054451    2.156784
        ev20 |  -.2350851   1.058672    -0.22   0.824    -2.310533    1.840363
        male |   .3923443   .0266938    14.70   0.000     .3400131    .4446754
       _cons |  -.1782009   .0154617   -11.53   0.000    -.2085125   -.1478894
------------------------------------------------------------------------------
(2772 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      4,882
                                                F(22, 4859)       =      24.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0909
                                                Root MSE          =     .95426

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |   .2735272   .0135975    20.12   0.000     .2468698    .3001845
         ev1 |    -7.7281   4.232313    -1.83   0.068    -16.02535    .5691484
         ev2 |   -3.99084   1.439782    -2.77   0.006    -6.813464   -1.168216
         ev3 |  -1.283008   1.619298    -0.79   0.428    -4.457564    1.891548
         ev4 |  -.7956498   2.164645    -0.37   0.713    -5.039333    3.448033
         ev5 |  -.0796402   1.122498    -0.07   0.943    -2.280244    2.120963
         ev6 |   6.447908   1.060771     6.08   0.000     4.368317    8.527499
         ev7 |  -.5135237    1.12838    -0.46   0.649    -2.725659    1.698611
         ev8 |   3.111337   1.151943     2.70   0.007     .8530072    5.369667
         ev9 |   1.396216   1.226408     1.14   0.255    -1.008098     3.80053
        ev10 |  -1.350385   1.106538    -1.22   0.222      -3.5197    .8189308
        ev11 |  -.6081877   1.080797    -0.56   0.574    -2.727038    1.510663
        ev12 |   .0532936   1.123107     0.05   0.962    -2.148505    2.255092
        ev13 |  -2.967043   1.119871    -2.65   0.008    -5.162498   -.7715885
        ev14 |   .9987748   1.105152     0.90   0.366    -1.167823    3.165372
        ev15 |  -1.522655   1.136468    -1.34   0.180    -3.750645    .7053359
        ev16 |    1.33852   1.105582     1.21   0.226    -.8289206    3.505961
        ev17 |  -1.693672   1.095308    -1.55   0.122    -3.840972    .4536275
        ev18 |  -.3183017   1.106117    -0.29   0.774    -2.486791    1.850188
        ev19 |  -1.325209   1.094535    -1.21   0.226    -3.470992    .8205743
        ev20 |  -.5949366   1.106593    -0.54   0.591     -2.76436    1.574487
        male |  -.0135471   .0274983    -0.49   0.622    -.0674563     .040362
       _cons |   .0051991   .0183796     0.28   0.777    -.0308332    .0412314
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,882
                                                F(22, 4859)       =       4.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0168
                                                Root MSE          =     .99239

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0108256   .0145011     0.75   0.455    -.0176032    .0392544
         ev1 |  -10.18308   4.523279    -2.25   0.024    -19.05075   -1.315409
         ev2 |  -5.941037    1.50566    -3.95   0.000    -8.892813   -2.989262
         ev3 |  -1.511806   1.720948    -0.88   0.380    -4.885643    1.862031
         ev4 |  -.9672834   2.386325    -0.41   0.685    -5.645559    3.710993
         ev5 |   .7829243   1.181994     0.66   0.508    -1.534319    3.100168
         ev6 |   7.647706    1.10812     6.90   0.000      5.47529    9.820123
         ev7 |   .1895146   1.193398     0.16   0.874    -2.150086    2.529115
         ev8 |   3.392371   1.202352     2.82   0.005     1.035218    5.749524
         ev9 |   1.892996   1.285866     1.47   0.141    -.6278819    4.413875
        ev10 |  -.8731823   1.149659    -0.76   0.448    -3.127034    1.380669
        ev11 |  -.0473938   1.125405    -0.04   0.966    -2.253697     2.15891
        ev12 |  -.1290115   1.172174    -0.11   0.912    -2.427002    2.168979
        ev13 |  -2.483103    1.16471    -2.13   0.033    -4.766461   -.1997457
        ev14 |   .7262839   1.153292     0.63   0.529     -1.53469    2.987258
        ev15 |  -1.823195   1.179824    -1.55   0.122    -4.136184    .4897935
        ev16 |   1.135776    1.15222     0.99   0.324    -1.123095    3.394648
        ev17 |  -1.822549   1.135675    -1.60   0.109    -4.048985    .4038876
        ev18 |    .506629   1.148505     0.44   0.659    -1.744961    2.758219
        ev19 |  -.9097378   1.136782    -0.80   0.424    -3.138344    1.318869
        ev20 |  -.4866583   1.133151    -0.43   0.668    -2.708146    1.734829
        male |  -.0185615   .0286366    -0.65   0.517    -.0747022    .0375792
       _cons |   .0067351   .0189644     0.36   0.722    -.0304437    .0439139
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,882
                                                F(23, 4858)       =      27.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1054
                                                Root MSE          =      .9467

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .1302075   .0151046     8.62   0.000     .1005956    .1598194
    zCOG_PGS |   .3219493   .0146865    21.92   0.000     .2931571    .3507414
         ev1 |  -6.728485   4.332645    -1.55   0.120    -15.22243    1.765459
         ev2 |  -2.856652   1.455748    -1.96   0.050    -5.710576   -.0027281
         ev3 |  -.6263912   1.635654    -0.38   0.702    -3.833013     2.58023
         ev4 |  -.2178805   2.164161    -0.10   0.920    -4.460616    4.024855
         ev5 |  -.7791699   1.116652    -0.70   0.485    -2.968314    1.409974
         ev6 |   5.719278    1.06244     5.38   0.000     3.636414    7.802142
         ev7 |  -.3692072   1.120575    -0.33   0.742    -2.566042    1.827627
         ev8 |   3.026911   1.143318     2.65   0.008     .7854893    5.268332
         ev9 |    1.15999   1.217782     0.95   0.341    -1.227413    3.547393
        ev10 |  -1.113895   1.096892    -1.02   0.310    -3.264298    1.036509
        ev11 |  -.6671472   1.072372    -0.62   0.534    -2.769482    1.435188
        ev12 |   .4333986   1.115891     0.39   0.698    -1.754253     2.62105
        ev13 |  -2.961767   1.115204    -2.66   0.008    -5.148071    -.775463
        ev14 |   1.126222   1.096459     1.03   0.304    -1.023334    3.275778
        ev15 |   -1.32069   1.125483    -1.17   0.241    -3.527145    .8857661
        ev16 |   1.484115   1.102175     1.35   0.178    -.6766462    3.644876
        ev17 |  -1.788954    1.08875    -1.64   0.100    -3.923396    .3454873
        ev18 |  -.1915725   1.099704    -0.17   0.862     -2.34749    1.964345
        ev19 |  -1.086495   1.090279    -1.00   0.319    -3.223936    1.050945
        ev20 |  -.7706652   1.098131    -0.70   0.483    -2.923499    1.382169
        male |  -.0098871   .0272794    -0.36   0.717     -.063367    .0435928
       _cons |   .0038838   .0182091     0.21   0.831    -.0318143     .039582
------------------------------------------------------------------------------
(772 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,295
                                                F(22, 5272)       =       4.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0187
                                                Root MSE          =     .99484

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |  -.0146737   .0137256    -1.07   0.285    -.0415817    .0122342
         ev1 |   6.389921   4.580639     1.39   0.163    -2.590028    15.36987
         ev2 |   .7568066   1.515113     0.50   0.617    -2.213442    3.727055
         ev3 |   -2.04447   1.694253    -1.21   0.228    -5.365908    1.276967
         ev4 |    1.42764   2.261291     0.63   0.528    -3.005426    5.860707
         ev5 |  -1.096003   1.129607    -0.97   0.332    -3.310501    1.118495
         ev6 |   .8180112   1.105669     0.74   0.459    -1.349558    2.985581
         ev7 |  -2.908852   1.092111    -2.66   0.008    -5.049843   -.7678611
         ev8 |  -.0422703   1.150345    -0.04   0.971    -2.297423    2.212882
         ev9 |  -.8029074   1.189833    -0.67   0.500    -3.135472    1.529657
        ev10 |   2.833319    1.11851     2.53   0.011     .6405772    5.026061
        ev11 |  -.2985888   1.103162    -0.27   0.787    -2.461244    1.864066
        ev12 |   -1.58677   1.121965    -1.41   0.157    -3.786285    .6127459
        ev13 |   .3849827   1.111685     0.35   0.729    -1.794379    2.564345
        ev14 |   .6359046   1.129645     0.56   0.574    -1.578668    2.850477
        ev15 |   1.127605   1.107906     1.02   0.309     -1.04435     3.29956
        ev16 |  -1.316702   1.106349    -1.19   0.234    -3.485604     .852199
        ev17 |    1.24767   1.118595     1.12   0.265    -.9452389    3.440578
        ev18 |   .5935837   1.122397     0.53   0.597     -1.60678    2.793947
        ev19 |   .9763769   1.102467     0.89   0.376    -1.184914    3.137668
        ev20 |  -.9570886   1.107328    -0.86   0.387     -3.12791    1.213733
        male |  -.2176899   .0274434    -7.93   0.000    -.2714903   -.1638895
       _cons |   .1248286   .0187758     6.65   0.000     .0880203    .1616369
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,295
                                                F(22, 5272)       =       4.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0186
                                                Root MSE          =     .99492

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |  -.0071387   .0136779    -0.52   0.602     -.033953    .0196757
         ev1 |   6.480286   4.556517     1.42   0.155    -2.452374    15.41295
         ev2 |   .8202141   1.506932     0.54   0.586    -2.133997    3.774425
         ev3 |  -2.074491   1.688169    -1.23   0.219    -5.384001    1.235019
         ev4 |   1.396932   2.260755     0.62   0.537    -3.035084    5.828948
         ev5 |  -1.114326   1.131776    -0.98   0.325    -3.333075    1.104423
         ev6 |   .7735751   1.101666     0.70   0.483    -1.386147    2.933297
         ev7 |  -2.971144   1.091857    -2.72   0.007    -5.111637   -.8306518
         ev8 |  -.0680995     1.1498    -0.06   0.953    -2.322184    2.185985
         ev9 |  -.8213066   1.190578    -0.69   0.490    -3.155333    1.512719
        ev10 |   2.797568   1.118137     2.50   0.012     .6055566    4.989579
        ev11 |  -.3286538   1.102967    -0.30   0.766    -2.490926    1.833618
        ev12 |   -1.59425   1.122933    -1.42   0.156    -3.795664    .6071633
        ev13 |   .3587775   1.111122     0.32   0.747    -1.819481    2.537036
        ev14 |   .6419146   1.129302     0.57   0.570    -1.571985    2.855814
        ev15 |   1.112696   1.107936     1.00   0.315    -1.059317    3.284708
        ev16 |  -1.317361    1.10643    -1.19   0.234    -3.486422    .8517003
        ev17 |   1.261039   1.119026     1.13   0.260    -.9327144    3.454793
        ev18 |   .5494755   1.122708     0.49   0.625    -1.651497    2.750447
        ev19 |   .9499175    1.10183     0.86   0.389    -1.210126    3.109961
        ev20 |  -.9472891   1.107033    -0.86   0.392    -3.117532    1.222954
        male |  -.2175483   .0274469    -7.93   0.000    -.2713555    -.163741
       _cons |   .1248218   .0187716     6.65   0.000     .0880218    .1616219
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,295
                                                F(23, 5271)       =       4.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0189
                                                Root MSE          =     .99484

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |  -.0147865   .0148671    -0.99   0.320    -.0439321    .0143591
    zCOG_PGS |  -.0201699   .0149069    -1.35   0.176    -.0493935    .0090537
         ev1 |    6.25735   4.586218     1.36   0.173    -2.733537    15.24824
         ev2 |   .6309708   1.517958     0.42   0.678    -2.344856    3.606797
         ev3 |  -2.121848   1.695932    -1.25   0.211    -5.446578    1.202882
         ev4 |   1.339445   2.264086     0.59   0.554      -3.0991    5.777991
         ev5 |  -1.013989   1.132092    -0.90   0.370    -3.233358    1.205381
         ev6 |     .89849   1.106971     0.81   0.417    -1.271632    3.068612
         ev7 |  -2.935465   1.092139    -2.69   0.007    -5.076511   -.7944203
         ev8 |  -.0418831   1.150237    -0.04   0.971    -2.296824    2.213058
         ev9 |   -.777864   1.189077    -0.65   0.513    -3.108947    1.553219
        ev10 |   2.813101   1.118514     2.52   0.012     .6203498    5.005853
        ev11 |  -.2939576   1.102919    -0.27   0.790    -2.456136    1.868221
        ev12 |  -1.627537   1.121511    -1.45   0.147    -3.826162    .5710878
        ev13 |   .3750172   1.111247     0.34   0.736    -1.803487    2.553522
        ev14 |   .6249753   1.129356     0.55   0.580     -1.58903    2.838981
        ev15 |   1.112508   1.108246     1.00   0.315    -1.060113    3.285129
        ev16 |  -1.342229   1.105768    -1.21   0.225    -3.509993    .8255339
        ev17 |   1.257003   1.118475     1.12   0.261    -.9356711    3.449677
        ev18 |   .5803447   1.122848     0.52   0.605    -1.620903    2.781592
        ev19 |   .9508586   1.102615     0.86   0.389    -1.210724    3.112441
        ev20 |  -.9411302   1.107266    -0.85   0.395    -3.111829    1.229569
        male |  -.2177143    .027444    -7.93   0.000    -.2715158   -.1639128
       _cons |   .1247871   .0187768     6.65   0.000     .0879768    .1615973
------------------------------------------------------------------------------
(690 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,349
                                                F(22, 5326)       =       9.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0359
                                                Root MSE          =     .98835

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |   .0587607   .0132312     4.44   0.000     .0328223    .0846992
         ev1 |   7.811612   4.529707     1.72   0.085    -1.068469    16.69169
         ev2 |   2.560412   1.506649     1.70   0.089     -.393238    5.514061
         ev3 |   2.942361   1.720522     1.71   0.087     -.430566    6.315289
         ev4 |   4.917512   2.693802     1.83   0.068    -.3634443    10.19847
         ev5 |    1.63213   1.124631     1.45   0.147    -.5726079    3.836868
         ev6 |   2.605788   1.113948     2.34   0.019     .4219933    4.789583
         ev7 |  -1.613047    1.09362    -1.47   0.140     -3.75699    .5308953
         ev8 |    1.65238   1.103649     1.50   0.134    -.5112247    3.815984
         ev9 |   .6103031    1.17694     0.52   0.604    -1.696982    2.917588
        ev10 |   2.553246   1.120955     2.28   0.023     .3557157    4.750777
        ev11 |   1.202198   1.088191     1.10   0.269    -.9311015    3.335498
        ev12 |  -.9241911   1.097582    -0.84   0.400    -3.075902     1.22752
        ev13 |  -.7488779   1.093683    -0.68   0.494    -2.892945    1.395189
        ev14 |  -.1052989   1.102338    -0.10   0.924    -2.266333    2.055735
        ev15 |  -.1123867   1.088604    -0.10   0.918    -2.246497    2.021724
        ev16 |  -.9996015   1.129196    -0.89   0.376    -3.213288    1.214085
        ev17 |    1.88438   1.092929     1.72   0.085     -.258208    4.026969
        ev18 |  -.4771866   1.075998    -0.44   0.657    -2.586583     1.63221
        ev19 |  -1.017254   1.089533    -0.93   0.351    -3.153184    1.118676
        ev20 |    .411353   1.075079     0.38   0.702    -1.696243    2.518949
        male |   .3296822   .0269316    12.24   0.000     .2768851    .3824792
       _cons |   -.153786   .0199938    -7.69   0.000     -.192982   -.1145901
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,349
                                                F(22, 5326)       =       8.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0338
                                                Root MSE          =     .98944

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0363915   .0133344     2.73   0.006     .0102507    .0625323
         ev1 |   7.501039   4.538609     1.65   0.098    -1.396494    16.39857
         ev2 |   2.398534   1.507996     1.59   0.112    -.5577552    5.354823
         ev3 |   3.098496   1.725819     1.80   0.073    -.2848159    6.481807
         ev4 |   5.082886   2.693723     1.89   0.059    -.1979139    10.36369
         ev5 |   1.667746   1.132728     1.47   0.141    -.5528642    3.888357
         ev6 |   2.751769    1.11895     2.46   0.014     .5581687    4.945369
         ev7 |  -1.341062   1.096223    -1.22   0.221    -3.490109    .8079852
         ev8 |   1.764226   1.104475     1.60   0.110    -.4009968    3.929449
         ev9 |   .6954027   1.180002     0.59   0.556    -1.617885     3.00869
        ev10 |   2.725654   1.121458     2.43   0.015     .5271371     4.92417
        ev11 |   1.318929   1.089842     1.21   0.226    -.8176074    3.455466
        ev12 |   -.851533   1.098307    -0.78   0.438    -3.004664    1.301598
        ev13 |  -.6522237   1.095748    -0.60   0.552    -2.800338    1.495891
        ev14 |  -.1061225   1.104849    -0.10   0.923    -2.272079    2.059834
        ev15 |  -.0495276   1.090025    -0.05   0.964    -2.186424    2.087368
        ev16 |   -.989843   1.128614    -0.88   0.381    -3.202389    1.222703
        ev17 |   1.825689   1.094352     1.67   0.095    -.3196896    3.971068
        ev18 |  -.2906668   1.075793    -0.27   0.787    -2.399661    1.818327
        ev19 |  -.8921266   1.092698    -0.82   0.414    -3.034261    1.250008
        ev20 |   .3918073   1.076274     0.36   0.716    -1.718131    2.501745
        male |   .3291749   .0269661    12.21   0.000     .2763104    .3820394
       _cons |  -.1534631   .0199823    -7.68   0.000    -.1926366   -.1142895
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,349
                                                F(23, 5325)       =       9.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0398
                                                Root MSE          =     .98645

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0682844   .0145041     4.71   0.000     .0398503    .0967184
    zCOG_PGS |   .0842182    .014405     5.85   0.000     .0559785    .1124579
         ev1 |   8.457335   4.606345     1.84   0.066    -.5729876    17.48766
         ev2 |   3.185302   1.524444     2.09   0.037     .1967677    6.173837
         ev3 |   3.309736   1.737469     1.90   0.057    -.0964143    6.715887
         ev4 |   5.322116   2.700893     1.97   0.049      .027259    10.61697
         ev5 |   1.251884   1.127336     1.11   0.267    -.9581561    3.461925
         ev6 |   2.237532   1.119544     2.00   0.046     .0427681    4.432296
         ev7 |  -1.471302   1.091699    -1.35   0.178    -3.611479     .668875
         ev8 |   1.652888   1.102084     1.50   0.134    -.5076485    3.813425
         ev9 |   .5169272   1.175126     0.44   0.660      -1.7868    2.820655
        ev10 |   2.636791   1.118383     2.36   0.018     .4443015     4.82928
        ev11 |   1.178249   1.086099     1.08   0.278     -.950949    3.307447
        ev12 |   -.730932   1.096493    -0.67   0.505    -2.880508    1.418644
        ev13 |  -.7232199   1.093031    -0.66   0.508    -2.866009    1.419569
        ev14 |  -.0223046   1.101782    -0.02   0.984    -2.182249     2.13764
        ev15 |  -.0411441   1.085604    -0.04   0.970    -2.169372    2.087084
        ev16 |   -.879661   1.126179    -0.78   0.435    -3.087433    1.328111
        ev17 |   1.848545   1.091826     1.69   0.090    -.2918808    3.988971
        ev18 |  -.4129825   1.073452    -0.38   0.700    -2.517388    1.691423
        ev19 |  -.8981259   1.087197    -0.83   0.409    -3.029477    1.233225
        ev20 |   .3365051   1.074844     0.31   0.754     -1.77063     2.44364
        male |   .3301872   .0268852    12.28   0.000     .2774813    .3828932
       _cons |  -.1537412   .0199319    -7.71   0.000    -.1928159   -.1146665
------------------------------------------------------------------------------
(751 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,308
                                                F(22, 5285)       =       4.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0196
                                                Root MSE          =     .99487

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |  -.0109718   .0136661    -0.80   0.422     -.037763    .0158195
         ev1 |   7.187653   6.000967     1.20   0.231     -4.57672    18.95203
         ev2 |   2.121875   1.816277     1.17   0.243    -1.438778    5.682528
         ev3 |  -.4773591   2.068614    -0.23   0.818    -4.532697    3.577979
         ev4 |   .8573498   2.690105     0.32   0.750    -4.416367    6.131066
         ev5 |  -1.267383   1.145647    -1.11   0.269    -3.513323    .9785582
         ev6 |   1.160121   1.123001     1.03   0.302    -1.041425    3.361666
         ev7 |   .1494451   1.144433     0.13   0.896    -2.094116    2.393006
         ev8 |  -.8015083   1.160919    -0.69   0.490    -3.077388    1.474372
         ev9 |    .159327    1.17238     0.14   0.892    -2.139023    2.457677
        ev10 |   -.754873   1.112881    -0.68   0.498    -2.936579    1.426833
        ev11 |  -1.563373   1.098485    -1.42   0.155    -3.716857    .5901112
        ev12 |   2.297838   1.102416     2.08   0.037      .136647    4.459029
        ev13 |  -.2249541    1.11049    -0.20   0.839    -2.401973    1.952065
        ev14 |  -1.511386   1.128322    -1.34   0.180    -3.723363    .7005897
        ev15 |   .4499984   1.109263     0.41   0.685    -1.724615    2.624612
        ev16 |   -.553811   1.117922    -0.50   0.620    -2.745401    1.637779
        ev17 |  -1.225841   1.092042    -1.12   0.262    -3.366693    .9150123
        ev18 |   1.192579   1.098277     1.09   0.278    -.9604978    3.345656
        ev19 |  -.2428997   1.103917    -0.22   0.826    -2.407032    1.921233
        ev20 |   -.158537   1.101661    -0.14   0.886    -2.318247    2.001173
        male |  -.2488458   .0273193    -9.11   0.000    -.3024029   -.1952887
       _cons |   .1147667   .0196826     5.83   0.000     .0761806    .1533527
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,308
                                                F(22, 5285)       =       5.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0208
                                                Root MSE          =     .99422

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   -.037709   .0137189    -2.75   0.006    -.0646037   -.0108142
         ev1 |    7.08226   6.118589     1.16   0.247    -4.912701    19.07722
         ev2 |   1.969891   1.835768     1.07   0.283    -1.628972    5.568754
         ev3 |  -.6470635   2.096786    -0.31   0.758     -4.75763    3.463503
         ev4 |   .6614731   2.722076     0.24   0.808     -4.67492    5.997866
         ev5 |   -1.14574   1.147652    -1.00   0.318    -3.395612    1.104131
         ev6 |   1.249164   1.119829     1.12   0.265    -.9461637    3.444491
         ev7 |   .0069827   1.142574     0.01   0.995    -2.232934      2.2469
         ev8 |  -.8314703   1.160383    -0.72   0.474      -3.1063    1.443359
         ev9 |   .1597586   1.172937     0.14   0.892    -2.139682    2.459199
        ev10 |  -.8452019   1.113045    -0.76   0.448    -3.027229    1.336825
        ev11 |  -1.590973   1.097389    -1.45   0.147    -3.742309    .5603634
        ev12 |   2.207033   1.101519     2.00   0.045     .0476012    4.366465
        ev13 |  -.2741173   1.109947    -0.25   0.805    -2.450072    1.901837
        ev14 |  -1.543424   1.128651    -1.37   0.172    -3.756046    .6691984
        ev15 |   .4067765   1.109757     0.37   0.714    -1.768805    2.582358
        ev16 |  -.6031988   1.115838    -0.54   0.589    -2.790703    1.584305
        ev17 |  -1.189683   1.092313    -1.09   0.276    -3.331068     .951701
        ev18 |     1.1244   1.098111     1.02   0.306    -1.028351     3.27715
        ev19 |  -.3446037   1.103238    -0.31   0.755    -2.507406    1.818199
        ev20 |   -.113532   1.101046    -0.10   0.918    -2.272038    2.044974
        male |  -.2489893    .027301    -9.12   0.000    -.3025105   -.1954681
       _cons |   .1148106   .0196757     5.84   0.000     .0762381     .153383
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,308
                                                F(23, 5284)       =       5.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0215
                                                Root MSE          =     .99395

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |  -.0486892    .014935    -3.26   0.001    -.0779679   -.0194105
    zCOG_PGS |  -.0290936   .0148491    -1.96   0.050     -.058204    .0000168
         ev1 |   6.750923   6.090629     1.11   0.268    -5.189225    18.69107
         ev2 |   1.700018   1.838594     0.92   0.355    -1.904386    5.304422
         ev3 |  -.7167156   2.089745    -0.34   0.732     -4.81348    3.380048
         ev4 |   .5733126   2.716471     0.21   0.833    -4.752092    5.898718
         ev5 |  -1.002139   1.148188    -0.87   0.383    -3.253062    1.248785
         ev6 |   1.425956   1.125793     1.27   0.205    -.7810644    3.632976
         ev7 |   .0548642   1.143196     0.05   0.962    -2.186272       2.296
         ev8 |  -.7944883   1.158658    -0.69   0.493    -3.065936    1.476959
         ev9 |   .2223554   1.172061     0.19   0.850    -2.075368    2.520078
        ev10 |  -.8135751   1.112889    -0.73   0.465    -2.995298    1.368147
        ev11 |  -1.545736    1.09679    -1.41   0.159    -3.695897    .6044247
        ev12 |   2.165372   1.102412     1.96   0.050      .004189    4.326555
        ev13 |   -.249984   1.109877    -0.23   0.822    -2.425802    1.925834
        ev14 |  -1.564151   1.128075    -1.39   0.166    -3.775643    .6473414
        ev15 |   .4058037   1.109535     0.37   0.715    -1.769344    2.580951
        ev16 |   -.637006   1.115374    -0.57   0.568    -2.823601    1.549589
        ev17 |  -1.201585   1.092183    -1.10   0.271    -3.342715    .9395449
        ev18 |   1.166975     1.0976     1.06   0.288    -.9847742    3.318724
        ev19 |  -.3488932   1.103603    -0.32   0.752     -2.51241    1.814624
        ev20 |  -.0970242   1.100656    -0.09   0.930    -2.254765    2.060717
        male |  -.2493648   .0272933    -9.14   0.000    -.3028708   -.1958587
       _cons |   .1147935   .0196568     5.84   0.000     .0762581    .1533289
------------------------------------------------------------------------------
(662 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,364
                                                F(22, 5341)       =       0.97
                                                Prob > F          =     0.4984
                                                R-squared         =     0.0041
                                                Root MSE          =     .99361

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |  -.0098372   .0135474    -0.73   0.468    -.0363956    .0167211
         ev1 |   .0443849   4.678851     0.01   0.992    -9.128074    9.216844
         ev2 |    .661414   1.551231     0.43   0.670    -2.379631    3.702459
         ev3 |   .3284919   1.736638     0.19   0.850    -3.076028    3.733011
         ev4 |   .1253713   2.307891     0.05   0.957    -4.399038    4.649781
         ev5 |   2.028436   1.123375     1.81   0.071    -.1738376     4.23071
         ev6 |  -.8156271   1.119844    -0.73   0.466    -3.010979    1.379725
         ev7 |  -.0458198   1.098872    -0.04   0.967    -2.200058    2.108419
         ev8 |   .0284713    1.13283     0.03   0.980    -2.192338    2.249281
         ev9 |    .834072   1.180281     0.71   0.480     -1.47976    3.147904
        ev10 |   1.031373    1.12309     0.92   0.358    -1.170341    3.233087
        ev11 |   .7353515   1.093347     0.67   0.501    -1.408055    2.878758
        ev12 |  -1.759702   1.105509    -1.59   0.111     -3.92695    .4075469
        ev13 |   .1041704      1.104     0.09   0.925     -2.06012    2.268461
        ev14 |  -1.727254   1.103498    -1.57   0.118     -3.89056    .4360523
        ev15 |  -.2923597   1.092443    -0.27   0.789    -2.433994    1.849274
        ev16 |  -2.120018   1.090818    -1.94   0.052    -4.258467    .0184308
        ev17 |  -.0187474   1.073275    -0.02   0.986    -2.122805     2.08531
        ev18 |   -.694099   1.096767    -0.63   0.527    -2.844209    1.456011
        ev19 |  -1.198103   1.111568    -1.08   0.281     -3.37723    .9810235
        ev20 |  -.1491009   1.103752    -0.14   0.893    -2.312905    2.014703
        male |  -.0620034   .0272794    -2.27   0.023    -.1154821   -.0085247
       _cons |   .0390198   .0186789     2.09   0.037     .0024016     .075638
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,364
                                                F(22, 5341)       =       1.18
                                                Prob > F          =     0.2552
                                                R-squared         =     0.0049
                                                Root MSE          =     .99323

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |  -.0293749   .0134109    -2.19   0.029    -.0556659    -.003084
         ev1 |  -.0621594   4.632202    -0.01   0.989    -9.143167    9.018848
         ev2 |   .5444226   1.537044     0.35   0.723    -2.468811    3.557656
         ev3 |   .1755114   1.728025     0.10   0.919    -3.212123    3.563146
         ev4 |  -.0356555   2.288597    -0.02   0.988     -4.52224    4.450929
         ev5 |   2.126278   1.121583     1.90   0.058    -.0724825    4.325038
         ev6 |  -.7454223   1.119895    -0.67   0.506    -2.940873    1.450028
         ev7 |  -.1589189   1.096107    -0.14   0.885    -2.307735    1.989898
         ev8 |   -.007063   1.131543    -0.01   0.995    -2.225348    2.211222
         ev9 |    .842685   1.178891     0.71   0.475    -1.468423    3.153793
        ev10 |   .9592377   1.123189     0.85   0.393    -1.242672    3.161147
        ev11 |   .7024806   1.092734     0.64   0.520    -1.439725    2.844686
        ev12 |  -1.836589   1.105997    -1.66   0.097    -4.004795    .3316174
        ev13 |   .0728182   1.104414     0.07   0.947    -2.092284    2.237921
        ev14 |  -1.745804   1.102081    -1.58   0.113    -3.906334    .4147251
        ev15 |  -.3254574   1.093962    -0.30   0.766    -2.470069    1.819154
        ev16 |  -2.157246   1.090798    -1.98   0.048    -4.295655    -.018837
        ev17 |   .0053402   1.072802     0.00   0.996     -2.09779     2.10847
        ev18 |  -.7664624   1.097196    -0.70   0.485    -2.917415     1.38449
        ev19 |  -1.272333   1.110895    -1.15   0.252    -3.450141    .9054758
        ev20 |  -.1271719   1.105031    -0.12   0.908    -2.293484     2.03914
        male |  -.0620582   .0272684    -2.28   0.023    -.1155153   -.0086011
       _cons |    .039022   .0186672     2.09   0.037     .0024267    .0756172
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,364
                                                F(23, 5340)       =       1.25
                                                Prob > F          =     0.1924
                                                R-squared         =     0.0054
                                                Root MSE          =     .99307

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |  -.0385053   .0144379    -2.67   0.008    -.0668096   -.0102011
    zCOG_PGS |  -.0241783   .0145866    -1.66   0.097     -.052774    .0044174
         ev1 |   -.320785   4.610402    -0.07   0.945    -9.359056    8.717486
         ev2 |   .3164124   1.538205     0.21   0.837    -2.699097    3.331922
         ev3 |    .121771   1.721036     0.07   0.944    -3.252163    3.495705
         ev4 |  -.0997146   2.278462    -0.04   0.965    -4.566431    4.367002
         ev5 |   2.246937   1.122461     2.00   0.045      .046456    4.447418
         ev6 |  -.6018483   1.119096    -0.54   0.591    -2.795733    1.592036
         ev7 |  -.1190993   1.096732    -0.11   0.914    -2.269141    2.030943
         ev8 |   .0276582   1.131325     0.02   0.980      -2.1902    2.245517
         ev9 |   .8922199   1.179499     0.76   0.449    -1.420081     3.20452
        ev10 |    .989265   1.123926     0.88   0.379    -1.214089    3.192619
        ev11 |   .7409441     1.0929     0.68   0.498    -1.401585    2.883473
        ev12 |  -1.870785   1.105244    -1.69   0.091    -4.037513    .2959441
        ev13 |   .0898564   1.104324     0.08   0.935    -2.075069    2.254782
        ev14 |  -1.769778   1.102842    -1.60   0.109    -3.931798    .3922423
        ev15 |  -.3309395   1.093357    -0.30   0.762    -2.474365    1.812486
        ev16 |  -2.184305   1.091173    -2.00   0.045    -4.323449   -.0451604
        ev17 |  -.0041885   1.072242    -0.00   0.997     -2.10622    2.097843
        ev18 |  -.7285996   1.096528    -0.66   0.506    -2.878241    1.421042
        ev19 |  -1.271879   1.110157    -1.15   0.252     -3.44824    .9044829
        ev20 |  -.1122368   1.104801    -0.10   0.919    -2.278098    2.053624
        male |  -.0622951   .0272628    -2.28   0.022    -.1157414   -.0088488
       _cons |   .0390745   .0186584     2.09   0.036     .0024964    .0756526
------------------------------------------------------------------------------
(675 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,355
                                                F(22, 5332)       =       6.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0261
                                                Root MSE          =     .98119

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |  -.0187755   .0135277    -1.39   0.165    -.0452954    .0077443
         ev1 |  -6.787815   4.454423    -1.52   0.128    -15.52031    1.944675
         ev2 |  -1.213669   1.568359    -0.77   0.439    -4.288295    1.860957
         ev3 |    1.84564   1.719862     1.07   0.283    -1.525993    5.217272
         ev4 |   1.323079   2.521246     0.52   0.600    -3.619594    6.265752
         ev5 |   1.553875    1.17953     1.32   0.188    -.7584871    3.866237
         ev6 |   -.166161   1.157947    -0.14   0.886     -2.43621    2.103888
         ev7 |   .6223884    1.11994     0.56   0.578    -1.573152    2.817928
         ev8 |  -.0384336   1.150535    -0.03   0.973    -2.293953    2.217086
         ev9 |  -.8392485    1.15234    -0.73   0.466    -3.098307     1.41981
        ev10 |  -1.352945   1.064629    -1.27   0.204    -3.440053     .734164
        ev11 |   .2380779   1.078348     0.22   0.825    -1.875926    2.352082
        ev12 |  -1.143807   1.106435    -1.03   0.301    -3.312873    1.025259
        ev13 |   .4171831   1.078605     0.39   0.699    -1.697324     2.53169
        ev14 |  -.7327915   1.098491    -0.67   0.505    -2.886284    1.420701
        ev15 |  -2.164026   1.096961    -1.97   0.049    -4.314518   -.0135343
        ev16 |  -.1910306   1.093068    -0.17   0.861     -2.33389    1.951829
        ev17 |   .7155965   1.084732     0.66   0.509    -1.410922    2.842115
        ev18 |   1.165478   1.084394     1.07   0.283    -.9603767    3.291334
        ev19 |   .0538337   1.089229     0.05   0.961    -2.081501    2.189168
        ev20 |  -1.852334   1.084236    -1.71   0.088    -3.977879    .2732114
        male |  -.2838726   .0270297   -10.50   0.000    -.3368619   -.2308834
       _cons |    .140305   .0175595     7.99   0.000     .1058812    .1747288
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,355
                                                F(22, 5332)       =       6.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0261
                                                Root MSE          =     .98119

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0185674   .0136874     1.36   0.175    -.0082654    .0454003
         ev1 |  -6.510773    4.45568    -1.46   0.144    -15.24573    2.224183
         ev2 |  -.9681464   1.567126    -0.62   0.537    -4.040354    2.104061
         ev3 |   1.949391     1.7236     1.13   0.258     -1.42957    5.328352
         ev4 |   1.441987   2.527114     0.57   0.568    -3.512191    6.396165
         ev5 |   1.407799   1.183007     1.19   0.234    -.9113794    3.726977
         ev6 |  -.3218446   1.159344    -0.28   0.781    -2.594632    1.950943
         ev7 |   .6259904   1.118855     0.56   0.576    -1.567422    2.819403
         ev8 |  -.0614693   1.149178    -0.05   0.957    -2.314329     2.19139
         ev9 |   -.894553   1.151171    -0.78   0.437     -3.15132    1.362214
        ev10 |  -1.345308   1.063945    -1.26   0.206    -3.431076    .7404599
        ev11 |   .2164305   1.077319     0.20   0.841    -1.895555    2.328416
        ev12 |   -1.08478   1.107089    -0.98   0.327    -3.255127    1.085567
        ev13 |   .4137445   1.078229     0.38   0.701    -1.700025    2.527514
        ev14 |  -.7080798    1.09825    -0.64   0.519    -2.861099     1.44494
        ev15 |  -2.144513   1.097755    -1.95   0.051    -4.296562    .0075349
        ev16 |  -.1525298   1.092316    -0.14   0.889    -2.293917    1.988857
        ev17 |   .7127527   1.085015     0.66   0.511     -1.41432    2.839825
        ev18 |   1.160735   1.084776     1.07   0.285    -.9658701    3.287339
        ev19 |   .0788151   1.090931     0.07   0.942    -2.059856    2.217487
        ev20 |  -1.876542   1.083571    -1.73   0.083    -4.000785    .2476997
        male |  -.2834916    .027029   -10.49   0.000    -.3364795   -.2305037
       _cons |   .1401849   .0175657     7.98   0.000     .1057489    .1746209
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,355
                                                F(23, 5331)       =       6.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0262
                                                Root MSE          =      .9812

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0133364   .0146847     0.91   0.364    -.0154515    .0421244
    zCOG_PGS |  -.0137787   .0145129    -0.95   0.342    -.0422299    .0146726
         ev1 |  -6.665409   4.465436    -1.49   0.136    -15.41949    2.088671
         ev2 |  -1.097554   1.572291    -0.70   0.485    -4.179888     1.98478
         ev3 |   1.916165   1.725478     1.11   0.267    -1.466478    5.298808
         ev4 |   1.401316   2.525113     0.55   0.579    -3.548938     6.35157
         ev5 |   1.477732    1.18708     1.24   0.213    -.8494311    3.804894
         ev6 |  -.2392264   1.161995    -0.21   0.837    -2.517213     2.03876
         ev7 |   .6466885   1.118886     0.58   0.563    -1.546786    2.840163
         ev8 |  -.0401925   1.150072    -0.03   0.972    -2.294804    2.214419
         ev9 |  -.8627941   1.151659    -0.75   0.454    -3.120517    1.394929
        ev10 |  -1.336232   1.064279    -1.26   0.209    -3.422654    .7501905
        ev11 |   .2360018   1.078325     0.22   0.827    -1.877957     2.34996
        ev12 |  -1.106059   1.106957    -1.00   0.318    -3.276149     1.06403
        ev13 |   .4228061   1.078459     0.39   0.695    -1.691415    2.537027
        ev14 |  -.7201561   1.098167    -0.66   0.512    -2.873013    1.432701
        ev15 |  -2.148456   1.097365    -1.96   0.050     -4.29974    .0028283
        ev16 |  -.1692414   1.092747    -0.15   0.877    -2.311473     1.97299
        ev17 |   .7094904   1.085104     0.65   0.513    -1.417757    2.836738
        ev18 |   1.179062   1.084465     1.09   0.277    -.9469332    3.305057
        ev19 |   .0780241   1.090598     0.07   0.943    -2.059993    2.216041
        ev20 |  -1.866648   1.084688    -1.72   0.085     -3.99308    .2597842
        male |  -.2836918   .0270252   -10.50   0.000    -.3366723   -.2307113
       _cons |   .1402276   .0175641     7.98   0.000     .1057948    .1746604
------------------------------------------------------------------------------
(1981 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      4,262
                                                F(22, 4239)       =       1.44
                                                Prob > F          =     0.0846
                                                R-squared         =     0.0071
                                                Root MSE          =     .99582

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |    .001704   .0153278     0.11   0.911    -.0283464    .0317544
         ev1 |  -4.576701   4.761202    -0.96   0.336    -13.91115    4.757748
         ev2 |  -.3315307   1.663058    -0.20   0.842    -3.591996    2.928935
         ev3 |  -1.715235   1.835333    -0.93   0.350    -5.313448    1.882979
         ev4 |  -1.192358    2.61539    -0.46   0.648    -6.319892    3.935176
         ev5 |   2.833522   1.301802     2.18   0.030     .2813086    5.385735
         ev6 |   .5774305   1.266946     0.46   0.649    -1.906448    3.061309
         ev7 |  -2.236578   1.247326    -1.79   0.073     -4.68199    .2088332
         ev8 |   -1.41128   1.291049    -1.09   0.274    -3.942412    1.119853
         ev9 |  -.2736017   1.317423    -0.21   0.835    -2.856442    2.309238
        ev10 |  -1.225457   1.247273    -0.98   0.326    -3.670765     1.21985
        ev11 |  -1.095059   1.210919    -0.90   0.366    -3.469093    1.278976
        ev12 |  -2.635856   1.248212    -2.11   0.035    -5.083005   -.1887076
        ev13 |  -.7766448   1.237037    -0.63   0.530    -3.201886    1.648596
        ev14 |    .783417   1.284554     0.61   0.542    -1.734982    3.301816
        ev15 |   .6282062   1.270361     0.49   0.621    -1.862366    3.118778
        ev16 |   .1959929   1.246664     0.16   0.875    -2.248122    2.640108
        ev17 |   .3917905   1.266742     0.31   0.757    -2.091687    2.875268
        ev18 |  -1.902618   1.220632    -1.56   0.119    -4.295696    .4904608
        ev19 |   .5456129   1.255566     0.43   0.664    -1.915955    3.007181
        ev20 |   1.650781   1.275588     1.29   0.196    -.8500391    4.151602
        male |   -.088202   .0305409    -2.89   0.004    -.1480782   -.0283258
       _cons |   .0300138   .0217443     1.38   0.168    -.0126165    .0726441
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,262
                                                F(22, 4239)       =       1.48
                                                Prob > F          =     0.0707
                                                R-squared         =     0.0073
                                                Root MSE          =     .99572

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0143999    .014962     0.96   0.336    -.0149335    .0437333
         ev1 |   -4.55564     4.7473    -0.96   0.337    -13.86284    4.751554
         ev2 |  -.2649366   1.664521    -0.16   0.874    -3.528269    2.998396
         ev3 |  -1.638209   1.836742    -0.89   0.372    -5.239185    1.962767
         ev4 |  -1.109635   2.612365    -0.42   0.671    -6.231238    4.011968
         ev5 |   2.783089   1.307413     2.13   0.033     .2198751    5.346302
         ev6 |   .5365472   1.265427     0.42   0.672    -1.944352    3.017447
         ev7 |  -2.185536   1.246893    -1.75   0.080      -4.6301    .2590282
         ev8 |  -1.418942   1.291164    -1.10   0.272    -3.950299    1.112416
         ev9 |   -.279407   1.315725    -0.21   0.832    -2.858917    2.300103
        ev10 |  -1.192528   1.247503    -0.96   0.339    -3.638286    1.253231
        ev11 |  -1.075482   1.209833    -0.89   0.374    -3.447389    1.296425
        ev12 |  -2.605558   1.246815    -2.09   0.037    -5.049968   -.1611483
        ev13 |  -.7669291   1.236807    -0.62   0.535    -3.191719    1.657861
        ev14 |   .7930272   1.284882     0.62   0.537    -1.726014    3.312068
        ev15 |   .6521498   1.270259     0.51   0.608    -1.838223    3.142522
        ev16 |   .2250693   1.246364     0.18   0.857    -2.218457    2.668596
        ev17 |   .3783096   1.267982     0.30   0.765      -2.1076    2.864219
        ev18 |  -1.869763   1.219701    -1.53   0.125    -4.261015    .5214893
        ev19 |   .5810495   1.257031     0.46   0.644     -1.88339    3.045489
        ev20 |   1.621018   1.276122     1.27   0.204    -.8808506    4.122886
        male |  -.0881365   .0305373    -2.89   0.004    -.1480056   -.0282674
       _cons |   .0300296   .0217322     1.38   0.167    -.0125769    .0726361
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,262
                                                F(23, 4238)       =       1.42
                                                Prob > F          =     0.0882
                                                R-squared         =     0.0074
                                                Root MSE          =     .99581

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0177249   .0163107     1.09   0.277    -.0142527    .0497025
    zCOG_PGS |   .0086478   .0167054     0.52   0.605    -.0241035    .0413992
         ev1 |  -4.477876   4.742872    -0.94   0.345    -13.77639    4.820637
         ev2 |  -.1908455   1.665313    -0.11   0.909    -3.455731     3.07404
         ev3 |  -1.624954   1.836181    -0.88   0.376    -5.224831    1.974924
         ev4 |  -1.085446   2.613686    -0.42   0.678     -6.20964    4.038748
         ev5 |   2.736436   1.309316     2.09   0.037     .1694911    5.303382
         ev6 |   .4783929   1.266458     0.38   0.706    -2.004529    2.961314
         ev7 |  -2.200616   1.247338    -1.76   0.078    -4.646051    .2448193
         ev8 |   -1.43022    1.29134    -1.11   0.268    -3.961922    1.101482
         ev9 |   -.294878   1.316977    -0.22   0.823    -2.876843    2.287087
        ev10 |  -1.193883   1.247871    -0.96   0.339    -3.640364    1.252598
        ev11 |  -1.085949   1.210154    -0.90   0.370    -3.458484    1.286586
        ev12 |  -2.588128   1.246771    -2.08   0.038    -5.032452   -.1438039
        ev13 |  -.7704662   1.237063    -0.62   0.533    -3.195757    1.654825
        ev14 |   .7940374   1.285069     0.62   0.537    -1.725371    3.313446
        ev15 |    .649608   1.270317     0.51   0.609    -1.840878    3.140094
        ev16 |   .2357881   1.246766     0.19   0.850    -2.208526    2.680102
        ev17 |   .3815307   1.268022     0.30   0.764    -2.104457    2.867518
        ev18 |  -1.895582   1.220191    -1.55   0.120    -4.287797    .4966323
        ev19 |   .5714356   1.256287     0.45   0.649    -1.891544    3.034415
        ev20 |   1.616022   1.276385     1.27   0.206    -.8863617    4.118405
        male |  -.0879261   .0305438    -2.88   0.004     -.147808   -.0280443
       _cons |   .0299205    .021738     1.38   0.169    -.0126974    .0725384
------------------------------------------------------------------------------
(3073 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      4,585
                                                F(22, 4562)       =      26.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1055
                                                Root MSE          =     .94843

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |   .1812749   .0137358    13.20   0.000      .154346    .2082038
         ev1 |  -1.784914   4.565025    -0.39   0.696    -10.73457    7.164744
         ev2 |   .2229274    1.54872     0.14   0.886    -2.813314    3.259169
         ev3 |   .6282471   1.701145     0.37   0.712    -2.706821    3.963316
         ev4 |   3.692336   2.432432     1.52   0.129    -1.076408    8.461081
         ev5 |   3.450681   1.139271     3.03   0.002     1.217159    5.684202
         ev6 |   2.911547   1.135643     2.56   0.010     .6851372    5.137957
         ev7 |   .3786039   1.163904     0.33   0.745    -1.903211    2.660419
         ev8 |   3.792746   1.191921     3.18   0.001     1.456005    6.129488
         ev9 |   2.675738   1.235977     2.16   0.030     .2526246    5.098852
        ev10 |   -.585594   1.131236    -0.52   0.605    -2.803365    1.632177
        ev11 |  -.5935137   1.126064    -0.53   0.598    -2.801143    1.614116
        ev12 |  -.1227128   1.128549    -0.11   0.913    -2.335214    2.089789
        ev13 |  -1.387724    1.13822    -1.22   0.223    -3.619186     .843739
        ev14 |   .0845648   1.143873     0.07   0.941    -2.157979    2.327109
        ev15 |  -2.070288   1.156003    -1.79   0.073    -4.336614    .1960381
        ev16 |   .4701685   1.134853     0.41   0.679    -1.754692    2.695029
        ev17 |   .1713157   1.141006     0.15   0.881    -2.065609     2.40824
        ev18 |  -.2182108   1.127625    -0.19   0.847    -2.428901    1.992479
        ev19 |   -.956292   1.110906    -0.86   0.389    -3.134206    1.221622
        ev20 |   .4362168   1.123605     0.39   0.698    -1.766593    2.639026
        male |  -.5005772    .028211   -17.74   0.000    -.5558845   -.4452699
       _cons |   .2399186   .0189763    12.64   0.000     .2027159    .2771213
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,585
                                                F(22, 4562)       =      18.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0788
                                                Root MSE          =     .96249

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0764006   .0142448     5.36   0.000     .0484738    .1043274
         ev1 |  -3.163008    4.94316    -0.64   0.522      -12.854     6.52798
         ev2 |  -.7802425   1.614994    -0.48   0.629    -3.946413    2.385928
         ev3 |   .7303386   1.808706     0.40   0.686    -2.815601    4.276278
         ev4 |   3.863264    2.57383     1.50   0.133    -1.182688    8.909216
         ev5 |   3.775586   1.161436     3.25   0.001     1.498609    6.052564
         ev6 |   3.364884   1.155054     2.91   0.004     1.100419     5.62935
         ev7 |   1.062265   1.180312     0.90   0.368    -1.251718    3.376249
         ev8 |   3.948714   1.215506     3.25   0.001     1.565735    6.331694
         ev9 |   2.974853   1.265172     2.35   0.019     .4945035    5.455203
        ev10 |     -.1596   1.148119    -0.14   0.889     -2.41047     2.09127
        ev11 |   -.113013   1.136782    -0.10   0.921    -2.341656     2.11563
        ev12 |  -.0624037   1.143991    -0.05   0.957    -2.305179    2.180372
        ev13 |  -.9579093   1.155585    -0.83   0.407    -3.223415    1.307596
        ev14 |  -.1328614   1.164408    -0.11   0.909    -2.415665    2.149943
        ev15 |   -1.99548   1.175669    -1.70   0.090    -4.300361    .3094003
        ev16 |   .4581807   1.157262     0.40   0.692    -1.810612    2.726974
        ev17 |   .0638827   1.156726     0.06   0.956    -2.203861    2.331627
        ev18 |   .5731617   1.145253     0.50   0.617    -1.672088    2.818411
        ev19 |  -.4421887   1.135839    -0.39   0.697    -2.668983    1.784605
        ev20 |    .559262   1.133195     0.49   0.622     -1.66235    2.780874
        male |   -.500573   .0286332   -17.48   0.000    -.5567079   -.4444381
       _cons |   .2393001    .019186    12.47   0.000     .2016863    .2769139
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,585
                                                F(23, 4561)       =      31.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1292
                                                Root MSE          =     .93589

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .1664222   .0148066    11.24   0.000     .1373941    .1954503
    zCOG_PGS |   .2430961   .0145372    16.72   0.000     .2145961    .2715961
         ev1 |  -.5040294   4.822603    -0.10   0.917    -9.958666    8.950607
         ev2 |   1.642826   1.580216     1.04   0.299    -1.455162    4.740814
         ev3 |   1.544088   1.750109     0.88   0.378    -1.886973    4.975149
         ev4 |   4.494491   2.436406     1.84   0.065    -.2820443    9.271026
         ev5 |   2.536488   1.128495     2.25   0.025     .3240918    4.748885
         ev6 |   1.935839   1.124806     1.72   0.085    -.2693256    4.141004
         ev7 |   .5851015   1.146344     0.51   0.610    -1.662287     2.83249
         ev8 |    3.60367   1.175844     3.06   0.002     1.298446    5.908893
         ev9 |   2.392359   1.220497     1.96   0.050    -.0004055    4.785124
        ev10 |  -.2622027   1.112882    -0.24   0.814     -2.44399    1.919585
        ev11 |  -.6540326   1.109116    -0.59   0.555    -2.828436    1.520371
        ev12 |   .3785766   1.112488     0.34   0.734    -1.802438    2.559591
        ev13 |  -1.348463   1.128412    -1.20   0.232    -3.560696    .8637702
        ev14 |   .2748858   1.128859     0.24   0.808    -1.938225    2.487996
        ev15 |  -1.803843   1.141183    -1.58   0.114    -4.041115    .4334287
        ev16 |    .702578   1.126578     0.62   0.533    -1.506061    2.911217
        ev17 |   .0917316   1.126894     0.08   0.935    -2.117527     2.30099
        ev18 |  -.0673105   1.112794    -0.06   0.952    -2.248925    2.114304
        ev19 |  -.6384891   1.099965    -0.58   0.562    -2.794954    1.517976
        ev20 |   .2425769    1.10719     0.22   0.827    -1.928051    2.413205
        male |  -.4945656   .0278623   -17.75   0.000    -.5491893   -.4399419
       _cons |   .2374786   .0186513    12.73   0.000      .200913    .2740442
------------------------------------------------------------------------------
(922 missing values generated)
(2112 missing values generated)
(2112 missing values generated)

Linear regression                               Number of obs     =      5,027
                                                F(22, 5004)       =       6.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0273
                                                Root MSE          =     .98884

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    zCOG_PGS |   .1401476   .0137699    10.18   0.000     .1131525    .1671427
         ev1 |   1.388486   4.819501     0.29   0.773    -8.059848    10.83682
         ev2 |  -3.756863   1.580699    -2.38   0.018    -6.855726       -.658
         ev3 |   .7337748   1.756346     0.42   0.676    -2.709434    4.176983
         ev4 |   1.013424   2.315832     0.44   0.662    -3.526622     5.55347
         ev5 |   .6369632   1.127066     0.57   0.572    -1.572581    2.846507
         ev6 |   1.901671   1.094716     1.74   0.082     -.244452    4.047794
         ev7 |  -1.212393   1.174028    -1.03   0.302    -3.514002    1.089216
         ev8 |   1.009201   1.221166     0.83   0.409    -1.384819    3.403221
         ev9 |   2.034707   1.228156     1.66   0.098    -.3730159     4.44243
        ev10 |  -.8034736    1.11541    -0.72   0.471    -2.990167     1.38322
        ev11 |  -1.468666   1.134333    -1.29   0.195    -3.692456    .7551233
        ev12 |   .5046332   1.127694     0.45   0.655    -1.706142    2.715408
        ev13 |  -1.017498      1.138    -0.89   0.371    -3.248477    1.213481
        ev14 |   .6165989    1.13497     0.54   0.587     -1.60844    2.841638
        ev15 |  -.3613805   1.147043    -0.32   0.753    -2.610088    1.887327
        ev16 |  -1.943023   1.150862    -1.69   0.091    -4.199218    .3131714
        ev17 |   2.149279   1.157284     1.86   0.063    -.1195044    4.418062
        ev18 |   -.971992   1.141198    -0.85   0.394     -3.20924    1.265256
        ev19 |  -2.011207   1.122133    -1.79   0.073    -4.211079    .1886653
        ev20 |  -.0529294   1.133158    -0.05   0.963    -2.274416    2.168557
        male |   .0312661    .028095     1.11   0.266    -.0238123    .0863445
       _cons |  -.0260903   .0188478    -1.38   0.166    -.0630403    .0108597
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,027
                                                F(22, 5004)       =       2.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0111
                                                Root MSE          =     .99701

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .0560974   .0142542     3.94   0.000      .028153    .0840418
         ev1 |    .346681   5.242985     0.07   0.947    -9.931866    10.62523
         ev2 |  -4.409706   1.661452    -2.65   0.008    -7.666881   -1.152532
         ev3 |   .9616569   1.859746     0.52   0.605     -2.68426    4.607574
         ev4 |   1.211465   2.424773     0.50   0.617    -3.542153    5.965082
         ev5 |   .8967762   1.137762     0.79   0.431    -1.333735    3.127288
         ev6 |   2.415192   1.099863     2.20   0.028     .2589795    4.571405
         ev7 |  -.7457679   1.190401    -0.63   0.531    -3.079476     1.58794
         ev8 |   1.259553   1.231843     1.02   0.307      -1.1554    3.674505
         ev9 |   2.235065    1.24607     1.79   0.073    -.2077787    4.677909
        ev10 |  -.4686673   1.128133    -0.42   0.678    -2.680303    1.742969
        ev11 |  -1.179594   1.142946    -1.03   0.302     -3.42027    1.061082
        ev12 |   .4528835   1.139833     0.40   0.691    -1.781689    2.687456
        ev13 |  -.7257128   1.150699    -0.63   0.528    -2.981587    1.530161
        ev14 |   .6028293   1.147554     0.53   0.599     -1.64688    2.852539
        ev15 |  -.3322241    1.15392    -0.29   0.773    -2.594413    1.929965
        ev16 |  -1.878821   1.160065    -1.62   0.105    -4.153056    .3954146
        ev17 |   2.061946   1.160514     1.78   0.076    -.2131689    4.337062
        ev18 |  -.3432892   1.154184    -0.30   0.766    -2.605996    1.919418
        ev19 |  -1.749773   1.140285    -1.53   0.125    -3.985232    .4856853
        ev20 |  -.2653272   1.148878    -0.23   0.817    -2.517631    1.986977
        male |    .031234   .0283335     1.10   0.270    -.0243122    .0867801
       _cons |  -.0264322   .0189882    -1.39   0.164    -.0636573    .0107929
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,027
                                                F(23, 5003)       =       9.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0408
                                                Root MSE          =     .98205

------------------------------------------------------------------------------
             |               Robust
           Y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 zNONCOG_PGS |   .1265013   .0152511     8.29   0.000     .0966024    .1564002
    zCOG_PGS |   .1877191   .0147468    12.73   0.000     .1588088    .2166294
         ev1 |    2.31484   4.962832     0.47   0.641    -7.414486    12.04417
         ev2 |  -2.712268   1.614529    -1.68   0.093    -5.877453    .4529167
         ev3 |   1.376406   1.788071     0.77   0.441    -2.128996    4.881808
         ev4 |    1.76918   2.374405     0.75   0.456    -2.885693    6.424054
         ev5 |  -.0142067   1.119401    -0.01   0.990    -2.208724    2.180311
         ev6 |   1.167838   1.092044     1.07   0.285    -.9730467    3.308724
         ev7 |  -.9403244   1.167002    -0.81   0.420     -3.22816    1.347511
         ev8 |   .8901025   1.212072     0.73   0.463    -1.486089    3.266294
         ev9 |   1.785155   1.219166     1.46   0.143     -.604945    4.175255
        ev10 |  -.6226919   1.106359    -0.56   0.574     -2.79164    1.546256
        ev11 |  -1.484951   1.126266    -1.32   0.187    -3.692926    .7230244
        ev12 |   .8076541   1.122181     0.72   0.472    -1.392313    3.007621
        ev13 |  -.8840465   1.134861    -0.78   0.436    -3.108872    1.340779
        ev14 |   .6736954   1.130496     0.60   0.551    -1.542572    2.889962
        ev15 |  -.1927288   1.137257    -0.17   0.865    -2.422251    2.036794
        ev16 |  -1.710842   1.149389    -1.49   0.137    -3.964149    .5424644
        ev17 |   2.104224   1.146494     1.84   0.067    -.1434069    4.351855
        ev18 |  -.7908447   1.134333    -0.70   0.486    -3.014634    1.432945
        ev19 |  -1.794851   1.117745    -1.61   0.108    -3.986122    .3964186
        ev20 |  -.2597071   1.130373    -0.23   0.818    -2.475733    1.956319
        male |   .0339424   .0279052     1.22   0.224    -.0207639    .0886488
       _cons |  -.0277711   .0187139    -1.48   0.138    -.0644585    .0089163
------------------------------------------------------------------------------
. 
. matrix mvFX = mvFX[2...,1...]
. matrix colnames mvFX = N Beta_nc SE_nc DeltaR2_nc Pval_nc SqrtDeltaR2_nc Beta_c SE_
> c DeltaR2_c Pval_c SqrtDeltaR2_c
. matrix list mvFX

mvFX[10,11]
                       N       Beta_nc         SE_nc    DeltaR2_nc       Pval_nc
  eduyears          5171     .17227784     .01415131     .02552769     1.236e-33
        iq          4882     .13020752     .01510463     .01453893     8.909e-18
     extra          5295    -.01478647     .01486706     .00018285      .3199868
     openn          5349     .06828435     .01450413     .00388237     2.566e-06
     neuro          5308    -.04868918     .01493497     .00198223     .00112087
     consc          5364    -.03850534     .01443792     .00126297     .00767719
     agree          5355     .01333644     .01468466     .00015207      .3638196
attractive          4262     .01772491     .01631073     .00026702     .27722993
gpa_hsrank          4585     .16642219      .0148066     .02370075     6.226e-29
   cog_sim          5027     .12650132     .01525115     .01349821     1.387e-16

            SqrtDeltaR~c        Beta_c          SE_c     DeltaR2_c        Pval_c
  eduyears     .15977387     .19677372     .01437434     .03346563     6.338e-42
        iq     .12057748     .32194928     .01468648     .08862952     1.19e-101
     extra     .01352202    -.02016991     .01490686     .00034706     .17609367
     openn     .06230868     .08421819     .01440501     .00599874     5.320e-09
     neuro     .04452225    -.02909359      .0148491     .00071768     .05013222
     consc     .03553828    -.02417833      .0145866      .0005049     .09746282
     agree     .01233148    -.01377866     .01451291     .00016447     .34245675
attractive     .01634075     .00864782     .01670541     .00006238     .60471855
gpa_hsrank     .15395047     .24309609     .01453723     .05041249     5.709e-61
   cog_sim     .11618179     .18771907     .01474685     .02964419     1.489e-36

            SqrtDeltaR~c
  eduyears     .18293614
        iq     .29770711
     extra     .01862946
     openn     .07745156
     neuro     .02678948
     consc     .02246997
     agree     .01282454
attractive     .00789823
gpa_hsrank     .22452726
   cog_sim     .17217489
. 
. putexcel set "${DIRCODE}/output/CogNonCog_WLS.xlsx", sheet(WLSMultivar) modify
. putexcel a1 = matrix(mvFX), names
file /Users/michellerosenberger/Development/GEIGHEI/WLSanalysis/WLS/output/CogNonCog_
> WLS.xlsx saved
. 
. 
. 
. 
. *--------------Regressions
. foreach yvar in eduyears iq extra openn neuro consc agree attractive {
  2.         des `yvar'
  3.         sum `yvar'
  4.         
.         reg `yvar' COG_PGS            yob yob2 male ev1-ev20, cluster(familypriv)
  5.         estimate store cog_`yvar'
  6.         
.         reg `yvar'         NONCOG_PGS yob yob2 male ev1-ev20, cluster(familypriv)
  7.         estimate store noncog_`yvar'
  8. 
.         reg `yvar' COG_PGS NONCOG_PGS yob yob2 male ev1-ev20, cluster(familypriv)
  9.         estimate store both_`yvar'
 10. } //end forloop yvar

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
eduyears        byte    %8.0g      EDEQYR   * R3 equivalent years of regular
                                                education

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    eduyears |      5,940     13.5537    2.262302          8         20

Linear regression                               Number of obs     =      5,171
                                                F(23, 5164)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0869
                                                Root MSE          =     2.1538

                         (Std. Err. adjusted for 5,165 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
    eduyears |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .3034941   .0308023     9.85   0.000     .2431086    .3638797
         yob |   16.17208   12.04826     1.34   0.180    -7.447608    39.79177
        yob2 |  -.0041503   .0031033    -1.34   0.181    -.0102341    .0019336
        male |   .8905554    .061083    14.58   0.000     .7708068    1.010304
         ev1 |   9.230748   10.24193     0.90   0.367    -10.84777    29.30926
         ev2 |  -14.26702   3.250363    -4.39   0.000    -20.63911    -7.89493
         ev3 |  -5.999654   3.725062    -1.61   0.107    -13.30235    1.303044
         ev4 |   .4713158   4.907873     0.10   0.923    -9.150194    10.09283
         ev5 |   10.53718   2.481966     4.25   0.000     5.671477    15.40288
         ev6 |   18.31913   2.418029     7.58   0.000     13.57877    23.05949
         ev7 |  -3.345594   2.466335    -1.36   0.175    -8.180656    1.489468
         ev8 |   4.812432   2.606972     1.85   0.065    -.2983359    9.923201
         ev9 |   4.581855   2.636669     1.74   0.082    -.5871324    9.750842
        ev10 |   1.216828   2.386721     0.51   0.610    -3.462156    5.895811
        ev11 |  -1.583943   2.433887    -0.65   0.515    -6.355392    3.187505
        ev12 |  -3.384645   2.420993    -1.40   0.162    -8.130816    1.361525
        ev13 |  -1.148502   2.508895    -0.46   0.647    -6.066999    3.769996
        ev14 |   3.161019   2.439984     1.30   0.195    -1.622384    7.944421
        ev15 |  -2.674487   2.451823    -1.09   0.275    -7.481098    2.132125
        ev16 |  -.1713747    2.38986    -0.07   0.943    -4.856512    4.513763
        ev17 |    3.91705    2.44197     1.60   0.109    -.8702451    8.704344
        ev18 |  -3.882736   2.390384    -1.62   0.104    -8.568901    .8034285
        ev19 |  -.4097573   2.447325    -0.17   0.867    -5.207551    4.388036
        ev20 |   .0751065   2.431327     0.03   0.975    -4.691323    4.841536
       _cons |  -15740.68   11694.03    -1.35   0.178    -38665.93    7184.574
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,171
                                                F(24, 5164)       =      19.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0788
                                                Root MSE          =     2.1633

                         (Std. Err. adjusted for 5,165 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
    eduyears |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   .2218907   .0300067     7.39   0.000      .163065    .2807165
         yob |   14.06804   11.93023     1.18   0.238    -9.320255    37.45634
        yob2 |  -.0036077   .0030729    -1.17   0.240    -.0096319    .0024166
        male |   .8910977   .0613491    14.53   0.000     .7708274    1.011368
         ev1 |   7.069814   9.902793     0.71   0.475    -12.34385    26.48348
         ev2 |  -15.05173   3.227628    -4.66   0.000    -21.37925    -8.72421
         ev3 |  -5.395527   3.667255    -1.47   0.141     -12.5849    1.793846
         ev4 |   .8499276   4.907485     0.17   0.863    -8.770822    10.47068
         ev5 |    10.6625   2.506777     4.25   0.000     5.748154    15.57684
         ev6 |   18.77755   2.432403     7.72   0.000     14.00901    23.54609
         ev7 |  -2.202474   2.473163    -0.89   0.373     -7.05092    2.645972
         ev8 |   4.928795   2.612212     1.89   0.059    -.1922472    10.04984
         ev9 |    4.84803   2.637641     1.84   0.066    -.3228636    10.01892
        ev10 |   2.298204   2.391671     0.96   0.337    -2.390485    6.986893
        ev11 |  -.9611389   2.447913    -0.39   0.695    -5.760085    3.837807
        ev12 |  -3.012885   2.425392    -1.24   0.214    -7.767681    1.741911
        ev13 |  -.4517286   2.515663    -0.18   0.858    -5.383494    4.480037
        ev14 |   3.092176   2.457563     1.26   0.208    -1.725688     7.91004
        ev15 |  -2.448901   2.468655    -0.99   0.321    -7.288512    2.390709
        ev16 |   .0478242   2.392066     0.02   0.984    -4.641638    4.737286
        ev17 |    3.57509   2.453924     1.46   0.145     -1.23564     8.38582
        ev18 |  -2.660144    2.39526    -1.11   0.267    -7.355867    2.035579
        ev19 |   .4380523   2.481208     0.18   0.860    -4.426165     5.30227
        ev20 |  -.1761349   2.433626    -0.07   0.942    -4.947072    4.594802
       _cons |     -13701   11579.44    -1.18   0.237     -36401.6    8999.607
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,171
                                                F(25, 5164)       =      26.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1120
                                                Root MSE          =     2.1241

                         (Std. Err. adjusted for 5,165 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
    eduyears |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .4470517   .0326107    13.71   0.000     .3831209    .5109825
  NONCOG_PGS |   .3858991   .0318578    12.11   0.000     .3234444    .4483538
         yob |   14.71425   11.72042     1.26   0.209    -8.262724    37.69123
        yob2 |  -.0037752   .0030189    -1.25   0.211    -.0096935    .0021431
        male |   .8987434   .0602769    14.91   0.000      .780575    1.016912
         ev1 |   12.06381   10.37086     1.16   0.245    -8.267477    32.39509
         ev2 |  -11.01235   3.288229    -3.35   0.001    -17.45867   -4.566031
         ev3 |  -4.027045   3.752624    -1.07   0.283    -11.38378    3.329688
         ev4 |   2.016716   5.012321     0.40   0.687    -7.809554    11.84299
         ev5 |   8.434613   2.466381     3.42   0.001     3.599462    13.26976
         ev6 |   16.21539   2.407264     6.74   0.000     11.49613    20.93464
         ev7 |  -2.848872   2.433567    -1.17   0.242    -7.619693    1.921949
         ev8 |   4.453399   2.588058     1.72   0.085    -.6202908    9.527088
         ev9 |   3.882977   2.589944     1.50   0.134     -1.19441    8.960365
        ev10 |   1.846266   2.345032     0.79   0.431     -2.75099    6.443522
        ev11 |  -1.561241   2.406713    -0.65   0.517    -6.279417    3.156935
        ev12 |  -2.267619   2.389023    -0.95   0.343    -6.951116    2.415878
        ev13 |  -.9443832   2.485952    -0.38   0.704    -5.817903    3.929136
        ev14 |   3.466865   2.414713     1.44   0.151    -1.266994    8.200725
        ev15 |  -2.098963   2.413669    -0.87   0.385    -6.830776    2.632849
        ev16 |   .3859934   2.348804     0.16   0.869    -4.218657    4.990644
        ev17 |   3.628687    2.41604     1.50   0.133    -1.107775    8.365148
        ev18 |  -3.482796   2.364163    -1.47   0.141    -8.117556    1.151964
        ev19 |   .2888217   2.424774     0.12   0.905    -4.464763    5.042406
        ev20 |  -.4613682   2.400915    -0.19   0.848    -5.168177    4.245441
       _cons |  -14324.07   11375.72    -1.26   0.208     -36625.3    7977.161
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
iq              float   %8.0g               * RA bst msure iq scre mppd frm raw
                                                hnmn-nlsn

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          iq |      5,023   -3.56e-09           1  -2.851233   2.921031

Linear regression                               Number of obs     =      4,882
                                                F(23, 4879)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1283
                                                Root MSE          =     .93461

                         (Std. Err. adjusted for 4,880 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
          iq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .2596409   .0134855    19.25   0.000     .2332033    .2860785
         yob |  -87.58096   78.57964    -1.11   0.265    -241.6324    66.47052
        yob2 |   .0226886    .020269     1.12   0.263    -.0170478     .062425
        male |   .0352096   .0271815     1.30   0.195    -.0180783    .0884975
         ev1 |  -5.226807   4.067955    -1.28   0.199    -13.20183    2.748216
         ev2 |  -3.551065   1.393328    -2.55   0.011    -6.282616    -.819515
         ev3 |  -.3744688   1.581301    -0.24   0.813     -3.47453    2.725592
         ev4 |   .4953819   2.115574     0.23   0.815    -3.652095    4.642859
         ev5 |  -.6061882   1.106964    -0.55   0.584    -2.776336    1.563959
         ev6 |   6.145144   1.050432     5.85   0.000     4.085823    8.204464
         ev7 |   -.482122   1.107422    -0.44   0.663    -2.653167    1.688923
         ev8 |   3.041643   1.131559     2.69   0.007      .823277    5.260009
         ev9 |   1.528765   1.207104     1.27   0.205    -.8377028    3.895232
        ev10 |  -1.189051    1.07913    -1.10   0.271    -3.304632    .9265304
        ev11 |   -.407737   1.051217    -0.39   0.698    -2.468596    1.653122
        ev12 |  -.4594259   1.092167    -0.42   0.674    -2.600565    1.681713
        ev13 |  -3.353397   1.096881    -3.06   0.002    -5.503778   -1.203015
        ev14 |   1.047563   1.087733     0.96   0.336    -1.084883    3.180009
        ev15 |  -1.401888   1.107416    -1.27   0.206    -3.572922    .7691455
        ev16 |     1.2664   1.080378     1.17   0.241    -.8516271    3.384427
        ev17 |  -1.650798   1.070019    -1.54   0.123    -3.748518    .4469216
        ev18 |  -.4782269   1.073506    -0.45   0.656    -2.582782    1.626328
        ev19 |  -1.137326   1.077819    -1.06   0.291    -3.250337    .9756849
        ev20 |  -.6483526   1.089898    -0.59   0.552    -2.785043    1.488338
       _cons |   84516.73   76208.81     1.11   0.267    -64886.86    233920.3
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,882
                                                F(22, 4879)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0630
                                                Root MSE          =       .969

                         (Std. Err. adjusted for 4,880 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
          iq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   .0121986   .0140841     0.87   0.386    -.0154126    .0398097
         yob |  -94.75191   85.95922    -1.10   0.270    -263.2707    73.76687
        yob2 |   .0245488   .0222133     1.11   0.269    -.0189994    .0680969
        male |   .0357611   .0282148     1.27   0.205    -.0195525    .0910748
         ev1 |  -7.244048   4.430601    -1.64   0.102    -15.93002    1.441925
         ev2 |  -5.316817   1.470333    -3.62   0.000    -8.199331   -2.434302
         ev3 |  -.4808208   1.694078    -0.28   0.777    -3.801976    2.840335
         ev4 |   .4844082     2.3453     0.21   0.836    -4.113436    5.082253
         ev5 |   .1371173   1.163224     0.12   0.906    -2.143326    2.417561
         ev6 |    7.22826   1.095819     6.60   0.000     5.079961    9.376559
         ev7 |   .1844454    1.16804     0.16   0.875    -2.105438    2.474329
         ev8 |   3.297394   1.177912     2.80   0.005     .9881561    5.606631
         ev9 |   2.005949   1.259619     1.59   0.111    -.4634715     4.47537
        ev10 |  -.7201417    1.11787    -0.64   0.519     -2.91167    1.471386
        ev11 |   .1398135   1.088574     0.13   0.898    -1.994281    2.273908
        ev12 |  -.6794514    1.13771    -0.60   0.550    -2.909875    1.550972
        ev13 |  -2.940806   1.136726    -2.59   0.010      -5.1693   -.7123118
        ev14 |   .7986582   1.131731     0.71   0.480    -1.420045    3.017361
        ev15 |  -1.667158   1.146887    -1.45   0.146    -3.915573    .5812563
        ev16 |   1.072347   1.122824     0.96   0.340    -1.128894    3.273587
        ev17 |  -1.769081   1.106138    -1.60   0.110    -3.937609    .3994473
        ev18 |   .2812928   1.113603     0.25   0.801    -1.901871    2.464457
        ev19 |   -.723063   1.113964    -0.65   0.516    -2.906934    1.460808
        ev20 |   -.554656   1.111235    -0.50   0.618    -2.733176    1.623864
       _cons |    91427.4   83317.47     1.10   0.273    -71912.35    254767.2
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,882
                                                F(24, 4879)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1417
                                                Root MSE          =      .9275

                         (Std. Err. adjusted for 4,880 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
          iq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .3067138   .0146038    21.00   0.000     .2780838    .3353438
  NONCOG_PGS |    .124749   .0147581     8.45   0.000     .0958164    .1536816
         yob |  -76.96909   76.45495    -1.01   0.314    -226.8552    72.91704
        yob2 |   .0199499   .0196644     1.01   0.310     -.018601    .0585009
        male |    .037884   .0269839     1.40   0.160    -.0150167    .0907847
         ev1 |  -4.286685    4.16222    -1.03   0.303    -12.44651    3.873139
         ev2 |  -2.465899   1.409374    -1.75   0.080    -5.228906    .2971079
         ev3 |   .2453808   1.596688     0.15   0.878    -2.884846    3.375608
         ev4 |    1.04182   2.114763     0.49   0.622    -3.104067    5.187707
         ev5 |  -1.266769   1.101559    -1.15   0.250     -3.42632    .8927825
         ev6 |   5.451456   1.051691     5.18   0.000     3.389668    7.513244
         ev7 |  -.3411607   1.100284    -0.31   0.757    -2.498213    1.815891
         ev8 |   2.964271   1.123902     2.64   0.008     .7609177    5.167625
         ev9 |   1.300633   1.198793     1.08   0.278    -1.049542    3.650807
        ev10 |  -.9655542   1.069612    -0.90   0.367    -3.062476    1.131367
        ev11 |  -.4659694    1.04273    -0.45   0.655    -2.510189     1.57825
        ev12 |  -.0860692   1.085779    -0.08   0.937    -2.214686    2.042547
        ev13 |  -3.344781   1.093078    -3.06   0.002    -5.487707   -1.201856
        ev14 |   1.168171    1.07917     1.08   0.279    -.9474872     3.28383
        ev15 |  -1.206283   1.097423    -1.10   0.272    -3.357727    .9451617
        ev16 |   1.414745   1.076935     1.31   0.189    -.6965332    3.526023
        ev17 |  -1.744377   1.063876    -1.64   0.101    -3.830053    .3412978
        ev18 |  -.3543105   1.067747    -0.33   0.740    -2.447575    1.738954
        ev19 |  -.9102304   1.073425    -0.85   0.396    -3.014627    1.194166
        ev20 |  -.8141373   1.081162    -0.75   0.451    -2.933701    1.305427
       _cons |   74236.85   73976.37     1.00   0.316    -70790.16    219263.9
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
extra           byte    %8.0g      QQJUSTMISSING
                                            * R4 total score for extraversion

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       extra |      7,023    8.498932    2.628789          2         12

Linear regression                               Number of obs     =      5,295
                                                F(23, 5281)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0188
                                                Root MSE          =     2.6156

                         (Std. Err. adjusted for 5,282 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       extra |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   -.038644   .0363186    -1.06   0.287    -.1098434    .0325554
         yob |  -2.850744   5.000166    -0.57   0.569    -12.65313    6.951648
        yob2 |   .0007362   .0012881     0.57   0.568    -.0017891    .0032615
        male |  -.5736899   .0722454    -7.94   0.000    -.7153207   -.4320591
         ev1 |   16.81344   12.05838     1.39   0.163    -6.825964    40.45284
         ev2 |   1.997595   3.982581     0.50   0.616     -5.80991      9.8051
         ev3 |  -5.374514    4.45651    -1.21   0.228    -14.11112    3.362088
         ev4 |   3.798751   5.949173     0.64   0.523    -7.864086    15.46159
         ev5 |  -2.844548   2.968682    -0.96   0.338    -8.664392    2.975296
         ev6 |   2.166426   2.909351     0.74   0.457    -3.537104    7.869956
         ev7 |   -7.65088   2.870185    -2.67   0.008    -13.27763   -2.024132
         ev8 |  -.1299913    3.01967    -0.04   0.966    -6.049792     5.78981
         ev9 |  -2.092978   3.130361    -0.67   0.504    -8.229779    4.043823
        ev10 |   7.468016    2.94201     2.54   0.011      1.70046    13.23557
        ev11 |  -.8022373   2.902296    -0.28   0.782    -6.491937    4.887462
        ev12 |   -4.20404   2.950881    -1.42   0.154    -9.988986    1.580907
        ev13 |   1.075386   2.923481     0.37   0.713    -4.655844    6.806617
        ev14 |   1.666521   2.969143     0.56   0.575    -4.154226    7.487268
        ev15 |   2.962208    2.91732     1.02   0.310    -2.756945    8.681361
        ev16 |  -3.468378   2.908094    -1.19   0.233    -9.169445    2.232689
        ev17 |   3.309995   2.941566     1.13   0.261    -2.456689    9.076679
        ev18 |   1.552498   2.948379     0.53   0.599    -4.227543     7.33254
        ev19 |   2.577675   2.897836     0.89   0.374     -3.10328     8.25863
        ev20 |  -2.547332   2.912939    -0.87   0.382    -8.257896    3.163233
       _cons |   2768.553   4852.186     0.57   0.568    -6743.738    12280.84
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,295
                                                F(24, 5281)       =       4.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0187
                                                Root MSE          =     2.6158

                         (Std. Err. adjusted for 5,282 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       extra |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   -.018833   .0359026    -0.52   0.600    -.0892169    .0515509
         yob |   -2.90643   5.002306    -0.58   0.561    -12.71302    6.900157
        yob2 |   .0007506   .0012887     0.58   0.560    -.0017759     .003277
        male |  -.5733484    .072254    -7.94   0.000     -.714996   -.4317007
         ev1 |   17.04811   11.99421     1.42   0.155    -6.465499    40.56172
         ev2 |   2.162342   3.961274     0.55   0.585    -5.603391    9.928076
         ev3 |  -5.454135   4.440577    -1.23   0.219     -14.1595    3.251232
         ev4 |   3.717803   5.947716     0.63   0.532    -7.942179    15.37778
         ev5 |  -2.891096    2.97429    -0.97   0.331    -8.721934    2.939741
         ev6 |    2.05135   2.898578     0.71   0.479    -3.631061    7.733761
         ev7 |  -7.814674   2.869691    -2.72   0.006    -13.44046   -2.188893
         ev8 |  -.1977719   3.018441    -0.07   0.948    -6.115163    5.719619
         ev9 |  -2.140621     3.1322    -0.68   0.494    -8.281027    3.999786
        ev10 |   7.374423   2.941055     2.51   0.012     1.608739    13.14011
        ev11 |  -.8812682   2.901614    -0.30   0.761     -6.56963    4.807094
        ev12 |  -4.224448   2.953462    -1.43   0.153    -10.01445    1.565558
        ev13 |   1.007541   2.921976     0.34   0.730     -4.72074    6.735822
        ev14 |    1.68191   2.968266     0.57   0.571    -4.137119    7.500938
        ev15 |   2.922915   2.917225     1.00   0.316    -2.796051    8.641881
        ev16 |  -3.470609    2.90843    -1.19   0.233    -9.172333    2.231115
        ev17 |    3.34554   2.942643     1.14   0.256    -2.423256    9.114336
        ev18 |   1.436582   2.949433     0.49   0.626    -4.345525     7.21869
        ev19 |   2.508068   2.896148     0.87   0.387     -3.16958    8.185716
        ev20 |    -2.5218   2.912127    -0.87   0.387    -8.230773    3.187173
       _cons |   2822.531   4854.376     0.58   0.561    -6694.053    12339.11
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,295
                                                F(24, 5281)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0190
                                                Root MSE          =     2.6156

                         (Std. Err. adjusted for 5,282 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       extra |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0532134   .0394541    -1.35   0.177    -.1305597    .0241329
  NONCOG_PGS |  -.0388203    .039034    -0.99   0.320    -.1153431    .0377026
         yob |  -2.820091   5.000061    -0.56   0.573    -12.62228    6.982095
        yob2 |   .0007283   .0012881     0.57   0.572     -.001797    .0032536
        male |  -.5737356   .0722437    -7.94   0.000    -.7153632    -.432108
         ev1 |   16.46624   12.07356     1.36   0.173     -7.20293    40.13541
         ev2 |   1.666205   3.989825     0.42   0.676      -6.1555    9.487911
         ev3 |  -5.578024   4.461219    -1.25   0.211    -14.32386    3.167809
         ev4 |   3.567056   5.956451     0.60   0.549    -8.110049    15.24416
         ev5 |  -2.628368   2.974975    -0.88   0.377    -8.460549    3.203812
         ev6 |   2.378016   2.912533     0.82   0.414    -3.331753    8.087785
         ev7 |  -7.720248   2.870252    -2.69   0.007    -13.34713   -2.093368
         ev8 |  -.1293968   3.019206    -0.04   0.966    -6.048288    5.789495
         ev9 |  -2.026983   3.128383    -0.65   0.517    -8.159908    4.105941
        ev10 |    7.41485   2.942052     2.52   0.012     1.647213    13.18249
        ev11 |  -.7898515   2.901614    -0.27   0.785    -6.478214    4.898511
        ev12 |   -4.31184   2.949797    -1.46   0.144    -10.09466    1.470981
        ev13 |   1.049352   2.922375     0.36   0.720    -4.679711    6.778415
        ev14 |   1.638131    2.96838     0.55   0.581     -4.18112    7.457382
        ev15 |   2.922548   2.918226     1.00   0.317    -2.798381    8.643477
        ev16 |  -3.535327   2.906458    -1.22   0.224    -9.233186    2.162533
        ev17 |   3.334704   2.941256     1.13   0.257    -2.431374    9.100782
        ev18 |   1.517941   2.949714     0.51   0.607    -4.264718    7.300599
        ev19 |   2.510959   2.898127     0.87   0.386    -3.170568    8.192486
        ev20 |  -2.505757   2.912776    -0.86   0.390    -8.216002    3.204489
       _cons |   2738.692   4852.001     0.56   0.572    -6773.235    12250.62
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
openn           byte    %8.0g      QQJUSTMISSING
                                            * R4 total score for openness

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       openn |      7,105    9.285151    2.462794          2         12

Linear regression                               Number of obs     =      5,349
                                                F(23, 5334)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0373
                                                Root MSE          =     2.4328

                         (Std. Err. adjusted for 5,335 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       openn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .1455983   .0327784     4.44   0.000     .0813392    .2098573
         yob |   8.383527   5.039242     1.66   0.096    -1.495448     18.2625
        yob2 |  -.0021515   .0012976    -1.66   0.097    -.0046954    .0003924
        male |    .816512   .0664202    12.29   0.000     .6863012    .9467228
         ev1 |   19.61372   11.13953     1.76   0.078    -2.224314    41.45175
         ev2 |    6.25207   3.703975     1.69   0.091    -1.009235    13.51337
         ev3 |    7.23966   4.229979     1.71   0.087    -1.052827    15.53215
         ev4 |   12.17385   6.731224     1.81   0.071    -1.022099     25.3698
         ev5 |   4.117815   2.776095     1.48   0.138    -1.324466    9.560096
         ev6 |   6.325698   2.743922     2.31   0.021     .9464895    11.70491
         ev7 |  -3.812561   2.689555    -1.42   0.156    -9.085189    1.460067
         ev8 |   3.977099   2.721103     1.46   0.144    -1.357376    9.311574
         ev9 |   1.500255   2.897316     0.52   0.605    -4.179668    7.180178
        ev10 |   6.298004   2.759996     2.28   0.023     .8872845    11.70872
        ev11 |    2.99041    2.67655     1.12   0.264    -2.256722    8.237542
        ev12 |  -2.424562    2.70151    -0.90   0.370    -7.720626    2.871502
        ev13 |  -1.778094   2.692697    -0.66   0.509     -7.05688    3.500692
        ev14 |  -.1367309    2.71535    -0.05   0.960    -5.459927    5.186466
        ev15 |  -.2366225   2.679688    -0.09   0.930    -5.489907    5.016662
        ev16 |  -2.376687   2.782181    -0.85   0.393    -7.830899    3.077525
        ev17 |    4.68381   2.690248     1.74   0.082    -.5901763    9.957797
        ev18 |  -1.115611   2.651416    -0.42   0.674     -6.31347    4.082248
        ev19 |  -2.413713    2.68537    -0.90   0.369    -7.678137    2.850711
        ev20 |   .9095039   2.650653     0.34   0.732    -4.286859    6.105867
       _cons |  -8157.721    4892.51    -1.67   0.095    -17749.04    1433.598
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,349
                                                F(23, 5334)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0352
                                                Root MSE          =     2.4354

                         (Std. Err. adjusted for 5,335 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       openn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   .0885247   .0327595     2.70   0.007     .0243027    .1527467
         yob |   8.540597   5.069112     1.68   0.092    -1.396934    18.47813
        yob2 |  -.0021921   .0013053    -1.68   0.093    -.0047509    .0003667
        male |   .8153307   .0664982    12.26   0.000      .684967    .9456944
         ev1 |   18.84319   11.16131     1.69   0.091    -3.037539    40.72392
         ev2 |   5.848945   3.708029     1.58   0.115    -1.420307     13.1182
         ev3 |   7.620042   4.243029     1.80   0.073    -.6980291    15.93811
         ev4 |   12.57325   6.730382     1.87   0.062    -.6210541    25.76755
         ev5 |   4.206198   2.796113     1.50   0.133    -1.275326    9.687723
         ev6 |   6.686732   2.756812     2.43   0.015     1.282253    12.09121
         ev7 |  -3.146407   2.696566    -1.17   0.243    -8.432778    2.139964
         ev8 |   4.253047   2.723798     1.56   0.118    -1.086711    9.592805
         ev9 |   1.709124   2.904596     0.59   0.556    -3.985072    7.403319
        ev10 |   6.719354   2.761614     2.43   0.015     1.305462    12.13325
        ev11 |    3.27827   2.680972     1.22   0.221    -1.977531    8.534072
        ev12 |  -2.244898   2.703202    -0.83   0.406    -7.544278    3.054483
        ev13 |  -1.545503   2.697707    -0.57   0.567    -6.834112    3.743106
        ev14 |   -.139759   2.721404    -0.05   0.959    -5.474824    5.195306
        ev15 |  -.0830669   2.683202    -0.03   0.975    -5.343241    5.177107
        ev16 |  -2.353844   2.780983    -0.85   0.397    -7.805707    3.098018
        ev17 |   4.538102   2.693402     1.68   0.092    -.7420674    9.818272
        ev18 |  -.6579137    2.65094    -0.25   0.804     -5.85484    4.539012
        ev19 |  -2.108682   2.693468    -0.78   0.434    -7.388981    3.171618
        ev20 |   .8650374   2.653684     0.33   0.744    -4.337268    6.067343
       _cons |  -8309.569   4921.654    -1.69   0.091    -17958.02    1338.884
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,349
                                                F(24, 5334)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0411
                                                Root MSE          =     2.4281

                         (Std. Err. adjusted for 5,335 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       openn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .2083364   .0357036     5.84   0.000     .1383428    .2783301
  NONCOG_PGS |   .1666774   .0356449     4.68   0.000     .0967988    .2365559
         yob |   8.219693   5.029752     1.63   0.102    -1.640678    18.08006
        yob2 |  -.0021094   .0012952    -1.63   0.103    -.0046485    .0004296
        male |   .8176595   .0663052    12.33   0.000     .6876743    .9476447
         ev1 |   21.18693   11.32574     1.87   0.061    -1.016162    43.39002
         ev2 |   7.781991   3.747736     2.08   0.038     .4348966    15.12909
         ev3 |   8.138638   4.271575     1.91   0.057    -.2353946    16.51267
         ev4 |   13.16288   6.743821     1.95   0.051     -.057764    26.38353
         ev5 |   3.185836   2.782646     1.14   0.252    -2.269288     8.64096
         ev6 |   5.426401   2.757508     1.97   0.049     .0205582    10.83224
         ev7 |  -3.468627   2.684479    -1.29   0.196    -8.731303    1.794049
         ev8 |   3.979939   2.716481     1.47   0.143    -1.345474    9.305352
         ev9 |   1.271907   2.892956     0.44   0.660    -4.399469    6.943283
        ev10 |   6.502328   2.753811     2.36   0.018     1.103733    11.90092
        ev11 |   2.931204   2.671604     1.10   0.273    -2.306232    8.168641
        ev12 |  -1.949206     2.6986    -0.72   0.470    -7.239565    3.341153
        ev13 |  -1.716206   2.690884    -0.64   0.524    -6.991439    3.559027
        ev14 |   .0641175   2.713447     0.02   0.981    -5.255348    5.383583
        ev15 |  -.0630301   2.672235    -0.02   0.981    -5.301703    5.175643
        ev16 |  -2.084773   2.774929    -0.75   0.453    -7.524768    3.355223
        ev17 |   4.595479   2.687543     1.71   0.087    -.6732036    9.864162
        ev18 |   -.959621   2.645128    -0.36   0.717    -6.145154    4.225912
        ev19 |  -2.123823   2.680214    -0.79   0.428    -7.378139    3.130493
        ev20 |   .7280591   2.650091     0.27   0.784    -4.467203    5.923321
       _cons |  -7998.207   4883.203    -1.64   0.102    -17571.28    1574.868
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
neuro           byte    %8.0g      QQJUSTMISSING
                                            * R4 total score for neuroticism

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       neuro |      7,044    6.274418    2.930802          2         12

Linear regression                               Number of obs     =      5,308
                                                F(23, 5294)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0196
                                                Root MSE          =     2.9163

                         (Std. Err. adjusted for 5,295 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       neuro |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0324955   .0403472    -0.81   0.421    -.1115925    .0466016
         yob |    1.35515    5.43905     0.25   0.803    -9.307629    12.01793
        yob2 |  -.0003498   .0014012    -0.25   0.803    -.0030967    .0023972
        male |  -.7287135   .0801527    -9.09   0.000    -.8858459   -.5715811
         ev1 |   21.06254   17.59419     1.20   0.231    -13.42934    55.55441
         ev2 |   6.217479   5.327035     1.17   0.243    -4.225707    16.66066
         ev3 |   -1.39944   6.061868    -0.23   0.817     -13.2832    10.48432
         ev4 |   2.493728   7.888638     0.32   0.752    -12.97125    17.95871
         ev5 |  -3.727094   3.359574    -1.11   0.267    -10.31324    2.859056
         ev6 |   3.390959   3.289937     1.03   0.303    -3.058674    9.840592
         ev7 |   .4420328   3.361244     0.13   0.895     -6.14739    7.031456
         ev8 |  -2.344834   3.408812    -0.69   0.492    -9.027511    4.337844
         ev9 |   .4579803   3.436101     0.13   0.894    -6.278194    7.194154
        ev10 |  -2.220023   3.261374    -0.68   0.496    -8.613659    4.173614
        ev11 |  -4.575123    3.22291    -1.42   0.156    -10.89335    1.743108
        ev12 |   6.749175    3.23308     2.09   0.037     .4110068    13.08734
        ev13 |  -.6872823   3.255544    -0.21   0.833    -7.069491    5.694926
        ev14 |  -4.425379   3.310567    -1.34   0.181    -10.91545    2.064696
        ev15 |   1.318198   3.252069     0.41   0.685    -5.057197    7.693593
        ev16 |  -1.618329   3.274027    -0.49   0.621    -8.036771    4.800113
        ev17 |  -3.605659   3.200842    -1.13   0.260    -9.880629     2.66931
        ev18 |    3.49909    3.22091     1.09   0.277    -2.815221    9.813401
        ev19 |  -.7151123   3.238466    -0.22   0.825    -7.063841    5.633616
        ev20 |  -.4500646   3.230669    -0.14   0.889    -6.783508    5.883379
       _cons |  -1305.993   5278.215    -0.25   0.805    -11653.47    9041.484
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,308
                                                F(23, 5294)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0208
                                                Root MSE          =     2.9144

                         (Std. Err. adjusted for 5,295 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       neuro |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |  -.1102265   .0400876    -2.75   0.006    -.1888147   -.0316382
         yob |   1.350512   5.450989     0.25   0.804    -9.335673     12.0367
        yob2 |  -.0003485   .0014043    -0.25   0.804    -.0031014    .0024045
        male |  -.7291268   .0800961    -9.10   0.000    -.8861482   -.5721054
         ev1 |   20.75847   17.93891     1.16   0.247    -14.40919    55.92613
         ev2 |    5.77261   5.384533     1.07   0.284    -4.783294    16.32851
         ev3 |  -1.896684   6.144378    -0.31   0.758     -13.9422    10.14883
         ev4 |   1.921599   7.982326     0.24   0.810    -13.72705    17.57025
         ev5 |  -3.369326   3.365705    -1.00   0.317    -9.967494    3.228842
         ev6 |   3.650935    3.28079     1.11   0.266    -2.780765    10.08264
         ev7 |   .0254955   3.355382     0.01   0.994    -6.552436    6.603427
         ev8 |  -2.433937   3.406852    -0.71   0.475    -9.112771    4.244898
         ev9 |   .4595097   3.437849     0.13   0.894    -6.280091    7.199111
        ev10 |   -2.48443   3.262118    -0.76   0.446    -8.879527    3.910666
        ev11 |  -4.656272   3.219895    -1.45   0.148    -10.96859    1.656049
        ev12 |   6.480911   3.230641     2.01   0.045      .147523     12.8143
        ev13 |   -.829141   3.253912    -0.25   0.799    -7.208149    5.549867
        ev14 |  -4.518372   3.311333    -1.36   0.172    -11.00995    1.973207
        ev15 |   1.191977   3.253388     0.37   0.714    -5.186004    7.569958
        ev16 |   -1.76255   3.268055    -0.54   0.590    -8.169285    4.644184
        ev17 |  -3.498442   3.201442    -1.09   0.275    -9.774588    2.777703
        ev18 |   3.299452   3.219995     1.02   0.306    -3.013065    9.611969
        ev19 |   -1.01217   3.236278    -0.31   0.754    -7.356608    5.332268
        ev20 |  -.3200129   3.228842    -0.10   0.921    -6.649874    6.009849
       _cons |  -1301.925   5289.795    -0.25   0.806     -11672.1    9068.254
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,308
                                                F(24, 5294)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0216
                                                Root MSE          =     2.9136

                         (Std. Err. adjusted for 5,295 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       neuro |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0859963   .0438366    -1.96   0.050     -.171934   -.0000585
  NONCOG_PGS |  -.1423758   .0436352    -3.26   0.001    -.2279187   -.0568329
         yob |   1.475481   5.448227     0.27   0.787    -9.205289    12.15625
        yob2 |  -.0003807   .0014036    -0.27   0.786    -.0031323    .0023709
        male |   -.730169   .0800732    -9.12   0.000    -.8871455   -.5731924
         ev1 |   19.78757   17.85659     1.11   0.268    -15.21871    54.79385
         ev2 |   4.980348   5.392267     0.92   0.356    -5.590718    15.55141
         ev3 |  -2.101171   6.123633    -0.34   0.732    -14.10602    9.903675
         ev4 |   1.661877   7.965794     0.21   0.835    -13.95436    17.27812
         ev5 |  -2.948281   3.367295    -0.88   0.381    -9.549567    3.653005
         ev6 |   4.168713   3.298411     1.26   0.206    -2.297533    10.63496
         ev7 |    .166935   3.357015     0.05   0.960    -6.414198    6.748068
         ev8 |  -2.325556   3.401345    -0.68   0.494    -8.993595    4.342482
         ev9 |   .6425895   3.435197     0.19   0.852    -6.091813    7.376992
        ev10 |  -2.392127   3.261517    -0.73   0.463    -8.786044    4.001791
        ev11 |  -4.522928   3.217926    -1.41   0.160    -10.83139    1.785533
        ev12 |   6.358967   3.233112     1.97   0.049     .0207342     12.6972
        ev13 |  -.7598599   3.253928    -0.23   0.815      -7.1389     5.61918
        ev14 |  -4.578414   3.309711    -1.38   0.167    -11.06681    1.909984
        ev15 |   1.189273   3.252748     0.37   0.715    -5.187454       7.566
        ev16 |   -1.86112   3.266725    -0.57   0.569    -8.265249    4.543008
        ev17 |  -3.534021   3.201052    -1.10   0.270    -9.809402    2.741361
        ev18 |   3.424914    3.21853     1.06   0.287    -2.884732    9.734559
        ev19 |  -1.024587   3.237347    -0.32   0.752    -7.371123    5.321948
        ev20 |  -.2710424   3.227652    -0.08   0.933    -6.598571    6.056487
       _cons |  -1423.168   5286.891    -0.27   0.788    -11787.65    8941.318
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
consc           byte    %8.0g      QQJUSTMISSING
                                            * R4 total score for conscientiousness

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       consc |      7,133    9.539184     2.28004          2         12

Linear regression                               Number of obs     =      5,364
                                                F(23, 5350)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0043
                                                Root MSE          =     2.2657

                         (Std. Err. adjusted for 5,351 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       consc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0225244   .0311029    -0.72   0.469    -.0834987    .0384499
         yob |  -2.044359   4.061155    -0.50   0.615    -10.00588     5.91716
        yob2 |   .0005243   .0010462     0.50   0.616    -.0015267    .0025753
        male |   -.142446   .0622544    -2.29   0.022    -.2644901   -.0204019
         ev1 |  -.0150874   10.67192    -0.00   0.999     -20.9364    20.90622
         ev2 |   1.520215    3.53739     0.43   0.667    -5.414511    8.454942
         ev3 |   .7464449   3.958004     0.19   0.850    -7.012856    8.505746
         ev4 |   .2585666   5.266132     0.05   0.961     -10.0652    10.58233
         ev5 |   4.598436   2.562863     1.79   0.073    -.4258193    9.622692
         ev6 |   -1.83275   2.553774    -0.72   0.473    -6.839187    3.173688
         ev7 |   -.147225   2.507012    -0.06   0.953     -5.06199     4.76754
         ev8 |   .0905793   2.585549     0.04   0.972    -4.978151     5.15931
         ev9 |   1.896345   2.692854     0.70   0.481    -3.382748    7.175437
        ev10 |   2.348271   2.561186     0.92   0.359    -2.672698     7.36924
        ev11 |   1.664449   2.493081     0.67   0.504    -3.223006    6.551904
        ev12 |  -3.973514   2.521178    -1.58   0.115    -8.916049    .9690219
        ev13 |   .2236656   2.519003     0.09   0.929    -4.714607    5.161938
        ev14 |  -3.972253   2.516228    -1.58   0.114    -8.905086    .9605793
        ev15 |  -.6729837   2.489843    -0.27   0.787    -5.554091    4.208123
        ev16 |  -4.853041   2.488856    -1.95   0.051    -9.732213    .0261321
        ev17 |  -.0582675   2.448876    -0.02   0.981    -4.859062    4.742527
        ev18 |  -1.595184   2.499931    -0.64   0.523    -6.496067    3.305699
        ev19 |  -2.763411   2.535272    -1.09   0.276    -7.733578    2.206756
        ev20 |  -.3057488   2.519489    -0.12   0.903    -5.244974    4.633476
       _cons |   2002.345   3941.124     0.51   0.611    -5723.863    9728.554
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,364
                                                F(23, 5350)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0050
                                                Root MSE          =     2.2649

                         (Std. Err. adjusted for 5,351 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       consc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   -.066579   .0304938    -2.18   0.029    -.1263592   -.0067987
         yob |  -2.037977   4.048568    -0.50   0.615    -9.974819    5.898866
        yob2 |   .0005227    .001043     0.50   0.616    -.0015219    .0025674
        male |  -.1425649   .0622272    -2.29   0.022    -.2645556   -.0205742
         ev1 |  -.2545788   10.56586    -0.02   0.981    -20.96797    20.45881
         ev2 |   1.254302   3.505096     0.36   0.720    -5.617114    8.125717
         ev3 |   .3989206     3.9384     0.10   0.919    -7.321949     8.11979
         ev4 |  -.1061665   5.222052    -0.02   0.984    -10.34352    10.13118
         ev5 |   4.821595   2.558988     1.88   0.060    -.1950646    9.838254
         ev6 |   -1.67363   2.553978    -0.66   0.512    -6.680467    3.333207
         ev7 |  -.4033805   2.500917    -0.16   0.872    -5.306197    4.499436
         ev8 |   .0091323   2.582751     0.00   0.997    -5.054112    5.072377
         ev9 |    1.91626   2.689634     0.71   0.476    -3.356518    7.189038
        ev10 |   2.184603   2.561361     0.85   0.394    -2.836708    7.205914
        ev11 |   1.589834   2.491732     0.64   0.523    -3.294976    6.474644
        ev12 |  -4.149331   2.522304    -1.65   0.100    -9.094075    .7954135
        ev13 |   .1534231   2.519887     0.06   0.951    -4.786582    5.093428
        ev14 |  -4.013789   2.512993    -1.60   0.110    -8.940278    .9127013
        ev15 |  -.7481126   2.493344    -0.30   0.764    -5.636083    4.139857
        ev16 |  -4.937242   2.488867    -1.98   0.047    -9.816435   -.0580482
        ev17 |  -.0029464   2.447777    -0.00   0.999    -4.801588    4.795695
        ev18 |  -1.759433   2.501008    -0.70   0.482    -6.662428    3.143562
        ev19 |  -2.931254   2.533887    -1.16   0.247    -7.898705    2.036197
        ev20 |   -.257044   2.522355    -0.10   0.919    -5.201888      4.6878
       _cons |   1995.896   3928.874     0.51   0.611    -5706.298     9698.09
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,364
                                                F(24, 5350)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0055
                                                Root MSE          =     2.2645

                         (Std. Err. adjusted for 5,351 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       consc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0553459   .0334882    -1.65   0.098    -.1209965    .0103046
  NONCOG_PGS |  -.0872835   .0328291    -2.66   0.008    -.1516419   -.0229252
         yob |  -1.972912   4.070231    -0.48   0.628    -9.952223    6.006398
        yob2 |    .000506   .0010486     0.48   0.629    -.0015497    .0025616
        male |  -.1430711   .0622156    -2.30   0.022    -.2650391   -.0211032
         ev1 |  -.8407359    10.5161    -0.08   0.936    -21.45658    19.77511
         ev2 |   .7358716   3.507857     0.21   0.834    -6.140958    7.612701
         ev3 |   .2768203   3.922543     0.07   0.944    -7.412963    7.966603
         ev4 |  -.2519077   5.198704    -0.05   0.961    -10.44349    9.939671
         ev5 |   5.095854   2.560974     1.99   0.047     .0753009    10.11641
         ev6 |  -1.347943   2.552148    -0.53   0.597    -6.351194    3.655307
         ev7 |  -.3122273   2.502352    -0.12   0.901    -5.217857    4.593403
         ev8 |   .0878261   2.582303     0.03   0.973     -4.97454    5.150192
         ev9 |   2.028662   2.691063     0.75   0.451    -3.246918    7.304241
        ev10 |   2.252712   2.563034     0.88   0.379     -2.77188    7.277304
        ev11 |   1.677583   2.492133     0.67   0.501    -3.208013    6.563179
        ev12 |  -4.227284   2.520523    -1.68   0.094    -9.168536    .7139686
        ev13 |   .1916389    2.51966     0.08   0.939    -4.747922      5.1312
        ev14 |   -4.06768   2.514757    -1.62   0.106    -8.997629    .8622683
        ev15 |  -.7604209   2.491963    -0.31   0.760    -5.645685    4.124843
        ev16 |  -4.998434   2.489727    -2.01   0.045    -9.879313   -.1175552
        ev17 |  -.0246365   2.446508    -0.01   0.992    -4.820788    4.771515
        ev18 |  -1.673134    2.49944    -0.67   0.503    -6.573055    3.226787
        ev19 |  -2.929927    2.53221    -1.16   0.247    -7.894091    2.034238
        ev20 |  -.2231957   2.521813    -0.09   0.929    -5.166978    4.720586
       _cons |   1932.701   3949.944     0.49   0.625    -5810.798    9676.201
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
agree           byte    %8.0g      QQJUSTMISSING
                                            * R4 total score for agreeableness

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |      7,120    9.898174    2.031124          2         12

Linear regression                               Number of obs     =      5,355
                                                F(23, 5341)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0269
                                                Root MSE          =     1.9925

                         (Std. Err. adjusted for 5,342 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       agree |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0386669    .027686    -1.40   0.163    -.0929427    .0156089
         yob |  -1.070121   3.704363    -0.29   0.773    -8.332185    6.191944
        yob2 |   .0002697   .0009551     0.28   0.778    -.0016026     .002142
        male |  -.5770993   .0549222   -10.51   0.000    -.6847692   -.4694295
         ev1 |  -14.04294   9.047253    -1.55   0.121    -31.77925    3.693365
         ev2 |  -2.448549    3.18455    -0.77   0.442    -8.691567     3.79447
         ev3 |   3.735512   3.493189     1.07   0.285    -3.112565    10.58359
         ev4 |    2.58293   5.114457     0.51   0.614    -7.443493    12.60935
         ev5 |   3.076833   2.395194     1.28   0.199    -1.618726    7.772391
         ev6 |  -.3112754   2.345892    -0.13   0.894    -4.910182    4.287631
         ev7 |     1.1879   2.280849     0.52   0.603    -3.283494    5.659295
         ev8 |  -.0181658   2.340938    -0.01   0.994     -4.60736    4.571028
         ev9 |  -1.725308    2.34004    -0.74   0.461    -6.312743    2.862126
        ev10 |  -2.765289   2.164201    -1.28   0.201    -7.008007    1.477429
        ev11 |   .4632693   2.194525     0.21   0.833    -3.838895    4.765434
        ev12 |  -2.227217   2.244544    -0.99   0.321    -6.627439    2.173005
        ev13 |   .7609714   2.187681     0.35   0.728    -3.527776    5.049719
        ev14 |   -1.55537   2.233782    -0.70   0.486    -5.934496    2.823755
        ev15 |  -4.414154   2.228498    -1.98   0.048     -8.78292   -.0453873
        ev16 |  -.4212451   2.218034    -0.19   0.849    -4.769497    3.927007
        ev17 |    1.40657   2.203217     0.64   0.523    -2.912633    5.725774
        ev18 |   2.359302   2.201012     1.07   0.284    -1.955579    6.674184
        ev19 |   .0465001   2.214158     0.02   0.983    -4.294153    4.387153
        ev20 |  -3.679988   2.201863    -1.67   0.095    -7.996538     .636562
       _cons |   1071.269   3592.342     0.30   0.766    -5971.188    8113.726
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,355
                                                F(23, 5341)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0269
                                                Root MSE          =     1.9925

                         (Std. Err. adjusted for 5,342 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       agree |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   .0382391    .027737     1.38   0.168    -.0161367     .092615
         yob |  -1.128472    3.71877    -0.30   0.762    -8.418779    6.161835
        yob2 |   .0002847   .0009588     0.30   0.767    -.0015949    .0021642
        male |  -.5763453   .0549207   -10.49   0.000    -.6840122   -.4686784
         ev1 |  -13.47621   9.050568    -1.49   0.137    -31.21902    4.266595
         ev2 |  -1.944141   3.182244    -0.61   0.541     -8.18264    4.294357
         ev3 |   3.949475   3.500881     1.13   0.259    -2.913681    10.81263
         ev4 |   2.827988    5.12693     0.55   0.581    -7.222888    12.87886
         ev5 |   2.776362   2.401998     1.16   0.248    -1.932534    7.485259
         ev6 |  -.6304028   2.349043    -0.27   0.788    -5.235485     3.97468
         ev7 |    1.19556   2.278517     0.52   0.600    -3.271264    5.662384
         ev8 |  -.0647948   2.337825    -0.03   0.978    -4.647887    4.518298
         ev9 |  -1.838601    2.33769    -0.79   0.432    -6.421427    2.744226
        ev10 |  -2.748915   2.162822    -1.27   0.204    -6.988928    1.491098
        ev11 |   .4188325   2.192378     0.19   0.849    -3.879124    4.716789
        ev12 |  -2.105261   2.246102    -0.94   0.349    -6.508538    2.298017
        ev13 |    .754524   2.186946     0.35   0.730    -3.532782     5.04183
        ev14 |  -1.505115   2.233299    -0.67   0.500    -5.883293    2.873063
        ev15 |   -4.37394   2.230162    -1.96   0.050    -8.745968   -.0019124
        ev16 |  -.3423475   2.216547    -0.15   0.877    -4.687684    4.002989
        ev17 |   1.400507   2.203794     0.64   0.525    -2.919829    5.720844
        ev18 |   2.349966   2.201726     1.07   0.286    -1.966316    6.666248
        ev19 |   .0979922   2.217545     0.04   0.965    -4.249301    4.445285
        ev20 |  -3.729693   2.200387    -1.70   0.090     -8.04335    .5839641
       _cons |   1127.973   3606.182     0.31   0.754    -5941.616    8197.562
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      5,355
                                                F(24, 5341)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0271
                                                Root MSE          =     1.9925

                         (Std. Err. adjusted for 5,342 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
       agree |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |  -.0282162   .0297072    -0.95   0.342    -.0864545    .0300221
  NONCOG_PGS |   .0276287   .0297633     0.93   0.353    -.0307197     .085977
         yob |  -1.089192   3.707289    -0.29   0.769    -8.356991    6.178608
        yob2 |   .0002746   .0009558     0.29   0.774    -.0015991    .0021482
        male |  -.5767332   .0549133   -10.50   0.000    -.6843858   -.4690806
         ev1 |  -13.79007   9.070217    -1.52   0.128     -31.5714    3.991254
         ev2 |  -2.207321   3.192714    -0.69   0.489    -8.466343    4.051702
         ev3 |   3.881911   3.504612     1.11   0.268     -2.98856    10.75238
         ev4 |   2.745035   5.122736     0.54   0.592    -7.297619    12.78769
         ev5 |   2.918413   2.410387     1.21   0.226     -1.80693    7.643756
         ev6 |  -.4627662   2.354227    -0.20   0.844    -5.078012     4.15248
         ev7 |   1.237923   2.278592     0.54   0.587    -3.229047    5.704894
         ev8 |  -.0215508   2.339817    -0.01   0.993    -4.608548    4.565447
         ev9 |  -1.774224   2.338706    -0.76   0.448    -6.359042    2.810594
        ev10 |  -2.730606   2.163476    -1.26   0.207    -6.971903    1.510691
        ev11 |   .4588028   2.194456     0.21   0.834    -3.843228    4.760833
        ev12 |  -2.148439    2.24581    -0.96   0.339    -6.551143    2.254265
        ev13 |   .7724506   2.187386     0.35   0.724     -3.51572    5.060621
        ev14 |  -1.529491   2.233126    -0.68   0.493    -5.907328    2.848347
        ev15 |  -4.381917   2.229318    -1.97   0.049    -8.752291   -.0115439
        ev16 |  -.3761918   2.217386    -0.17   0.865    -4.723173    3.970789
        ev17 |   1.393736   2.204003     0.63   0.527    -2.927009     5.71448
        ev18 |   2.387409   2.201079     1.08   0.278    -1.927605    6.702423
        ev19 |   .0964382   2.216912     0.04   0.965    -4.249615    4.442491
        ev20 |  -3.709411   2.202726    -1.68   0.092    -8.027653    .6088314
       _cons |   1089.869   3595.019     0.30   0.762    -5957.835    8137.574
------------------------------------------------------------------------------

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------
attractive      byte    %8.0g      HA103REA * R6 Interviewer's assesment of
                                                participant's attractiveness

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  attractive |      5,814    7.247334    1.806021          0         10

Linear regression                               Number of obs     =      4,262
                                                F(23, 4255)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0080
                                                Root MSE          =     1.7981

                         (Std. Err. adjusted for 4,256 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
  attractive |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .0027476   .0278882     0.10   0.922    -.0519277    .0574229
         yob |    -3.7304   4.810246    -0.78   0.438    -13.16099    5.700191
        yob2 |   .0009657   .0012392     0.78   0.436    -.0014637    .0033952
        male |  -.1605123   .0551614    -2.91   0.004    -.2686575   -.0523671
         ev1 |  -8.198562   8.602684    -0.95   0.341    -25.06431    8.667188
         ev2 |  -.4943531    3.01079    -0.16   0.870    -6.397073    5.408366
         ev3 |  -3.122036   3.318164    -0.94   0.347    -9.627368    3.383296
         ev4 |  -2.118856   4.730529    -0.45   0.654    -11.39316    7.155448
         ev5 |   5.193608   2.355695     2.20   0.028     .5752168    9.811998
         ev6 |   1.048875   2.287288     0.46   0.647    -3.435403    5.533152
         ev7 |  -3.975326   2.260665    -1.76   0.079    -8.407409     .456757
         ev8 |  -2.559606    2.34513    -1.09   0.275    -7.157285    2.038073
         ev9 |  -.4464213   2.381239    -0.19   0.851    -5.114893     4.22205
        ev10 |  -2.185588   2.253628    -0.97   0.332    -6.603874    2.232698
        ev11 |  -1.948706   2.185488    -0.89   0.373    -6.233403    2.335991
        ev12 |   -4.86183   2.259823    -2.15   0.031    -9.292262    -.431397
        ev13 |  -1.255016   2.234471    -0.56   0.574    -5.635745    3.125712
        ev14 |   1.409753   2.316988     0.61   0.543    -3.132751    5.952258
        ev15 |    1.20725   2.292602     0.53   0.599    -3.287445    5.701945
        ev16 |   .2758486   2.248114     0.12   0.902    -4.131627    4.683324
        ev17 |   .8192927   2.288163     0.36   0.720      -3.6667    5.305285
        ev18 |   -3.45222   2.205669    -1.57   0.118    -7.776481    .8720421
        ev19 |   1.007355   2.264826     0.44   0.656    -3.432886    5.447597
        ev20 |   2.893082   2.302964     1.26   0.209    -1.621929    7.408092
       _cons |   3609.608   4668.156     0.77   0.439    -5542.413    12761.63
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,262
                                                F(23, 4255)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0082
                                                Root MSE          =     1.7979

                         (Std. Err. adjusted for 4,256 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
  attractive |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  NONCOG_PGS |   .0258765    .026933     0.96   0.337    -.0269261    .0786792
         yob |  -3.809403   4.806608    -0.79   0.428    -13.23286    5.614057
        yob2 |   .0009861   .0012382     0.80   0.426    -.0014415    .0034137
        male |  -.1604246   .0551549    -2.91   0.004     -.268557   -.0522921
         ev1 |  -8.160499   8.577926    -0.95   0.341    -24.97771     8.65671
         ev2 |  -.3709974    3.01399    -0.12   0.902     -6.27999    5.537995
         ev3 |  -2.983151   3.320774    -0.90   0.369    -9.493601    3.527299
         ev4 |  -1.969669   4.725102    -0.42   0.677    -11.23333    7.293995
         ev5 |   5.101385    2.36579     2.16   0.031     .4632026    9.739568
         ev6 |   .9736358   2.284421     0.43   0.670    -3.505022    5.452294
         ev7 |  -3.884614   2.260049    -1.72   0.086     -8.31549    .5462613
         ev8 |  -2.572438    2.34544    -1.10   0.273    -7.170724    2.025848
         ev9 |  -.4578441   2.378158    -0.19   0.847    -5.120275    4.204587
        ev10 |  -2.127471   2.253867    -0.94   0.345    -6.546226    2.291284
        ev11 |  -1.913841   2.183527    -0.88   0.381    -6.194693    2.367012
        ev12 |  -4.806916   2.257212    -2.13   0.033    -9.232229   -.3816023
        ev13 |  -1.237028   2.234107    -0.55   0.580    -5.617044    3.142988
        ev14 |    1.42673   2.317614     0.62   0.538    -3.117002    5.970462
        ev15 |   1.249671   2.292405     0.55   0.586    -3.244639    5.743982
        ev16 |   .3275259   2.247624     0.15   0.884    -4.078989    4.734041
        ev17 |   .7960739   2.290383     0.35   0.728    -3.694272     5.28642
        ev18 |  -3.395621   2.203845    -1.54   0.123    -7.716307    .9250661
        ev19 |   1.070053   2.267704     0.47   0.637    -3.375831    5.515936
        ev20 |   2.839118   2.304058     1.23   0.218    -1.678037    7.356273
       _cons |   3686.394   4664.574     0.79   0.429    -5458.604    12831.39
------------------------------------------------------------------------------

Linear regression                               Number of obs     =      4,262
                                                F(24, 4255)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0083
                                                Root MSE          =     1.7981

                         (Std. Err. adjusted for 4,256 clusters in familypriv)
------------------------------------------------------------------------------
             |               Robust
  attractive |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     COG_PGS |   .0152924   .0304061     0.50   0.615    -.0443194    .0749043
  NONCOG_PGS |   .0317054   .0293717     1.08   0.280    -.0258785    .0892893
         yob |  -3.833031   4.804413    -0.80   0.425    -13.25219    5.586124
        yob2 |   .0009921   .0012377     0.80   0.423    -.0014344    .0034186
        male |  -.1600675   .0551668    -2.90   0.004    -.2682231   -.0519118
         ev1 |  -8.025098   8.569444    -0.94   0.349    -24.82568    8.775482
         ev2 |  -.2406236   3.015006    -0.08   0.936    -6.151608     5.67036
         ev3 |  -2.959685   3.319682    -0.89   0.373    -9.467994    3.548623
         ev4 |  -1.927242   4.727213    -0.41   0.684    -11.19505    7.340562
         ev5 |   5.019292   2.369298     2.12   0.034     .3742328    9.664352
         ev6 |   .8715984   2.286435     0.38   0.703    -3.611008    5.354204
         ev7 |  -3.911278   2.260778    -1.73   0.084    -8.343582    .5210264
         ev8 |  -2.591708   2.345778    -1.10   0.269    -7.190657    2.007241
         ev9 |  -.4852666   2.380459    -0.20   0.838    -5.152207    4.181674
        ev10 |  -2.130225   2.254573    -0.94   0.345    -6.550363    2.289913
        ev11 |    -1.9322   2.184114    -0.88   0.376    -6.214203    2.349804
        ev12 |  -4.776134   2.257181    -2.12   0.034    -9.201387   -.3508821
        ev13 |  -1.243237     2.2346    -0.56   0.578     -5.62422    3.137745
        ev14 |   1.428405   2.317999     0.62   0.538    -3.116082    5.972892
        ev15 |   1.244924   2.292515     0.54   0.587      -3.2496    5.739449
        ev16 |   .3461728   2.248365     0.15   0.878    -4.061796    4.754141
        ev17 |   .8018356   2.290465     0.35   0.726     -3.68867    5.292341
        ev18 |  -3.441424   2.204848    -1.56   0.119    -7.764076    .8812271
        ev19 |   1.052964   2.266259     0.46   0.642    -3.390085    5.496013
        ev20 |   2.830338    2.30454     1.23   0.219    -1.687763    7.348439
       _cons |   3709.403   4662.517     0.80   0.426    -5431.563    12850.37
------------------------------------------------------------------------------
. 
. 
. 
. *--------------Coefficient plot output
. *-- Cognitive PGS
. coefplot  (both_eduyears , aseq(Years of edu)) ///
>           (both_iq , aseq(IQ)) ///
>           (both_extra, aseq(Extraversion)) ///
>           (both_openn, aseq(Openness)) ///
>           (both_neuro, aseq(Neuroticism)) ///
>           (both_consc, aseq(Conscientiousness)) ///
>           (both_agree, aseq(Agreeableness)) ///
>           (both_attractive, aseq(Attractiveness)) ///
>    , keep(COG_PGS) ///
>    msymbol(D) xline(0) byopts(xrescale) levels(95 90) ciopts(recast(. rcap)) legend
> (order(1 "95% c.i." 2 "90% c.i." )) graphregion(color(white)) bgcolor(white) ///cio
> pts(lwidth(2 ..) lcolor(*.2 *.4 ; )) xlabel(-.12(.04).12) 
>    aseq swapnames 
. 
. graph save   coefplot_cog, replace
(file coefplot_cog.gph saved)
. graph export coefplot_cog.png, replace
(file coefplot_cog.png written in PNG format)
. 
. *-- Noncognitive PGS
. coefplot  (both_eduyears , aseq(Years of edu)) ///
>           (both_iq , aseq(IQ)) ///
>           (both_extra, aseq(Extraversion)) ///
>           (both_openn, aseq(Openness)) ///
>           (both_neuro, aseq(Neuroticism)) ///
>           (both_consc, aseq(Conscientiousness)) ///
>           (both_agree, aseq(Agreeableness)) ///
>           (both_attractive, aseq(Attractiveness)) ///
>    , keep(NONCOG_PGS) ///
>    msymbol(D) xline(0) byopts(xrescale) levels(95 90) ciopts(recast(. rcap)) legend
> (order(1 "95% c.i." 2 "90% c.i." )) graphregion(color(white)) bgcolor(white) ///cio
> pts(lwidth(2 ..) lcolor(*.2 *.4 ; )) xlabel(-.12(.04).12) 
>    aseq swapnames 
. 
. graph save   coefplot_noncog, replace
(file coefplot_noncog.gph saved)
. graph export coefplot_noncog.png, replace
(file coefplot_noncog.png written in PNG format)
. 
. 
. *-- Both PGS
. coefplot  (both_eduyears , aseq(Years of edu)) ///
>           (both_iq , aseq(IQ)) ///
>           (both_extra, aseq(Extraversion)) ///
>           (both_openn, aseq(Openness)) ///
>           (both_neuro, aseq(Neuroticism)) ///
>           (both_consc, aseq(Conscientiousness)) ///
>           (both_agree, aseq(Agreeableness)) ///
>           (both_attractive, aseq(Attractiveness)) ///
>    , keep(COG_PGS NONCOG_PGS) ///
>    msymbol(D) xline(0) byopts(xrescale) levels(95 90) ciopts(recast(. rcap)) legend
> (order(1 "95% c.i." 2 "90% c.i." )) graphregion(color(white)) bgcolor(white) ///cio
> pts(lwidth(2 ..) lcolor(*.2 *.4 ; )) xlabel(-.12(.04).12) 
>    aseq swapnames 
. 
. graph save   coefplot_both, replace
(file coefplot_both.gph saved)
. graph export coefplot_both.png, replace
(file coefplot_both.png written in PNG format)
. 
. 
. } // end RUNREG

. 
. log close
      name:  <unnamed>
       log:  /Users/michellerosenberger/Development/GEIGHEI/WLSanalysis/WLS/output/co
> gNoncog_WLS.log
  log type:  text
 closed on:  28 Mar 2019, 10:25:34
-------------------------------------------------------------------------------------
